
 var infor = {"content":[{"name":"name","value":"三生三世十里桃花"},{"name":"导演","value":"林玉芬"},{"name":"主演","value":"杨幂 赵又廷 张智尧 迪丽热巴 "},{"name":"类型","value":"剧情 爱情"},{"name":"制片国家/地区","value":"中国大陆"},{"name":"上映日期","value":"2017"},{"name":"summary","value":"妖君擎苍向神族挑起战争，神族付出惨痛代价封印了擎苍，同年天孙夜华出世。七万年后擎苍破出封印，青丘狐帝幺女白浅再次将擎苍封印，因此被封法力、记忆和容貌，落入凡尘与夜华相识、相恋，后被带入天宫。\n天宫中，爱慕夜华的素锦屡次陷害白浅，并让白浅误会夜华冷酷无情，继而又害白浅被挖双眼。白浅伤心欲绝，产子后，纵身跃下诛仙台。因诛仙台戾气破解封印，她恢复记忆，为忘记夜华，饮下忘情药。\n百年后二人在东海重逢。夜华认出白浅，相随相伴，再续前缘，更唤醒白浅记忆。面对往日仇怨，白浅问素锦讨回双眼，怎料又中了素锦的计，再不肯原谅夜华。此时擎苍再次醒转，夜华来不及解释，亲自斩杀擎苍,付出生命封了东皇钟，面对魂飞魄散的夜华，白浅悔恨自责。幸而三年后，夜华苏醒，二人再续前缘。"},{"name":"评分","value":6.3},{"name":"image","value":"https://img5.doubanio.com/view/movie_poster_cover/lpst/public/p2412572406.jpg"},{"name":"id","value":"25975243"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [139265,145371,130514,123755,149288,165467,171640,126038,187132,232392,950475,1958746,1915455,1857706,1976354,2057933,2262679,2262120,2156060,2260603,2381797,2569501,2640704,2569753,2306103,2109670,2214650,2083330,2113334,2108991,2050911,1999562,2028906,2160301,1986446,1871517,1987167,1889422,1731086,1734110,1896087,35189,1068715,1078110,966190]
            }, ]
        };

        var word_list = [{"text":"特效","weight":0.08879310530513113},{"text":"拖沓","weight":0.4144548123495292},{"text":"紧凑","weight":0.1252941326227097},{"text":"不错","weight":0.4262685295374341},{"text":"惊喜","weight":0.2718192060139066},{"text":"精致","weight":0.23059776183905115},{"text":"尴尬","weight":0.36315270143378536},{"text":"矫情","weight":0.3617369476791228},{"text":"一星","weight":0.326600724685143},{"text":"干净","weight":0.3434329097902522},{"text":"很惨","weight":0.07620787247697448},{"text":"合适","weight":0.1670775353132414},{"text":"真诚","weight":0.2770603790788155},{"text":"优秀","weight":0.2814569708040182},{"text":"充满","weight":0.018734554540361242},{"text":"诚意","weight":0.3014137258560111},{"text":"憨傻","weight":0.278803005770782},{"text":"苦楚","weight":0.20959265492962295},{"text":"揪心","weight":0.30478201009645783},{"text":"可久","weight":0.2540971501665647},{"text":"好好看","weight":0.09210235322664151},{"text":"最美","weight":0.23109896234150076},{"text":"灵动","weight":0.12096592514262526},{"text":"简单","weight":0.18980930365963541},{"text":"毒辣","weight":0.1727518004065593},{"text":"微博","weight":0.18288073394346743},{"text":"乐趣","weight":0.07025393047743429},{"text":"温柔","weight":0.10534148409008154},{"text":"好奇","weight":0.012149660954629191},{"text":"腐朽","weight":0.24330688818007215},{"text":"封建","weight":0.12773409399494381},{"text":"清雅","weight":0.19909802302889582},{"text":"古朴","weight":0.01254935705463623},{"text":"愤慨","weight":0.2171529948426861},{"text":"激昂","weight":0.06104510109012358},{"text":"演技","weight":0.5997036653596158},{"text":"剧情","weight":0.2324838061684918},{"text":"电视剧","weight":0.1939066500651613},{"text":"演员","weight":0.09074281414136698},{"text":"颜值","weight":0.1426146021283552},{"text":"造型","weight":0.2695594258496745},{"text":"故事","weight":0.04392710318454783},{"text":"配角","weight":0.1436864007941612},{"text":"台词","weight":0.0287260423460711},{"text":"角色","weight":0.1867969799361536},{"text":"主角","weight":0.1668843300682643},{"text":"男主","weight":0.15266235977994783},{"text":"情节","weight":0.035093623654552854},{"text":"人物","weight":0.010159755939420891},{"text":"白浅","weight":0.12468168247489808},{"text":"仙侠","weight":0.08027833432062625},{"text":"配音","weight":0.06342058522732606},{"text":"国产","weight":0.008117464617731125},{"text":"墨渊","weight":0.1364163428662345},{"text":"神仙","weight":0.1381616795113281},{"text":"作者","weight":0.08699039526459346},{"text":"素素","weight":0.004134279022671615},{"text":"观众","weight":0.011469185364408606},{"text":"夜华","weight":0.02034804413658505},{"text":"主演","weight":0.05794627657387537},{"text":"女主","weight":0.03317149426070697},{"text":"用心","weight":0.08974943212137232},{"text":"布景","weight":0.010964416101639335},{"text":"恶心","weight":0.07253628859576584},{"text":"古装","weight":0.07577170298344313},{"text":"衣服","weight":0.03766308417164895},{"text":"男女","weight":0.08717885281699664},{"text":"仙气","weight":0.027878850615781024},{"text":"背景","weight":0.02405143022530268},{"text":"编剧","weight":0.08763798502692537},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        