
 var infor = {"content":[{"name":"name","value":"半妖倾城"},{"name":"导演","value":"任海曜"},{"name":"主演","value":"张哲瀚 许晓诺 李一桐 米热 "},{"name":"类型","value":"剧情 爱情 奇幻"},{"name":"制片国家/地区","value":"中国大陆"},{"name":"上映日期","value":"2016"},{"name":"summary","value":"《半妖倾城》是一部民国玄幻爱情剧，改编自墨白千九的同名小说，涵盖热血、感情、奇幻、偶像多种元素为一体，同时紧扣清末民初的大时代背景，讲述了半妖聂倾城（李一桐 饰）、江雪舞（何瑞贤 饰）、明夏（张哲瀚 饰）三人之间的爱恨纠葛为主线的一场人妖之间的旷世绝恋。"},{"name":"评分","value":4},{"name":"image","value":"https://img5.doubanio.com/view/movie_poster_cover/lpst/public/p2364578346.jpg"},{"name":"id","value":"26680434"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [129797,81560,69593,6,91936,109617,142868,129757,79825,68247,63386,78660,99220,132177,128958,74952,69404,66499,76716,99203,139277,128787,105680,73372,68021,76599,91771,136417,144525,88883,80792,65852,75649,124008,160440,155339,84080,76118,56379,57100,74843,118044,112326,73978,52064]
            }, ]
        };

        var word_list = [{"text":"不错","weight":1.2240611506565091},{"text":"特效","weight":0.957525861943604},{"text":"缠绵","weight":0.056419044174417544},{"text":"尴尬","weight":0.8314077625364633},{"text":"完整","weight":0.836841691219973},{"text":"幼稚","weight":0.008221543438493024},{"text":"无聊","weight":0.10134279929838551},{"text":"很美","weight":0.8630248668575006},{"text":"厉害","weight":0.16910884024682613},{"text":"独特","weight":0.3231425329938346},{"text":"雅致","weight":0.911837034683937},{"text":"落差","weight":0.681109154854737},{"text":"稀碎","weight":0.24570406949115053},{"text":"矫情","weight":0.285404924908555},{"text":"曲折","weight":0.3718812511074772},{"text":"最烂","weight":0.13648617586042394},{"text":"好好看","weight":0.25474299638533193},{"text":"好奇","weight":0.2864863124779687},{"text":"拖沓","weight":0.05072225674900694},{"text":"挺好","weight":0.46374921423060034},{"text":"太穷","weight":0.047415871161769915},{"text":"郑爽","weight":0.02665551356873938},{"text":"漂亮","weight":0.0469693855949012},{"text":"精致","weight":0.11457676584749499},{"text":"良心","weight":0.05873165178670856},{"text":"豪华","weight":0.08672704347789809},{"text":"混乱","weight":0.13142099616034064},{"text":"很大","weight":0.060181308569372614},{"text":"羞耻","weight":0.0517807754860971},{"text":"很好","weight":0.07257129777445771},{"text":"妖艳","weight":0.10591769665022463},{"text":"细致","weight":0.09178495835439426},{"text":"娇情","weight":0.017433119362552114},{"text":"不由","weight":0.09390454566575172},{"text":"心疼","weight":0.09636539519015444},{"text":"女主","weight":0.11882837122198626},{"text":"剧情","weight":0.22325811093521833},{"text":"演技","weight":0.12773657298148688},{"text":"颜值","weight":0.2847494368958079},{"text":"电视剧","weight":0.060558848069963},{"text":"造型","weight":0.22545793894061428},{"text":"台词","weight":0.2134403527573103},{"text":"男主","weight":0.19626508981199714},{"text":"民国","weight":0.18313229653567087},{"text":"倾城","weight":0.23528789353149432},{"text":"妈妈","weight":0.11833789468723535},{"text":"逻辑","weight":0.14927615847585854},{"text":"演员","weight":0.12781648880540641},{"text":"狗血","weight":0.1259956134066834},{"text":"国产","weight":0.1879103963305132},{"text":"人物","weight":0.14790990258486694},{"text":"智商","weight":0.1458403887455327},{"text":"主演","weight":0.11351677707876565},{"text":"垃圾","weight":0.1840901896924636},{"text":"故事","weight":0.09444627950983556},{"text":"编剧","weight":0.057024050999200326},{"text":"剧中","weight":0.11252267286292357},{"text":"主角","weight":0.15700579254517533},{"text":"衣服","weight":0.06229256311776943},{"text":"负分","weight":0.005098941298620679},{"text":"弱智","weight":0.1526432494761612},{"text":"美女","weight":0.07360852901935225},{"text":"妖司","weight":0.03391301764995237},{"text":"时间","weight":0.024685581950898944},{"text":"爱情","weight":0.11250037848956498},{"text":"情节","weight":0.025479040142105096},{"text":"场景","weight":0.1399844058981071},{"text":"妹妹","weight":0.03688902707969476},{"text":"吸血鬼","weight":0.02378673521629043},{"text":"剧本","weight":0.0897277223463361},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        