
 var infor = {"content":[{"name":"name","value":"周末父母"},{"name":"导演","value":"王为"},{"name":"主演","value":"刘恺威 王鸥 张萌 朱泳腾 "},{"name":"类型","value":"剧情 家庭"},{"name":"制片国家/地区","value":"中国大陆"},{"name":"上映日期","value":"2017"},{"name":"summary","value":"于致远（刘恺威 饰）是一名杂志社的编辑，平日里工作繁忙，能够用在私人生活里的时间少得可怜。赵佳妮（王鸥 饰）身为时尚公司高管，生活的重心自然得放在公司里，否则现在好不容易挣来的地位分分钟会被人替代。这对职场达人小夫妻，无奈之下只能将儿子于震轩寄养在外婆家，只有双休日才能将儿子接回家，是名副其实的“周末父母”。\n在难得的亲子时光中，夫妻两自然是想着法子满足儿子各种各样的要求，带着他满世界玩，却忽略了最重要的教养问题。随着时间的推移，问题开始凸显，赵佳妮发现自己在儿子面前根本没有身为母亲的威信，儿子的个性也日益变得蛮横桀骜起来。"},{"name":"评分","value":5.2},{"name":"image","value":"https://img3.doubanio.com/view/movie_poster_cover/lpst/public/p2424685541.jpg"},{"name":"id","value":"26715635"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [1211,935,976,925,1179,1075,1302,1977,4084,4706,4794,11374,10218,8422,7416,8808,11130,9349,8487,8120,10106,12096,17950,76253,88205,78873,81111,92817,74896,77152,87527,83687,97166,115953,143235,132330,138132,154987,134715,116845,123972,11,66743,62922,52138]
            }, ]
        };

        var word_list = [{"text":"不错","weight":0.11319126918283348},{"text":"平衡","weight":0.5900223429596362},{"text":"拖沓","weight":0.9681049433404414},{"text":"厉害","weight":0.9606792039688885},{"text":"尴尬","weight":0.3229920244094519},{"text":"鲜活","weight":0.43581375050290494},{"text":"诙谐","weight":0.10403158689258721},{"text":"心疼","weight":0.3290564542470674},{"text":"致远","weight":0.24372259581253994},{"text":"糟糕","weight":0.22557399991455157},{"text":"生硬","weight":0.437672262456951},{"text":"矫情","weight":0.6556733272249791},{"text":"惊艳","weight":0.3167731637640742},{"text":"成熟","weight":0.6233705821907098},{"text":"深沉","weight":0.3994107630956331},{"text":"辛苦","weight":0.36725407624612005},{"text":"很好","weight":0.20759971454151305},{"text":"紧凑","weight":0.7984205298357624},{"text":"好好看","weight":0.7290081636554128},{"text":"一星","weight":0.06081340153124873},{"text":"最烂","weight":0.5889112220257748},{"text":"剧挺","weight":0.18592015295594297},{"text":"尊重","weight":0.03378378047899618},{"text":"均衡","weight":0.0803895214558808},{"text":"平淡","weight":0.0590709699426238},{"text":"年轻","weight":0.014461455330783728},{"text":"正火","weight":0.008503285273389142},{"text":"可耻","weight":0.10037729707819662},{"text":"浓烈","weight":0.032873807380546786},{"text":"悲哀","weight":0.026598360557330655},{"text":"愁苦","weight":0.009636040564673319},{"text":"不耐烦","weight":0.08368664330048635},{"text":"忙碌","weight":0.05106216816088174},{"text":"很棒","weight":0.12996246307842735},{"text":"惊喜","weight":0.0713225875675691},{"text":"演技","weight":0.7005654932262328},{"text":"剧情","weight":0.4892780110634945},{"text":"父母","weight":0.09613148590980726},{"text":"家庭","weight":0.34531289813962895},{"text":"剧本","weight":0.12156073990135388},{"text":"演员","weight":0.20859100169161773},{"text":"孩子","weight":0.31352407586606945},{"text":"电视剧","weight":0.2346028568812603},{"text":"现实","weight":0.258313831831853},{"text":"社会","weight":0.17230433836606476},{"text":"职场","weight":0.27239805209603424},{"text":"题材","weight":0.2506194264471382},{"text":"恶心","weight":0.17383215857007636},{"text":"男女","weight":0.15790208482074197},{"text":"主演","weight":0.1310219197514504},{"text":"台词","weight":0.14098449270235772},{"text":"编剧","weight":0.13443091486064013},{"text":"事业","weight":0.10541034082263169},{"text":"国产","weight":0.12373288965379839},{"text":"夜光","weight":0.11813320122898188},{"text":"女人","weight":0.12939947706290508},{"text":"小孩","weight":0.12402270884813321},{"text":"垃圾","weight":0.04936157602459733},{"text":"内容","weight":0.010783355159990859},{"text":"卖房","weight":0.16546254964587692},{"text":"剧中","weight":0.025320091067537635},{"text":"电视","weight":0.06404723997425199},{"text":"评分","weight":0.06383233043038858},{"text":"俗套","weight":0.05987584107286098},{"text":"佳妮","weight":0.14178036636665456},{"text":"情感","weight":0.07106065853070906},{"text":"关系","weight":0.021814459883023322},{"text":"老婆","weight":0.1284929729105818},{"text":"夫妻","weight":0.09171349203876583},{"text":"形象","weight":0.007992750338088396},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        