
 var infor = {"content":[{"name":"name","value":"大唐荣耀"},{"name":"导演","value":"刘国楠"},{"name":"主演","value":"景甜 任嘉伦 万茜 舒畅 "},{"name":"类型","value":"剧情 爱情 古装"},{"name":"制片国家/地区","value":"中国大陆"},{"name":"上映日期","value":"2017"},{"name":"summary","value":"沈珍珠出身名门，被选为广平王李豫之妃，生下长子唐德宗李适，后被李适追封为睿真皇后。她只是一介江南女子，内心善良，心存社稷，与人为善，在安史之乱之时只愿留在长安与百姓共同进退，被长安百姓所尊重。离散之中虽有大将默延啜对其追求，但仍坚守对李豫的爱。唐朝收复长安后，流散之人不得入宫，但李豫一心要接珍珠回来，珍珠以李豫太子前程为重，重回民间，后李豫多处寻找，珍珠始终不愿入宫，只愿成全李豫。她凭着达礼知书的才识，和德才兼备的优良品质，赢得李豫一生对她无法忘怀，而她又不事奢华，以一个和字协理后宫，知民间百姓疾苦。一代才女沈珍珠为唐朝中期的发展做出了一定的历史贡献。"},{"name":"评分","value":7},{"name":"image","value":"https://img3.doubanio.com/view/movie_poster_cover/lpst/public/p2423714770.jpg"},{"name":"id","value":"24827545"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [49475,49605,50031,51291,55468,57699,70534,58642,664850,1099431,1694686,1797410,1922644,2001376,2067253,2217525,2166345,2226637,2248892,2268683,2204315,2295546,2266852,2167163,2205075,2220708,2161657,2165722,2175859,2220813,2210352,2138123,2274303,2168182,2191774,2168233,2197738,2160987,2136187,2171926,2318178,2863810,1768929,1215376,878889]
            }, ]
        };

        var word_list = [{"text":"甜甜","weight":0.4542179286249049},{"text":"景甜","weight":1.6277007104514933},{"text":"舒畅","weight":0.9859087820345601},{"text":"特效","weight":0.5287042375112947},{"text":"不错","weight":0.4729981424733544},{"text":"拖沓","weight":0.08056619692530198},{"text":"意外","weight":0.1442653770807437},{"text":"温柔","weight":0.3208156256103479},{"text":"甜美","weight":0.25740232553512205},{"text":"无聊","weight":0.41160892797105236},{"text":"厉害","weight":0.0872890982828779},{"text":"精致","weight":0.1201023244411132},{"text":"年轻","weight":0.20183220641622085},{"text":"骄傲","weight":0.30012081592124346},{"text":"一星","weight":0.07647755248587983},{"text":"尴尬","weight":0.16692925535884717},{"text":"很美","weight":0.1916838442255562},{"text":"漂亮","weight":0.026705255068861195},{"text":"诚意","weight":0.02758149718021568},{"text":"聪明","weight":0.05257736936344119},{"text":"宽厚","weight":0.09440829591957896},{"text":"良心","weight":0.13594176604726865},{"text":"新颖","weight":0.06456770874034222},{"text":"有趣","weight":0.2712718532114032},{"text":"富贵","weight":0.020113486807029984},{"text":"贫穷","weight":0.17766941855634846},{"text":"快乐","weight":0.08516087065289352},{"text":"鲜艳","weight":0.1033541077147318},{"text":"落差","weight":0.19277102675640703},{"text":"很大","weight":0.2423530545229635},{"text":"善良","weight":0.24366843813710448},{"text":"最爱","weight":0.022478648241956375},{"text":"完整","weight":0.062287394165426724},{"text":"美艳","weight":0.19706610399146296},{"text":"很俗","weight":0.07988786913320808},{"text":"演技","weight":0.3148470604103697},{"text":"剧情","weight":0.7369948151908219},{"text":"男主","weight":0.6897361130701489},{"text":"演员","weight":0.18749466953535035},{"text":"女主","weight":0.24959968950812822},{"text":"套路","weight":0.13795413200828963},{"text":"电视剧","weight":0.31373415782477926},{"text":"背景","weight":0.145498626321702},{"text":"古装","weight":0.04044505319777602},{"text":"国产","weight":0.1226411227858485},{"text":"历史","weight":0.08545124492709606},{"text":"故事","weight":0.04466831400447851},{"text":"狗血","weight":0.020486805107945004},{"text":"台词","weight":0.18025539849614558},{"text":"智商","weight":0.06567634027338948},{"text":"用心","weight":0.020234714620162454},{"text":"水军","weight":0.10400901622376628},{"text":"编剧","weight":0.08088955572691925},{"text":"眼神","weight":0.08453214139086257},{"text":"角色","weight":0.01401672680739558},{"text":"老套","weight":0.034013566649483025},{"text":"人物","weight":0.11993201760271727},{"text":"颜值","weight":0.08104029346922163},{"text":"主角","weight":0.05225985535897994},{"text":"配角","weight":0.012194504029852407},{"text":"主演","weight":0.024548217325685004},{"text":"观众","weight":0.10611064077097868},{"text":"场景","weight":0.1254414208768852},{"text":"男女","weight":0.028742918717358144},{"text":"造型","weight":0.10262327755242277},{"text":"结局","weight":0.1338083930795846},{"text":"古装剧","weight":0.0628270783385965},{"text":"表情","weight":0.06570246879792481},{"text":"老戏骨","weight":0.1121395202213029},{"text":"珍珠","weight":0.09095482657665531},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        