
 var infor = {"content":[{"name":"name","value":"大秦帝国之崛起"},{"name":"导演","value":"丁黑"},{"name":"主演","value":"宁静 张博 邢佳栋 杨志刚 "},{"name":"类型","value":"剧情 历史"},{"name":"制片国家/地区","value":"中国大陆"},{"name":"上映日期","value":"2017"},{"name":"summary","value":"公元前305年，秦国历史上执政时间最长一位君王——秦昭襄王嬴稷继位。其后五十六年期间，秦王嬴稷在其母宣太后和其舅魏冉扶植下，从一个稚嫩年轻君王，成长为了一位坚毅沉着，威震天下真正王者；而秦国也由一个势力一般二流强国一跃崛成为傲视列国的超级大国。昭襄王在宣太后、纵横家范醀、“战神”白起协助下嬴稷采用“力交利交”“远交近攻”之国策，率领秦国子民先后灭义渠，修长城，重创齐国，攻陷楚国都城，迫魏韩两国俯首称臣并以极其惨烈战役。长平之战毁灭性地打击了当时剩下唯一大敌赵国，最后更一举消灭西周收纳九鼎！自此秦国雄傲中原无人能及，八十六年后嬴政统一中国之霸业也由此已经拉开序幕。"},{"name":"评分","value":8.6},{"name":"image","value":"https://img3.doubanio.com/view/movie_poster_cover/lpst/public/p2438256123.jpg"},{"name":"id","value":"5923466"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [4322,4290,4301,3959,14,5078,4947,3509,4698,4544,4936,4903,5075,5004,5474,5458,5746,5337,5460,8956,145317,246062,173079,175855,205675,177880,185770,198813,189413,193756,170118,195713,222271,221856,213593,192335,180713,147907,159860,192502,213273,227425,198539,192708,1611]
            }, ]
        };

        var word_list = [{"text":"良心","weight":0.847160465120986},{"text":"不错","weight":0.11004475140386663},{"text":"别扭","weight":0.5999672340291519},{"text":"严谨","weight":0.08133244609564418},{"text":"剧看","weight":0.16998436770102338},{"text":"生硬","weight":0.19103251900654586},{"text":"意外","weight":0.05698867362794534},{"text":"成功","weight":0.2927471646094609},{"text":"很棒","weight":0.40879017751090446},{"text":"粗糙","weight":0.13177263889331065},{"text":"尴尬","weight":0.23423991098558494},{"text":"紧凑","weight":0.16423245920390075},{"text":"豪迈","weight":0.12235794662432128},{"text":"爽朗","weight":0.07542061812197734},{"text":"平衡","weight":0.3106761181238698},{"text":"尊重","weight":0.13167148474123197},{"text":"古朴","weight":0.044165464131311276},{"text":"不易","weight":0.04298262900757527},{"text":"过硬","weight":0.1462199207432067},{"text":"完美","weight":0.11134480444035504},{"text":"厉害","weight":0.23463159531931882},{"text":"有限","weight":0.1491763048369229},{"text":"敏感","weight":0.12751755613923152},{"text":"厚重","weight":0.11732342698591178},{"text":"跋扈","weight":0.4116039646974852},{"text":"狂傲","weight":0.3487042121927832},{"text":"简陋","weight":0.24410625079925843},{"text":"宏大","weight":0.00025533888735781995},{"text":"恢宏","weight":0.3767617290571929},{"text":"沉闷","weight":0.2854265645044851},{"text":"泼辣","weight":0.05843100914281683},{"text":"犀利","weight":0.36381356580915275},{"text":"杂碎","weight":0.16219893794486165},{"text":"壮阔","weight":0.11359125317114702},{"text":"厚实","weight":0.022774138180085918},{"text":"历史","weight":0.04014117393238269},{"text":"台词","weight":0.3221316664490529},{"text":"演员","weight":0.40219309252293384},{"text":"剧情","weight":0.29755133032011516},{"text":"电视剧","weight":0.4486363654467173},{"text":"演技","weight":0.32172538139612067},{"text":"人物","weight":0.22213246187483232},{"text":"历史剧","weight":0.2351555600290796},{"text":"国产","weight":0.10884291150677217},{"text":"编剧","weight":0.06923967175981606},{"text":"剧本","weight":0.13784920018069644},{"text":"故事","weight":0.10636496619796072},{"text":"鲜肉","weight":0.07215191667408476},{"text":"古装剧","weight":0.08779815951113265},{"text":"配音","weight":0.09839942829930166},{"text":"偶像剧","weight":0.13612522835414528},{"text":"时代","weight":0.031853995346866566},{"text":"场景","weight":0.039570559607496794},{"text":"地方","weight":0.015803136133712488},{"text":"评分","weight":0.08508366244895373},{"text":"帝国","weight":0.01330400663281712},{"text":"收音","weight":0.015414022055465146},{"text":"现场","weight":0.08591348047737969},{"text":"剪辑","weight":0.02165252918664706},{"text":"角色","weight":0.10687521341170897},{"text":"观众","weight":0.017959057953354507},{"text":"战国","weight":0.0687438192221308},{"text":"智商","weight":0.05047975072568242},{"text":"情节","weight":0.00011479372407408563},{"text":"用心","weight":0.06350002178604387},{"text":"垃圾","weight":0.04651418114899118},{"text":"八子","weight":0.08887676353812211},{"text":"爱情","weight":0.03217741533811321},{"text":"战争","weight":0.0199692521345309},{"text":"水军","weight":0.08508258912091918},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        