
 var infor = {"content":[{"name":"name","value":"射雕英雄传"},{"name":"导演","value":"蒋家骏"},{"name":"主演","value":"杨旭文 李一桐 陈星旭 孟子义 "},{"name":"类型","value":"剧情 武侠 古装"},{"name":"制片国家/地区","value":"中国大陆"},{"name":"上映日期","value":"2017"},{"name":"summary","value":"南宋时期，惨遭灭门横祸的郭靖、杨康分别在江南七怪与全真教道士丘处机的教养下成人。18年后，郭靖奉师命南下。杨康却贪恋富贵，认贼作父。郭靖与黄蓉一见如故，彼此倾心，但因华筝之婚约在先，以及江南七怪的反对等多种因素，两人情感可谓一波三折。五位师父被害于桃花岛，郭靖愤而离开黄蓉。这一对两情相悦的青年，经历了坎坷磨难，才修成正果。恶言恶行的杨康，也难逃惨死在嘉兴铁枪庙中的命运。郭靖随黄蓉故国万里行，遍识天下武林高人，武功日见提升，终于得以报杀父深仇，消师门积怨，夺《武穆遗书》，率大军西征，承亡母之教，上华山论剑，救襄阳国难。这位原本纯朴憨厚、木讷愚钝的射雕英雄，变成一个为国为民、悲天悯人的侠之大者。"},{"name":"评分","value":8.1},{"name":"image","value":"https://img1.doubanio.com/view/movie_poster_cover/lpst/public/p2411844029.jpg"},{"name":"id","value":"26663086"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [205154,184980,176205,273833,359310,330016,267865,172754,190879,182609,254130,292488,256024,224315,205555,187977,185331,262544,292401,273936,229067,190903,176553,169999,201496,227917,205507,175501,152907,160338,147028,157477,195612,184323,146909,122703,126765,112685,132530,159742,151731,116959,114583,127601,124542]
            }, ]
        };

        var word_list = [{"text":"特效","weight":0.5505867458058397},{"text":"意外","weight":1.4500407901443904},{"text":"尴尬","weight":0.5176097690956251},{"text":"聪明","weight":0.21144230461616426},{"text":"漂亮","weight":0.32230479433832304},{"text":"良心","weight":0.7700808653317961},{"text":"充满","weight":0.07090491593433725},{"text":"善良","weight":0.09891449982663297},{"text":"忠实","weight":0.5796432826830983},{"text":"忠诚","weight":0.12338476771757913},{"text":"朴实","weight":0.20029047722848597},{"text":"尊重","weight":0.0860609232538009},{"text":"幸好","weight":0.08610786136174889},{"text":"频繁","weight":0.032089523307666394},{"text":"模糊","weight":0.3043839909497213},{"text":"灵动","weight":0.38455007433591326},{"text":"娇俏","weight":0.14627886947421767},{"text":"娇蛮","weight":0.4453482189520475},{"text":"青涩","weight":0.40791693271527346},{"text":"正好","weight":0.2847636333670827},{"text":"妖艳","weight":0.09640554312613715},{"text":"很好","weight":0.10003325950678159},{"text":"成功","weight":0.3699063199089048},{"text":"完整","weight":0.32827498344364736},{"text":"恶劣","weight":0.15986177200148674},{"text":"朦胧","weight":0.3021033598431355},{"text":"精良","weight":0.007937881401350983},{"text":"平庸","weight":0.6072007249541025},{"text":"娇小","weight":0.6321207580782151},{"text":"平淡","weight":0.2399074273865476},{"text":"简明","weight":0.029623560810552396},{"text":"精妙","weight":0.65514464442438},{"text":"不错","weight":0.1530712966835034},{"text":"俏皮","weight":0.3039103033712162},{"text":"不喜","weight":0.2638646820267426},{"text":"演员","weight":0.3229044888308938},{"text":"黄蓉","weight":0.09745575500690659},{"text":"演技","weight":0.24587093923091874},{"text":"射雕","weight":0.2994713687763101},{"text":"剧情","weight":0.23382272067008752},{"text":"情节","weight":0.07723923982149697},{"text":"主角","weight":0.3105338178927126},{"text":"新人","weight":0.10689146504600264},{"text":"电视剧","weight":0.07788837767680067},{"text":"情怀","weight":0.2603282875602909},{"text":"用心","weight":0.14939871844449934},{"text":"版本","weight":0.162193586340104},{"text":"经典","weight":0.00801486021384961},{"text":"人物","weight":0.20445609222759695},{"text":"台词","weight":0.09645369871145469},{"text":"颜值","weight":0.003554261533290796},{"text":"动作","weight":0.011197676260919859},{"text":"细节","weight":0.12817667680047862},{"text":"水军","weight":0.07144648929324937},{"text":"出场","weight":0.03930239283423708},{"text":"眼睛","weight":0.2016669361357189},{"text":"观众","weight":0.01227380859242981},{"text":"质感","weight":0.09956526076760037},{"text":"国产","weight":0.17753992395161097},{"text":"配角","weight":0.09943571559153944},{"text":"慢镜头","weight":0.08961234376939478},{"text":"节奏","weight":0.0705884286862922},{"text":"画面","weight":0.04304610889844903},{"text":"剧组","weight":0.04578054300221298},{"text":"一星","weight":0.0857456931793623},{"text":"场景","weight":0.10619195172833173},{"text":"流量","weight":0.12478090280811646},{"text":"编剧","weight":0.12389635028087706},{"text":"音乐","weight":0.0004449354317491359},{"text":"选角","weight":0.1298432252469487},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        