
 var infor = {"content":[{"name":"name","value":"热血长安"},{"name":"导演","value":"王骏晔"},{"name":"主演","value":"徐海乔 鞠婧祎 程小蒙 刘冠麟 "},{"name":"类型","value":"剧情 悬疑 古装"},{"name":"制片国家/地区","value":"中国大陆"},{"name":"上映日期","value":"2017"},{"name":"summary","value":"公元626年，大唐都城长安内突然异象丛生，疑案四起，人心惶惶。大理寺成立调查组，调查这些看似怪力乱神的事件，成员囊括通晓伽罗术的萨摩多罗，超强分析能力的卿李郅，熟练的制造火药并操作连环火枪的黄三炮，精通各类武器的公孙四娘，“人版移动书库”上官紫苏，医学鬼才仵作谭双叶。在接二连三的诡谲案件中，调查组原事实真相，破除坊间迷信。如“地狱古井”村民们正在逃离被诅咒的东水村；“雷公判案”老爷和书生皆被雷公劈死。随着调查逐步深入中，众人渐渐发现，黑伽罗妄想用卑劣的手段企图颠覆和谐的大唐。最终邪不胜正，调查组彻底击碎了黑伽罗的邪恶阴谋。少年们除了那份不变的热血豪情，更多了一份坚定的守护家与国的责任之心。"},{"name":"评分","value":6},{"name":"image","value":"https://img3.doubanio.com/view/movie_poster_cover/lpst/public/p2426476953.jpg"},{"name":"id","value":"26776531"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [1268,1087,1073,1379,1283,1232,1227,965,1163,1176,1143,1209,1248,2974,1561,1527,1648,1590,1760,2447,2947,2472,2549,2712,4300,4927,40134,43584,38851,39721,34057,24178,23643,36041,32951,25584,27402,27873,19992,18001,28558,26359,27183,29418,36446]
            }, ]
        };

        var word_list = [{"text":"特效","weight":0.5428157573128319},{"text":"拖沓","weight":0.06543106290204685},{"text":"良心","weight":0.8864589474914818},{"text":"不错","weight":0.5585901386589436},{"text":"明快","weight":0.8086754627347778},{"text":"惊艳","weight":0.2478447417998455},{"text":"急躁","weight":0.08892459025504915},{"text":"恐怖","weight":0.6664875858421206},{"text":"尴尬","weight":0.21507250448012896},{"text":"轻松","weight":0.16510218777361635},{"text":"紧凑","weight":0.06900597591856737},{"text":"幽默","weight":0.4656095201298829},{"text":"景致","weight":0.09909506952175984},{"text":"柔美","weight":0.10915508911515688},{"text":"温婉","weight":0.33778794059378187},{"text":"缜密","weight":0.19495833314560718},{"text":"好好看","weight":0.12579119801860764},{"text":"无聊","weight":0.44068153673073385},{"text":"厉害","weight":0.07699372728451631},{"text":"简单","weight":0.10702409919799659},{"text":"郁闷","weight":0.4168862769424704},{"text":"有喜","weight":0.1472172457513327},{"text":"孤独","weight":0.27608105737929917},{"text":"眼拙","weight":0.304141523955233},{"text":"准确","weight":0.12258244613822973},{"text":"严谨","weight":0.16901877111147914},{"text":"心疼","weight":0.2185480397472297},{"text":"稳重","weight":0.05744283861378608},{"text":"聪明","weight":0.15665096579794094},{"text":"晦涩","weight":0.25756410418258074},{"text":"难懂","weight":0.16492555249798632},{"text":"温柔","weight":0.4249534691196093},{"text":"灵动","weight":0.24435301021187894},{"text":"优酷","weight":0.08198791069992517},{"text":"精致","weight":0.2883990126911139},{"text":"剧情","weight":0.5128916786215709},{"text":"演技","weight":0.5251140552829376},{"text":"演员","weight":0.3358238064351763},{"text":"国产","weight":0.053829663868050555},{"text":"故事","weight":0.024906627134016063},{"text":"编剧","weight":0.027573948079137364},{"text":"背景","weight":0.16858906819109087},{"text":"电视剧","weight":0.07183713423527179},{"text":"节奏","weight":0.1641713295056446},{"text":"场景","weight":0.23559157022926025},{"text":"探案","weight":0.13591707537310693},{"text":"男主","weight":0.21892885266654283},{"text":"颜值","weight":0.04393343259509757},{"text":"案件","weight":0.15548838256065808},{"text":"案子","weight":0.10324666396857644},{"text":"主演","weight":0.05188310573237494},{"text":"网剧","weight":0.05630278875127269},{"text":"用心","weight":0.1383167130773811},{"text":"镜头","weight":0.12287457090233626},{"text":"细节","weight":0.039926003648255895},{"text":"逻辑","weight":0.05034621481372158},{"text":"角色","weight":0.05939946111280498},{"text":"剧本","weight":0.05431331384111872},{"text":"技术","weight":0.03938681108454257},{"text":"节奏快","weight":0.029243500856641073},{"text":"人物","weight":0.0989873211973306},{"text":"主角","weight":0.04354163080968613},{"text":"整体","weight":0.12069608725440764},{"text":"精彩","weight":0.015145342704694458},{"text":"女主","weight":0.10439959250441316},{"text":"伏笔","weight":0.1084279517084373},{"text":"剧组","weight":0.09377025261125473},{"text":"总体","weight":0.13942372653395219},{"text":"内景","weight":0.09900195360780964},{"text":"台词","weight":0.10226454895048818},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        