var ia = [
       

// 历史收藏
[
    ['排行', '小说名', '作者', '收藏数', '评论数', '月票'], 
    ['1', '圣墟', '辰东', '17661000.0', '14324100.0', '419188.0'], 
    ['2', '斗战狂潮', '骷髅精灵', '16389300.0', '11113500.0', '598580.0'], 
    ['3', '一念永恒', '耳根', '15832900.0', '13538100.0', '261796.0'], 
    ['4', '天影', '萧鼎', '13066600.0', '11186700.0', '269640.0'], 
    ['5', '超凡传', '萧潜', '10916199.0', '10449400.0', '263368.0'], 
    ['6', '罪恶之城', '烟雨江南', '10853803.0', '175529775.0', '1946417.0'], 
    ['7', '不朽凡人', '鹅是老五', '8726200.0', '6762000.0', '121128.0'], 
    ['8', '无疆', '小刀锋利', '8600800.0', '4296700.0', '421152.0'], 
    ['9', '斗罗大陆III龙王传说', '唐家三少', '7666100.0', '7143000.0', '83632.0'], 
    ['10', '万界天尊', '血红', '7655500.0', '7825700.0', '338336.0']
],

// 本月点击
[
    ['排行', '小说名', '作者', '收藏数', '评论数', '月票'], 
    ['1', '修罗武神', '善良的蜜蜂', '2232266.0', '4249535090.0', '95134560.0'], 
    ['2', '超级兵王', '步千帆', '373058.0', '410130919.0', '28444445.0'], 
    ['3', '混沌剑神', '心星逍遥', '454593.0', '332160366.0', '23803635.0'], 
    ['4', '九星霸体诀', '平凡魔术师', '143264.0', '233311721.0', '20575313.0'], 
    ['5', '武逆', '只是小虾米', '352815.0', '458037377.0', '20327120.0'], 
    ['6', '龙符', '梦入神机', '491727.0', '271964164.0', '18545585.0'], 
    ['7', '人皇纪', '皇甫奇', '309356.0', '958932400.0', '16116206.0'], 
    ['8', '元尊', '天蚕土豆', '40353.0', '52174227.0', '15199838.0'], 
    ['9', '龙血战神', '风青阳', '1037101.0', '556845001.0', '14768322.0'], 
    ['10', '超品战兵', '梁不凡', '259688.0', '71617699.0', '13716144.0']
],

// 历史点击
[
    ['排行', '小说名', '作者', '收藏数', '评论数', '月票'], 
    ['1', '11处特工皇妃', '潇湘冬儿', '99000.0', '5500000000.0', '595704.0'], 
    ['2', '修罗武神', '善良的蜜蜂', '2232266.0', '4249535090.0', '95134560.0'], 
    ['3', '傲风', '风行烈', '74000.0', '2300000000.0', '746064.0'], 
    ['4', '万古仙穹', '观棋', '578093.0', '1145384348.0', '4767123.0'], 
    ['5', '凤临之妖王滚下榻', '战西野', '50000.0', '1100000000.0', '112948.0'], 
    ['6', '斩龙', '失落叶', '3632489.0', '1078884456.0', '6031904.0'], 
    ['7', '人皇纪', '皇甫奇', '309356.0', '958932400.0', '16116206.0'], 
    ['8', '杀手房东俏房客', '老施', '998871.0', '718911062.0', '4827554.0'], 
    ['9', '龙血战神', '风青阳', '1037101.0', '556845001.0', '14768322.0'], 
    ['10', '网游之天下无双', '失落叶', '3223499.0', '518541036.0', '5159318.0']
],

// 热门小说作者
[
    ['排行', '小说名', '作者', '收藏数', '评论数', '月票'], 
    ['1', '11处特工皇妃', '潇湘冬儿', '99000.0', '5500000000.0', '595704.0'], 
    ['2', '修罗武神', '善良的蜜蜂', '2232266.0', '4249535090.0', '95134560.0'], 
    ['3', '傲风', '风行烈', '74000.0', '2300000000.0', '746064.0'], 
    ['4', '万古仙穹', '观棋', '578093.0', '1145384348.0', '4767123.0'], 
    ['5', '凤临之妖王滚下榻', '战西野', '50000.0', '1100000000.0', '112948.0'], 
    ['6', '斩龙', '失落叶', '3632489.0', '1078884456.0', '6031904.0'], 
    ['7', '人皇纪', '皇甫奇', '309356.0', '958932400.0', '16116206.0'], 
    ['8', '杀手房东俏房客', '老施', '998871.0', '718911062.0', '4827554.0'], 
    ['9', '龙血战神', '风青阳', '1037101.0', '556845001.0', '14768322.0'], 
    ['10', '网游之天下无双', '失落叶', '3223499.0', '518541036.0', '5159318.0']
]


]

var title = $('#sec-title');
var chart = $('#chart-data');
// 替换标题和时间
title.html('<span>IP</span>排行榜TOP10').parent().append('<p> 更新时间: 2018/01/02 </p>');
// 替换tab
var tab = '<div class="charts-kinds">\
            <a href="javascript:;"class="j-tab selected">历史收藏</a>\
            <a href="javascript:;"class="j-tab">本月点击</a>\
            <a href="javascript:;"class="j-tab">历史点击</a>\
            <a href="javascript:;"class="j-tab">热门小说作者</a>\
           </div>'

chart.html(tab);

Handlebars.registerHelper('selected', function(idx, opt){
    if(idx === 0) return 'selected';
});

Handlebars.registerHelper('rank', function(idx, opt){
    if(idx === '排行') return idx;
    if(idx <= 3) return '<i class="rank-T3">'+idx+'</i>';
    return '<i class="rank-other">'+idx+'</i>';
});

var lastIdx;
Handlebars.registerHelper('index', function(idx, opt){
    if( !parseInt(idx) ) {
        lastIdx = 100000;
        return idx;
    }

    lastIdx = lastIdx - Math.floor( Math.random()*lastIdx/2 ) ;
    return lastIdx;
});

Handlebars.registerHelper('status', function(val, opt){
    if(val === 0) return 0;

    if(!val) return;
    if(!parseInt(val)) return val;

    if(val > 0) return '<span class="up"> + '+ Math.floor(Math.random()*1000) +'</span>';
    return '<span class="down"> - '+  Math.floor(Math.random()*1000)  +'</span>'
});

var olstr ='<style>.t-2{width:80px}.t-3{width:300px}.chart-list:nth-of-type(4).t-5{width:100px}.t-6{width:120px}@media(max-width:767px){.chart-list.t-4{display:inline-block}}</style>\
{{#each this}}<ol class="chart-list j-for {{#selected @index}}{{/selected}}">\
    {{#with this}}{{#each this}}<li>\
        <span class="t-1">{{#rank this.[0]}}{{/rank}}</span>\
        <span class="t-3"><a href="search.html?ip/{{ this.[1] }}"title="点击查看：{{ this.[1] }}"target="_blank">{{this.[1]}}</a></span>\
        <span class="t-4">{{this.[2]}}</span>\
        <span class="t-5 text-center">{{this.[3]}}</span>\
        <span class="t-5 text-center">{{this.[4]}}</span>\
        <span class="t-5 text-center">{{this.[5]}}</span>\
    </li>{{/each}}\
{{/with}}</ol>{{/each}}';



var template = Handlebars.compile(olstr);
var allstr = template(ia);
chart.append(allstr);
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

$('.j-tab').hover(function() {
    if ($(this).hasClass('selected')) {
        return false;
    }
    $(this).siblings().removeClass('selected').end().addClass('selected');
    $('.j-for').removeClass('selected').eq($(this).index()).addClass('selected');
});
