var ia = [
       

// 历史收藏
[
    ['排行', '小说名', '作者', '收藏数', '评论数', '月票'], 
    ['1', '择天记', '猫腻', '121497945.0', '26331374.0', '31448.0'], 
    ['2', '斗战狂潮', '骷髅精灵', '21171500.0', '21021300.0', '596800.0'], 
    ['3', '一念永恒', '耳根', '16958200.0', '19547700.0', '320800.0'], 
    ['4', '青帝', '荆柯守', '13872508.0', '8798059.0', '8880.0'], 
    ['5', '飞剑问道', '我吃西红柿', '13496400.0', '18973400.0', '2199600.0'], 
    ['6', '罪恶之城', '烟雨江南', '10884268.0', '180327675.0', '360873.0'], 
    ['7', '龙皇武神', '步征', '9614400.0', '8871000.0', '132400.0'], 
    ['8', '联盟之谁与争锋', '乱', '9059267.0', '15728323.0', '1232.0'], 
    ['9', '斗罗大陆III龙王传说', '唐家三少', '8426700.0', '11759700.0', '990400.0'], 
    ['10', '大官人', '三戒大师', '8953496.0', '6185872.0', '6000.0']

],

// 本月点击
[
    ['排行', '小说名', '作者', '收藏数', '评论数', '月票'], 
    ['1', '修罗武神', '善良的蜜蜂', '2269517.0', '4552586033.0', '21862828.0'], 
    ['2', '权力巅峰', '梦入洪荒', '1085936.0', '262499011.0', '9343393.0'], 
    ['3', '龙血战神', '风青阳', '1043390.0', '623958168.0', '5874698.0'], 
    ['4', '点道为止', '梦入神机', '158858.0', '49310791.0', '5548469.0'], 
    ['5', '混沌剑神', '心星逍遥', '462937.0', '406656280.0', '4902894.0'], 
    ['6', '超级兵王', '步千帆', '386585.0', '489705351.0', '4726166.0'], 
    ['7', '终极教官', '梁不凡', '106310.0', '317941098.0', '4637984.0'],
    ['8', '元尊', '天蚕土豆', '52595.0', '114613350.0', '4326802.0'], 
    ['9', '武道至尊', '暗夜幽殇', '197644.0', '300884268.0', '4309236.0'], 
    ['10', '九星霸体诀', '平凡魔术师', '159551.0', '291721232.0', '4200435.0'], 

],

// 历史点击
[
    ['排行', '小说名', '作者', '收藏数', '评论数', '月票'], 
    ['1', '修罗武神', '善良的蜜蜂', '2269517.0', '4552586033.0', '21862828.0'], 
    ['2', '万古仙穹', '观棋', '578309.0', '1162766910.0', '2085224.0'], 
    ['3', '斩龙', '失落叶', '3638129.0', '1098548241.0', '1412766.0'], 
    ['4', '人皇纪', '皇甫奇', '367095.0', '1006543571.0', '4100945.0'], 
    ['5', '杀手房东俏房客', '老施', '1000734.0', '730370451.0', '837478.0'], 
    ['6', '龙血战神', '风青阳', '1043390.0', '623958168.0', '5874698.0'], 
    ['7', '网游之天下无双', '失落叶', '3223678.0', '535383720.0', '1247417.0'], 
    ['8', '武逆', '只是小虾米', '356043.0', '507743423.0', '3152224.0'], 
    ['9', '傲世丹神', '寂小贼', '232198.0', '499166043.0', '1546413.0'], 
    ['10', '超级兵王', '步千帆', '386585.0', '489705351.0', '4726166.0']
    
],

// 热门小说作者
[
    ['排行', '小说名', '作者', '收藏数', '评论数', '月票'], 
    ['1', '择天记', '猫腻', '121497945.0', '26331374.0', '31448.0'], 
    ['2', '斗战狂潮', '骷髅精灵', '21171500.0', '21021300.0', '596800.0'], 
    ['3', '罪恶之城', '烟雨江南', '10884268.0', '180327675.0', '360873.0'], 
    ['4', '一念永恒', '耳根', '16958200.0', '19547700.0', '320800.0'], 
    ['5', '青帝', '荆柯守', '13872508.0', '8798059.0', '8880.0'], 
    ['6', '飞剑问道', '我吃西红柿', '13496400.0', '18973400.0', '2199600.0'], 
    ['7', '龙皇武神', '步征', '9614400.0', '8871000.0', '132400.0'], 
    ['8', '联盟之谁与争锋', '乱', '9059267.0', '15728323.0', '1232.0'], 
    ['9', '斗罗大陆III龙王传说', '唐家三少', '8426700.0', '11759700.0', '990400.0'], 
    ['10', '大官人', '三戒大师', '8953496.0', '6185872.0', '6000.0']
]

]

var title = $('#sec-title');
var chart = $('#chart-data');
// 替换标题和时间
title.html('<span>IP</span>排行榜TOP10').parent().append('<p> 更新时间: 2018/01/02 </p>');
// 替换tab
var tab = '<div class="charts-kinds">\
            <a href="javascript:;"class="j-tab selected">历史收藏</a>\
            <a href="javascript:;"class="j-tab">本月点击</a>\
            <a href="javascript:;"class="j-tab">历史点击</a>\
            <a href="javascript:;"class="j-tab">热门小说作者</a>\
           </div>'

chart.html(tab);

Handlebars.registerHelper('selected', function(idx, opt){
    if(idx === 0) return 'selected';
});

Handlebars.registerHelper('rank', function(idx, opt){
    if(idx === '排行') return idx;
    if(idx <= 3) return '<i class="rank-T3">'+idx+'</i>';
    return '<i class="rank-other">'+idx+'</i>';
});

var lastIdx;
Handlebars.registerHelper('index', function(idx, opt){
    if( !parseInt(idx) ) {
        lastIdx = 100000;
        return idx;
    }

    lastIdx = lastIdx - Math.floor( Math.random()*lastIdx/2 ) ;
    return lastIdx;
});

Handlebars.registerHelper('status', function(val, opt){
    if(val === 0) return 0;

    if(!val) return;
    if(!parseInt(val)) return val;

    if(val > 0) return '<span class="up"> + '+ Math.floor(Math.random()*1000) +'</span>';
    return '<span class="down"> - '+  Math.floor(Math.random()*1000)  +'</span>'
});

var olstr ='<style>.t-2{width:80px}.t-3{width:300px}.chart-list:nth-of-type(4).t-5{width:100px}.t-6{width:120px}@media(max-width:767px){.chart-list.t-4{display:inline-block}}</style>\
{{#each this}}<ol class="chart-list j-for {{#selected @index}}{{/selected}}">\
    {{#with this}}{{#each this}}<li>\
        <span class="t-1">{{#rank this.[0]}}{{/rank}}</span>\
        <span class="t-3"><a href="search.html?ip/{{ this.[1] }}"title="点击查看：{{ this.[1] }}"target="_blank">{{this.[1]}}</a></span>\
        <span class="t-4">{{this.[2]}}</span>\
        <span class="t-5 text-center">{{this.[3]}}</span>\
        <span class="t-5 text-center">{{this.[4]}}</span>\
        <span class="t-5 text-center">{{this.[5]}}</span>\
    </li>{{/each}}\
{{/with}}</ol>{{/each}}';



var template = Handlebars.compile(olstr);
var allstr = template(ia);
chart.append(allstr);
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

$('.j-tab').hover(function() {
    if ($(this).hasClass('selected')) {
        return false;
    }
    $(this).siblings().removeClass('selected').end().addClass('selected');
    $('.j-for').removeClass('selected').eq($(this).index()).addClass('selected');
});
