
 var ia = [[["排行","片名","主演","导演","类型","影响力指数","同比上期"],[1,"速度与激情8","范·迪塞尔,道恩·强森,查理兹·塞隆,杰森·斯坦森,米歇尔·罗德里格兹,娜塔莉·伊曼纽尔,埃尔莎·帕塔奇,海伦·米伦,泰瑞斯·吉布森,库尔特·拉塞尔,乔丹娜·布鲁斯特,卢卡斯·布莱克,卢达克里斯,克里斯托弗·海维尤,斯科特·伊斯特伍德,","F·加里·格雷,","动作,犯罪,",2886,"↓"],[2,"金刚：骷髅岛","","","",3921,"↑"],[3,"攻壳机动队","田中敦子,大塚明夫,山寺宏一,大木民夫,家弓家正,玄田哲章,山内雅人,小川真司,","押井守,","动作,科幻,动画,",9603,"↓"],[4,"春娇救志明","杨千嬅,余文乐,蒋梦婕,秦沛,郑伊健,许玮甯,谢依霖,盛朗熙,林辰唏,纳豆,","彭浩翔,","剧情,喜剧,爱情,",8529,"↓"],[5,"拆弹专家","刘德华,姜武,宋佳,","邱礼涛,","动作,悬疑,犯罪,",3545,"↓"],[6,"大话西游之大圣娶亲","周星驰,吴孟达,朱茵,蔡少芬,蓝洁瑛,莫文蔚,罗家英,刘镇伟,陆树铭,李健仁,","刘镇伟,","喜剧,动作,爱情,奇幻,冒险,",4116,"↓"],[7,"记忆大师","黄渤,徐静蕾,段奕宏,杨子姗,许玮甯,","陈正道,","悬疑,犯罪,",6570,"↓"],[8,"嫌疑人X的献身","福山雅治,柴崎幸,堤真一,松雪泰子,北村一辉,金泽美穗,","西谷弘,","剧情,悬疑,犯罪,",5365,"↓"],[9,"喜欢你","","","",5261,"↓"],[10,"非凡任务","","","",1970,"↓"]],[["排行","片名","主演","导演","类型","评分"],[1,"摔跤吧！爸爸","","","",""],[2,"大话西游之大圣娶亲","周星驰,吴孟达,朱茵,蔡少芬,蓝洁瑛,莫文蔚,罗家英,刘镇伟,陆树铭,李健仁,","刘镇伟,","喜剧,动作,爱情,奇幻,冒险,",9.1],[3,"速度与激情8","范·迪塞尔,道恩·强森,查理兹·塞隆,杰森·斯坦森,米歇尔·罗德里格兹,娜塔莉·伊曼纽尔,埃尔莎·帕塔奇,海伦·米伦,泰瑞斯·吉布森,库尔特·拉塞尔,乔丹娜·布鲁斯特,卢卡斯·布莱克,卢达克里斯,克里斯托弗·海维尤,斯科特·伊斯特伍德,","F·加里·格雷,","动作,犯罪,",null],[4,"春娇救志明","杨千嬅,余文乐,蒋梦婕,秦沛,郑伊健,许玮甯,谢依霖,盛朗熙,林辰唏,纳豆,","彭浩翔,","剧情,喜剧,爱情,",null],[5,"喜欢你","","","",""],[6,"记忆大师","黄渤,徐静蕾,段奕宏,杨子姗,许玮甯,","陈正道,","悬疑,犯罪,",null],[7,"拆弹专家","刘德华,姜武,宋佳,","邱礼涛,","动作,悬疑,犯罪,",null],[8,"蓝精灵：寻找神秘村","乔·曼根尼罗,朱莉娅·罗伯茨,曼迪·帕廷金,米歇尔·罗德里格兹,艾丽·坎伯尔,黛米·洛瓦托,丹尼·朴迪,阿芮尔·温特,雷恩·威尔森,杰克·麦克布瑞尔,","凯利·阿斯博瑞,","动画,家庭,",null],[9,"非凡任务","","","",""],[10,"嫌疑人X的献身","福山雅治,柴崎幸,堤真一,松雪泰子,北村一辉,金泽美穗,","西谷弘,","剧情,悬疑,犯罪,",8.3]],[["排行","片名","主演","导演","类型","评论数","同比上期"],[1,"喜欢你","","","",4493,"↓"],[2,"记忆大师","黄渤,徐静蕾,段奕宏,杨子姗,许玮甯,","陈正道,","悬疑,犯罪,",163,"↓"],[3,"傲娇与偏见","迪丽热巴,张云龙,高伟光,马薇薇,范湉湉,","李海蜀,","喜剧,爱情,",8016,"↑"],[4,"速度与激情8","范·迪塞尔,道恩·强森,查理兹·塞隆,杰森·斯坦森,米歇尔·罗德里格兹,娜塔莉·伊曼纽尔,埃尔莎·帕塔奇,海伦·米伦,泰瑞斯·吉布森,库尔特·拉塞尔,乔丹娜·布鲁斯特,卢卡斯·布莱克,卢达克里斯,克里斯托弗·海维尤,斯科特·伊斯特伍德,","F·加里·格雷,","动作,犯罪,",9725,"↓"],[5,"嫌疑人X的献身","福山雅治,柴崎幸,堤真一,松雪泰子,北村一辉,金泽美穗,","西谷弘,","剧情,悬疑,犯罪,",2578,"↓"],[6,"金刚：骷髅岛","","","",9049,"↓"],[7,"春娇救志明","杨千嬅,余文乐,蒋梦婕,秦沛,郑伊健,许玮甯,谢依霖,盛朗熙,林辰唏,纳豆,","彭浩翔,","剧情,喜剧,爱情,",6041,"↓"],[8,"攻壳机动队","田中敦子,大塚明夫,山寺宏一,大木民夫,家弓家正,玄田哲章,山内雅人,小川真司,","押井守,","动作,科幻,动画,",1775,"↑"],[9,"拆弹专家","刘德华,姜武,宋佳,","邱礼涛,","动作,悬疑,犯罪,",889,"↓"],[10,"蓝精灵：寻找神秘村","乔·曼根尼罗,朱莉娅·罗伯茨,曼迪·帕廷金,米歇尔·罗德里格兹,艾丽·坎伯尔,黛米·洛瓦托,丹尼·朴迪,阿芮尔·温特,雷恩·威尔森,杰克·麦克布瑞尔,","凯利·阿斯博瑞,","动画,家庭,",3045,"↓"]],[["排行","片名","主演","导演","类型","评分","票房"],[1,"速度与激情8","范·迪塞尔,道恩·强森,查理兹·塞隆,杰森·斯坦森,米歇尔·罗德里格兹,娜塔莉·伊曼纽尔,埃尔莎·帕塔奇,海伦·米伦,泰瑞斯·吉布森,库尔特·拉塞尔,乔丹娜·布鲁斯特,卢卡斯·布莱克,卢达克里斯,克里斯托弗·海维尤,斯科特·伊斯特伍德,","F·加里·格雷,","动作,犯罪,",null],[2,"金刚：骷髅岛","","","",""],[3,"嫌疑人X的献身","福山雅治,柴崎幸,堤真一,松雪泰子,北村一辉,金泽美穗,","西谷弘,","剧情,悬疑,犯罪,",8.3],[4,"拆弹专家","刘德华,姜武,宋佳,","邱礼涛,","动作,悬疑,犯罪,",null],[5,"攻壳机动队","田中敦子,大塚明夫,山寺宏一,大木民夫,家弓家正,玄田哲章,山内雅人,小川真司,","押井守,","动作,科幻,动画,",8.9],[6,"记忆大师","黄渤,徐静蕾,段奕宏,杨子姗,许玮甯,","陈正道,","悬疑,犯罪,",null],[7,"大话西游之大圣娶亲","周星驰,吴孟达,朱茵,蔡少芬,蓝洁瑛,莫文蔚,罗家英,刘镇伟,陆树铭,李健仁,","刘镇伟,","喜剧,动作,爱情,奇幻,冒险,",9.1],[8,"非凡任务","","","",""],[9,"蓝精灵：寻找神秘村","乔·曼根尼罗,朱莉娅·罗伯茨,曼迪·帕廷金,米歇尔·罗德里格兹,艾丽·坎伯尔,黛米·洛瓦托,丹尼·朴迪,阿芮尔·温特,雷恩·威尔森,杰克·麦克布瑞尔,","凯利·阿斯博瑞,","动画,家庭,",null],[10,"喜欢你","","","",""]]]

    var title = $('#sec-title');
    var chart = $('#chart-data');
    // 替换标题和时间
    title.html('<span>电影</span>排行榜TOP10').parent().append('<p> 更新时间: 2017/03/15 </p>');
    // 替换tab
    chart.html('<div class="charts-kinds"><a href="javascript:;" class="j-tab selected">电影影响力榜</a><a href="javascript:;" class="j-tab">电影好评榜</a><a href="javascript:;" class="j-tab">电影热议榜</a><a href="javascript:;" class="j-tab">本月票房排行</a></div>');

    Handlebars.registerHelper('selected', function(idx, opt){
        if(idx === 0) return 'selected';
    });

    Handlebars.registerHelper('rank', function(idx, opt){
        if(idx === '排行') return idx;
        if(idx <= 3) return '<i class="rank-T3">'+idx+'</i>';
        return '<i class="rank-other">'+idx+'</i>';
    });

    var lastIdx;
    Handlebars.registerHelper('index', function(idx, opt){
        if( !parseInt(idx) ) {
            lastIdx = 100000;
            return idx;
        }
        if(idx < 10) return idx;
        
        lastIdx = lastIdx - Math.floor( Math.random()*lastIdx/2 ) ;
        return lastIdx;
    });

    var isBox = false;
    Handlebars.registerHelper('status', function(val, opt){
        if(!val) return;
        
        if(!parseInt(val)){
            if(val === '票房')  isBox=!isBox; // 针对票房
            return val;
        } 
        // 针对票房
        if(isBox){
            return val+' 亿';
        }


        if(val > 0) return '<span class="up"> + '+ Math.floor(Math.random()*1000) +'</span>';
        return '<span class="down"> - '+  Math.floor(Math.random()*1000)  +'</span>'
    });

    var olstr ='<style>.t-2,.t-5{width:130px}.t-4{width:90px}@media(max-width:767px){.chart-list.t-5{display:none}}</style>{{#each this}}<ol class="chart-list j-for {{#selected @index}}{{/selected}}">{{#with this}}{{#each this}}<li><span class="t-1">{{#rank this.[0]}}{{/rank}} </span><span class="t-2"><a href="search.html?movie/{{ this.[1] }}"title="点击查看：{{ this.[1] }}"target="_blank">{{this.[1]}}</a></span><span class="t-3">{{this.[2]}}</span><span class="t-4">{{this.[3]}}</span><span class="t-5">{{this.[4]}}</span><span class="t-6 text-center">{{#index this.[5]}}{{/index}}</span><span class="t-7 text-center">{{#status this.[6]}}{{/status}} </span></li>{{/each}}{{/with}}</ol>{{/each}}'
    var template = Handlebars.compile(olstr);
    var allstr = template(ia);
    chart.append(allstr);

    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

    $('.j-tab').hover(function() {
        if ($(this).hasClass('selected')) {
            return false;
        }
        $(this).siblings().removeClass('selected').end().addClass('selected');
        $('.j-for').removeClass('selected').eq($(this).index()).addClass('selected');
    });
    