var ia = [
    [
        ["排行", "片名", "主演", "地区", "类型", "指数", "走势"],
        ["1", "孤芳不自赏", " 钟汉良 Angelababy 甘婷婷 孙艺洲 于波 ", " 中国大陆 ", " 古装 ", "265,503,948", "↓"],
        ["2", "三生三世十里桃花", " 杨幂 赵又廷 张智尧 迪丽热巴 ", " 中国大陆 ", " 古装 ", "74,910,333", "↑"],
        ["3", "甄嬛传", " 孙俪 陈建斌 蔡少芬 李东学 蒋欣 ", " 中国大陆 ", " 古装 ", "4,107,208", "↓"],
        ["4", "淘气爷孙", " 杜源 石悦安鑫 刘欢 朱茵 徐梵溪 ", " 中国大陆 ", " 都市 ", "2,234,677", "↓"],
        ["5", "爱来的刚好", " 韩栋 江铠同 李威 张熙媛 王伟 ", " 中国大陆 ", " 爱情 ", "2,139,288", "↓"],
        ["6", "学院传说之三生三世桃花缘", " 任言恺 张雅钦 陈秋实 黄子星 ", " 中国大陆香港 ", " 奇幻 ", "2,101,523", "↓"],
        ["7", "漂亮的李慧珍", " 迪丽热巴 盛一伦 李溪芮 张彬彬 ", " 中国大陆 ", " 爱情 ", "1,814,341", "↓"],
        ["8", "芈月传", " 孙俪 刘涛 马苏 方中信 黄轩 高云翔 ", " 中国大陆 ", " 古装 ", "1,762,112", "↓"],
        ["9", "将婚姻进行到底", " 任重 万茜 苏岩 韩青 王策 ", " 中国大陆 ", " 都市 ", "1,702,120", "↓"],
        ["10", "双喜盈门", " 潘长江 肖光奕 韩兆 张大静 徐熙颜 ", " 中国大陆 ", " 剧情 ", "1,398,757", "↑"]
    ],
    [
        ["排行", "片名", "主演", "地区", "类型", "评分"],
        ["1", "漂亮的李慧珍", " 迪丽热巴 盛一伦 李溪芮 张彬彬 ", " 中国大陆 ", "爱情 ", "9.9"],
        ["2", "克拉恋人", " 唐嫣 Rain 罗晋 迪丽热巴 姚奕辰 ", " 中国大陆 ", "爱情 ", "9.9"],
        ["3", "芈月传", " 孙俪 刘涛 马苏 方中信 黄轩 高云翔 ", " 中国大陆 ", "古装 ", "9.8"],
        ["4", "何以笙箫默", " 钟汉良 唐嫣 吴倩 谭凯 米露 赵楚仑 ", " 中国大陆 ", "爱情 ", "9.8"],
        ["5", "医馆笑传", " 陈赫 张子萱 姜妍 王传君 赵圆瑗 ", " 中国大陆 ", "喜剧 ", "9.8"],
        ["6", "甄嬛传", " 孙俪 陈建斌 蔡少芬 李东学 蒋欣 ", " 中国大陆 ", "古装 ", "9.8"],
        ["7", "超少年密码", " 王俊凯 王源 易烊千玺 姜宏波 ", " 中国大陆 ", "科幻 ", "9.8"],
        ["8", "钱多多嫁人记", " 李小冉 朴海镇 张俪 黄小蕾 邵兵 ", " 中国大陆 ", "喜剧 ", "9.8"],
        ["9", "活色生香", " 李易峰 唐嫣 陈伟霆 舒畅 黄明 ", " 中国大陆 ", "爱情 ", "9.8"],
        ["10", "古剑奇谭未删减版", " 杨幂 李易峰 乔振宇 马天宇 郑爽 ", " 中国大陆 ", "武侠 ", "9.8"]
    ],
    [
        ["排行", "片名", "主演", "地区", "类型", "评论数", "走势"],
        ["1", "孤芳不自赏", " 钟汉良 Angelababy 甘婷婷 孙艺洲 于波 ", " 中国大陆 ", " 古装 ", "265,503,948", "↓"],
        ["2", "三生三世十里桃花", " 杨幂 赵又廷 张智尧 迪丽热巴 ", " 中国大陆 ", " 古装 ", "74,910,333", "↑"],
        ["3", "甄嬛传", " 孙俪 陈建斌 蔡少芬 李东学 蒋欣 ", " 中国大陆 ", " 古装 ", "4,107,208", "↓"],
        ["4", "淘气爷孙", " 杜源 石悦安鑫 刘欢 朱茵 徐梵溪 ", " 中国大陆 ", " 都市 ", "2,234,677", "↓"],
        ["5", "爱来的刚好", " 韩栋 江铠同 李威 张熙媛 王伟 ", " 中国大陆 ", " 爱情 ", "2,139,288", "↓"],
        ["6", "学院传说之三生三世桃花缘", " 任言恺 张雅钦 陈秋实 黄子星 ", " 中国大陆香港 ", " 奇幻 ", "2,101,523", "↓"],
        ["7", "漂亮的李慧珍", " 迪丽热巴 盛一伦 李溪芮 张彬彬 ", " 中国大陆 ", " 爱情 ", "1,814,341", "↓"],
        ["8", "芈月传", " 孙俪 刘涛 马苏 方中信 黄轩 高云翔 ", " 中国大陆 ", " 古装 ", "1,762,112", "↓"],
        ["9", "将婚姻进行到底", " 任重 万茜 苏岩 韩青 王策 ", " 中国大陆 ", " 都市 ", "1,702,120", "↓"],
        ["10", "双喜盈门", " 潘长江 肖光奕 韩兆 张大静 徐熙颜 ", " 中国大陆 ", " 剧情 ", "1,398,757", "↑"]
    ],
    [
        ["排行", "片名", "主演", "地区", "类型", "比率"],
        ["1", "漂亮的李慧珍", " 迪丽热巴 盛一伦 李溪芮 张彬彬 ", " 中国大陆 ", "爱情 ", "9.9"],
        ["2", "克拉恋人", " 唐嫣 Rain 罗晋 迪丽热巴 姚奕辰 ", " 中国大陆 ", "爱情 ", "9.9"],
        ["3", "芈月传", " 孙俪 刘涛 马苏 方中信 黄轩 高云翔 ", " 中国大陆 ", "古装 ", "9.8"],
        ["4", "何以笙箫默", " 钟汉良 唐嫣 吴倩 谭凯 米露 赵楚仑 ", " 中国大陆 ", "爱情 ", "9.8"],
        ["5", "医馆笑传", " 陈赫 张子萱 姜妍 王传君 赵圆瑗 ", " 中国大陆 ", "喜剧 ", "9.8"],
        ["6", "甄嬛传", " 孙俪 陈建斌 蔡少芬 李东学 蒋欣 ", " 中国大陆 ", "古装 ", "9.8"],
        ["7", "超少年密码", " 王俊凯 王源 易烊千玺 姜宏波 ", " 中国大陆 ", "科幻 ", "9.8"],
        ["8", "钱多多嫁人记", " 李小冉 朴海镇 张俪 黄小蕾 邵兵 ", " 中国大陆 ", "喜剧 ", "9.8"],
        ["9", "活色生香", " 李易峰 唐嫣 陈伟霆 舒畅 黄明 ", " 中国大陆 ", "爱情 ", "9.8"],
        ["10", "古剑奇谭未删减版", " 杨幂 李易峰 乔振宇 马天宇 郑爽 ", " 中国大陆 ", "武侠 ", "9.8"]
    ],
];


var str = [
    '<li><span class="t-1">排行</span><span class="t-2">片名</span><span class="t-10">主演</span><span class="t-4">地区</span><span class="t-4">类型</span><span class="t-5">昨日新增</span><span class="t-6">走势</span></li>',
    '<li><span class="t-1">排行</span><span class="t-2">片名</span><span class="t-10">主演</span><span class="t-4">地区</span><span class="t-4">类型</span><span class="t-6">评分</span></li>',
    '<li><span class="t-1">排行</span><span class="t-2">片名</span><span class="t-10">主演</span><span class="t-4">地区</span><span class="t-4">类型</span><span class="t-5">昨日新增</span><span class="t-6">走势</span></li>',
    '<li><span class="t-1">排行</span><span class="t-2">片名</span><span class="t-10">主演</span><span class="t-4">地区</span><span class="t-4">类型</span><span class="t-6">评分</span></li>'
];

for (var k = 0; k < ia.length; ++k) {
    var listr = str[k];
    for (var i = 0; i < ia[k].length; ++i) {
        var lilen = ia[k][0].length;
        if (i == 0) {
            var li0 = $(listr);
            for (var j = 0; j < lilen; ++j) {
                li0.find('span:nth-child(' + (j + 1) + ')').html(ia[k][0][j]);
            }
            $($('.chart-list')[k]).html(li0);
        } else {
            var li = $(listr);
            li.find('span:first-child').html('<i class="rank-' + ((ia[k][i][0] > 3) ? 'other' : 'T3') + '">' + ia[k][i][0] + '</i>');
            li.find('span:nth-child(2)').html('<a href="search.html?' + ia[k][i][1] + '" title="点击查看：' + ia[k][i][1] + '" target="_blank">' + ia[k][i][1] + '</a>');

            for (var j = 2; j < lilen; ++j) {
                li.find('span:nth-child(' + (j + 1) + ')').html(ia[k][i][j]);
            }
            var last = li.find('span:last-child').text();
            if (last == '↑' || last == '↓') {
                li.find('span:last-child').addClass((last == '↑') ? 'up' : 'down');
            }
            $($('.chart-list')[k]).append(li);
        }
    }
}