var ia = [
    [
        ["排行", "片名", "主演", "导演", "类型", "指数", "走势"],
        ["1", "朗读者", " 钟汉良 Angelababy 甘婷婷 孙艺洲 于波 ", " 中国大陆 ", " 古装 ", "265,503,948", "↓"],
        [2, "月光男孩", "崔凡特·罗兹,安德烈·霍兰,马赫沙拉·阿里,娜奥米·哈里斯,加奈儿·梦奈,艾什顿·桑德斯,贾雷尔·杰罗姆,艾利克斯·希伯特,杰登·派纳,段·桑德森,艾德森·吉恩,斯蒂芬·布隆,", "巴里·詹金斯,", "剧情,同性,", 6141, "↓"], null, [4, "八月", "孔维一,张晨,郭燕芸,", "张大磊,", "剧情,", 4778, "↑"],
        [5, "我不是潘金莲", "范冰冰,郭涛,大鹏,张嘉译,于和伟,张译,李宗翰,赵立新,田小洁,范伟,高明,刘桦,黄建新,李晨,", "冯小刚,", "剧情,喜剧,", 1166, "↑"],
        [6, "七月与安生", "周冬雨,马思纯,李程彬,李萍,蔡纲,蒙亭宜,沙全泽,姚欣言,李昊芳,蒋亭轩,", "曾国祥,", "剧情,爱情,", 9146, "↑"],
        [7, "血战钢锯岭", "安德鲁·加菲尔德,萨姆·沃辛顿,文斯·沃恩,雨果·维文,卢克·布雷西,泰莉莎·帕尔墨,瑞切尔·格里菲斯,纳撒尼尔·布佐尼克,理查德·劳斯伯格,马特·纳夫莱,费拉斯·迪拉尼,瑞安·柯尔,卢克·佩格勒,", "梅尔·吉布森,", "剧情,动作,传记,历史,战争,", 128, "↑"], null, [9, "推销员", "沙哈布·侯赛尼,塔兰涅·阿里多斯蒂,巴巴克·卡里米,法里德·萨贾蒂·侯赛尼,米娜·沙达蒂,", "阿斯哈·法哈蒂,", "剧情,", 9802, "↑"],
        [10, "她", "伊莎贝尔·于佩尔,罗兰·拉斐特,安妮·康斯金尼,查尔斯·贝尔林,维尔日妮·埃菲拉,朱迪思·马格里,克里斯汀·伯克,乔纳斯·布洛凯,爱丽丝·伊萨,维马拉·庞斯,阿蒂尔·马泽,卢卡斯·普莱瑟,", "保罗·范霍文,", "剧情,惊悚,", 3532, "↑"]
    ],
    [
        ["排行", "片名", "主演", "导演", "类型", "评分"],
        [1, "疯狂动物城", "金妮弗·古德温,杰森·贝特曼,伊德里斯·艾尔巴,珍妮·斯蕾特,内特·托伦斯,邦尼·亨特,唐·雷克,汤米·钟,J·K·西蒙斯,奥克塔维亚·斯宾瑟,艾伦·图代克,夏奇拉,雷蒙德·S·佩尔西,德拉·萨巴,莫里斯·拉马奇,菲尔·约翰斯顿,约翰·迪·玛吉欧,凯蒂·洛斯,吉塔·雷迪,杰西·科尔蒂,汤米·利斯特,乔希·达拉斯,瑞奇·摩尔,凯特·索西,彼得·曼斯布里奇,拜伦·霍华德,杰拉德·布什,马克·史密斯,乔西·特立尼达,约翰·拉维尔,克里斯汀·贝尔,吉尔·科德斯,梅利莎·古德温,", "拜伦·霍华德,瑞奇·摩尔,杰拉德·布什,", "喜剧,动作,动画,冒险,", 9.2],
        [2, "血战钢锯岭", "安德鲁·加菲尔德,萨姆·沃辛顿,文斯·沃恩,雨果·维文,卢克·布雷西,泰莉莎·帕尔墨,瑞切尔·格里菲斯,纳撒尼尔·布佐尼克,理查德·劳斯伯格,马特·纳夫莱,费拉斯·迪拉尼,瑞安·柯尔,卢克·佩格勒,", "梅尔·吉布森,", "剧情,动作,传记,历史,战争,", 8.7], null, [4, "你的名字", "神木隆之介,上白石萌音,长泽雅美,市原悦子,成田凌,悠木碧,岛崎信长,石川界人,谷花音,", "新海诚,", "剧情,爱情,动画,", 8.5],
        [5, "驴得水", "任素汐,大力,刘帅良,裴魁山,阿如那,韩彦博,卜冠今,王堃,高阳,苏千越,查尔斯·亚瑟,王峰,", "周申,刘露,", "剧情,喜剧,", 8.3], null, [7, "萨利机长", "汤姆·汉克斯,艾伦·艾克哈特,劳拉·琳妮,杰瑞·费拉拉,安娜·冈,奥图姆·瑞瑟,霍特·麦克卡兰尼,迈克·奥麦利,杰米·谢尔丹,安·库萨克,莫莉·哈根,马克斯·阿德勒,萨姆·亨廷顿,韦恩·巴斯楚普,维勒莉·玛哈菲,", "克林特·伊斯特伍德,", "剧情,传记,灾难,", 8.3], null, [9, "湄公河行动", "张涵予,彭于晏,孙淳,陈宝国,冯文娟,刘显达,赵健,吴旭东,吴嘉龙,卢惠光,柏华力·莫高彼斯彻,维他亚·潘斯林加姆,", "林超贤,", "动作,犯罪,", 8],
        [10, "罗曼蒂克消亡史", null, "程耳", "剧情,动作,悬疑,", 7.7]
    ],
    [
        ["排行", "片名", "主演", "导演", "类型", "评论数", "走势"],
        [1, "爱乐之城", null, "达米恩·查泽雷", "剧情,爱情,歌舞,", 6445, "↓"],
        [2, "乐高蝙蝠侠大电影", "威尔·阿奈特,罗莎里奥·道森,拉尔夫·费因斯,迈克尔·塞拉,扎克·加利凡纳基斯,珍妮·斯蕾特,玛丽亚·凯莉,查宁·塔图姆,乔纳·希尔,亚当·德维尼,柯南·奥布莱恩,杰森·曼兹沃克斯,艾迪·伊扎德,赛斯·格林,佐伊·克罗维兹,凯特 米库契,瑞琪·琳德赫姆,杰梅奈·克莱门特,艾丽·坎伯尔,", "克里斯·麦凯,", "喜剧,动作,动画,冒险,", 2928, "↑"],
        [3, "一条狗的使命", "布丽特·罗伯森,丹尼斯·奎德,佩吉·利普顿,乔什·加德,K·J·阿帕,布莱斯·吉扎尔,朱丽叶·瑞兰斯,卢克·科比 ,加布里埃尔·罗斯,迈克尔·博夫舍维尔,洛根·米勒,柯比·豪厄-尔巴普蒂斯特,普奇·豪尔,约翰·奥提兹,妮科尔·勒普拉卡,彼特·科拉米斯,卡罗琳·凯芙,简·迈克格雷格,科维西·阿梅扬,卡琳·博姆拜克,娜奥米·弗伦内特,", "拉斯·霍尔斯道姆,", "剧情,喜剧,冒险,", 5203, "↓"],
        [4, "欢乐好声音", "马修·麦康纳,瑞茜·威瑟斯彭,塞思·麦克法兰,斯嘉丽·约翰逊,塔伦·埃格顿,托瑞·凯利,约翰·C·赖利,珍妮弗·桑德斯,詹妮弗·哈德森,加斯·詹宁斯,彼得·塞拉菲诺威茨,尼克·克罗尔,贝克·班尼特,杰·费罗尔,尼克·奥弗曼,", "加斯·詹宁斯,克里斯托夫·卢尔德莱,", "喜剧,动画,歌舞,", 3295, "↑"], null, null, [7, "极限特工3", "范·迪塞尔,甄子丹,迪皮卡·帕度柯妮,吴亦凡,鲁比·罗丝,塞缪尔·杰克逊,妮娜·杜波夫,托尼·贾,托妮·科莱特,赫敏·科菲尔德,阿尔·萨皮恩扎,艾斯·库珀,内马尔,罗伊·麦克凯恩,迈克尔·比斯平,", "D·J·卡卢索,", "动作,冒险,", 4417, "↑"],
        [8, "乘风破浪", "邓超,彭于晏,赵丽颖,董子健,金士杰,易小星,张本煜,李荣浩,高华阳,李淳,孙伊涵,熊黎,李春嫒,潘米,马达加斯加,金毛期期,孙启恒,孙强,彭菲茗,贾川西,张国庆,程诚,白珞力,方励,郭佳杰,冷海鸣,", "韩寒,", "剧情,喜剧,", 8814, "↑"],
        [9, "功夫瑜伽", "成龙,李治廷,张艺兴,索努·苏德,母其弥雅,迪莎·帕塔尼,艾米拉·达斯特,尚语贤,姜雯,张国立,伊利亚娜·狄克鲁兹,", "唐季礼,", "喜剧,动作,冒险,", 4173, "↑"],
        [10, "西游伏妖篇", "吴亦凡,林更新,姚晨,林允,包贝尔,巴特尔,杨一威,大鹏,王丽坤,汪铎,张美娥,", "徐克,", "喜剧,动作,奇幻,古装,", 2945, "↓"]
    ],
    [
        ["排行", "片名", "主演", "导演", "类型", "比率"],
        [1, "功夫瑜伽", "成龙,李治廷,张艺兴,索努·苏德,母其弥雅,迪莎·帕塔尼,艾米拉·达斯特,尚语贤,姜雯,张国立,伊利亚娜·狄克鲁兹,", "唐季礼,", "喜剧,动作,冒险,", 5.3],
        [2, "西游伏妖篇", "吴亦凡,林更新,姚晨,林允,包贝尔,巴特尔,杨一威,大鹏,王丽坤,汪铎,张美娥,", "徐克,", "喜剧,动作,奇幻,古装,", 5.8],
        [3, "极限特工", "范·迪塞尔,艾莎·阿基多,马尔顿·索克斯,塞缪尔·杰克逊,Michael Roof,里奇·穆勒,维尔内尔·达赫,Petr Jákl,Jan Pavel Filipensky,汤姆·埃沃雷特,丹尼·特雷霍,托马斯·伊安·格里菲斯,伊芙,莱拉·阿尔切里,威廉·霍普,", "罗伯·科恩,", "动作,犯罪,冒险,", 7.3],
        [4, "乘风破浪", "邓超,彭于晏,赵丽颖,董子健,金士杰,易小星,张本煜,李荣浩,高华阳,李淳,孙伊涵,熊黎,李春嫒,潘米,马达加斯加,金毛期期,孙启恒,孙强,彭菲茗,贾川西,张国庆,程诚,白珞力,方励,郭佳杰,冷海鸣,", "韩寒,", "剧情,喜剧,", 7],
        [5, "生化危机6", "米拉·乔沃维奇,伊恩·格雷,艾丽·拉特,鲁比·罗丝,李准基,肖恩·罗伯茨,威廉·莱维,欧文·马肯,罗拉,艾尔·安德森,密尔顿·施尔,西沃恩·霍奇森,凯文·奥托,保罗·汉普赛尔,", "保罗·安德森,", "动作,科幻,惊悚,恐怖,", 6.9],
        [6, "大闹天竺", "王宝强,白客,岳云鹏,柳岩,黄渤,林永健,马浴柯,陈佩斯,朱时茂,王祖蓝,刘昊然,", "王宝强,", "喜剧,动作,冒险,", 3.9], null, null, [9, "爱乐之城", null, "达米恩·查泽雷", "剧情,爱情,歌舞,", 8.5],
        [10, "欢乐好声音", "马修·麦康纳,瑞茜·威瑟斯彭,塞思·麦克法兰,斯嘉丽·约翰逊,塔伦·埃格顿,托瑞·凯利,约翰·C·赖利,珍妮弗·桑德斯,詹妮弗·哈德森,加斯·詹宁斯,彼得·塞拉菲诺威茨,尼克·克罗尔,贝克·班尼特,杰·费罗尔,尼克·奥弗曼,", "加斯·詹宁斯,克里斯托夫·卢尔德莱,", "喜剧,动画,歌舞,", 8.3]
    ]
]

var str = [
    '<li><span class="t-1">排行</span><span class="t-2">片名</span><span class="t-10">主演</span><span class="t-4">导演</span><span class="t-4">类型</span><span class="t-5">昨日新增</span><span class="t-6">走势</span></li>',
    '<li><span class="t-1">排行</span><span class="t-2">片名</span><span class="t-10">主演</span><span class="t-4">导演</span><span class="t-4">类型</span><span class="t-6">评分</span></li>',
    '<li><span class="t-1">排行</span><span class="t-2">片名</span><span class="t-10">主演</span><span class="t-4">导演</span><span class="t-4">类型</span><span class="t-5">昨日新增</span><span class="t-6">走势</span></li>',
    '<li><span class="t-1">排行</span><span class="t-2">片名</span><span class="t-10">主演</span><span class="t-4">导演</span><span class="t-4">类型</span><span class="t-6">评分</span></li>'
];

for (var k = 0; k < ia.length; ++k) {
    var listr = str[k];
    for (var i = 0; i < ia[k].length; ++i) {
        var lilen = ia[k][0].length;
        if (!ia[k][i]) { // 检测数据是否存在
            console.log('数据为null', ia[k][i]);
            continue;
        }
        if (i == 0) {
            var li0 = $(listr);
            for (var j = 0; j < lilen; ++j) {
                li0.find('span:nth-child(' + (j + 1) + ')').html(ia[k][0][j]);
            }
            $($('.chart-list')[k]).html(li0);
        } else {
            var li = $(listr);
            li.find('span:first-child').html('<i class="rank-' + ((ia[k][i][0] > 3) ? 'other' : 'T3') + '">' + ia[k][i][0] + '</i>');
            li.find('span:nth-child(2)').html('<a href="searchmovie.html?' + ia[k][i][1] + '" title="点击查看：' + ia[k][i][1] + '" target="_blank">' + ia[k][i][1] + '</a>');

            for (var j = 2; j < lilen; ++j) {
                li.find('span:nth-child(' + (j + 1) + ')').html(ia[k][i][j]);
            }
            var last = li.find('span:last-child').text();
            if (last == '↑' || last == '↓') {
                li.find('span:last-child').addClass((last == '↑') ? 'up' : 'down');
            }
            $($('.chart-list')[k]).append(li);
        }
    }
}
$('.j-tab').hover(function() {
    if ($(this).hasClass('selected'))
        return false;

    $(this).siblings().removeClass('selected').end().addClass('selected');
    $('.j-for').removeClass('selected').eq($(this).index()).addClass('selected');
});