var ia = [
    [
        ["排行", "片名", "主演", "地区", "类型", "指数", "走势"],
        [1, "刺客信条", "迈克尔·法斯宾德 玛丽昂·歌迪亚 杰瑞米·艾恩斯 布莱丹·格里森 ", "美国 英国 法国 香港", "动作 历史 科幻", 5.6],
        [2, "大话西游之大圣娶亲", "周星驰 吴孟达 朱茵 蔡少芬 ", "香港 中国大陆", "动作 冒险 喜剧", 9.1],
        [3, "X战警", "休·杰克曼 帕特里克·斯图尔特 伊恩·麦克莱恩 法米克·詹森 ", "美国 加拿大", "动作 科幻", 7.5],
        [4, "生化危机", "米拉·乔沃维奇 米歇尔·罗德里格兹 科林·萨蒙 埃里克·马比斯 ", "英国 德国 法国 美国", "动作 科幻 恐怖", 7.8],
        [5, "雷锋", "董金棠 杨贵发 党同义 杨秦华 ", "中国大陆", "剧情 传记", 6.4],
        [6, "杀戮都市", "浪川大辅 生天目仁美 矢部雅史 ", "日本", "动画 剧情 奇幻", 7.6],
        [7, "金刚狼", "休·杰克曼 列维·施瑞博尔 瑞恩·雷诺兹 丹尼·赫斯顿 ", "美国", "动作 奇幻 科幻", 7.1],
        [8, "天龙八部", "黄日华 陈浩民 樊少皇 李若彤 ", "香港", "剧情 武侠 古装", 8.7],
        [9, "生化危机：终章", "米拉·乔沃维奇 伊恩·格雷 艾丽·拉特 鲁比·罗丝 ", "美国", "动作 科幻 惊悚", 6.8],
        [10, "降临", "艾米·亚当斯 杰瑞米·雷纳 福里斯特·惠特克 迈克尔·斯图巴 ", "美国", "剧情 科幻", 7.8]
    ],
    [
        ["排行", "片名", "主演", "地区", "类型", "评分"],
        [1, "罗曼蒂克消亡史", "葛优 章子怡 浅野忠信 杜淳 ", "中国大陆 香港", "剧情 动作 悬疑", 7.7],
        [2, "盗墓笔记", "井柏然 鹿晗 马思纯 王景春 ", "中国大陆", "悬疑 奇幻 冒险", 4.7],
        [3, "疯狂动物城", "金妮弗·古德温 杰森·贝特曼 伊德里斯·艾尔巴 珍妮·斯蕾特 ", "美国", "喜剧 动作 动画", 9.2],
        [4, "神奇动物在哪里", "埃迪·雷德梅恩 凯瑟琳·沃特斯顿 丹·福勒 艾莉森·萨多尔 ", "英国 美国", "剧情 奇幻 冒险", 7.9],
        [5, "神探夏洛克 第四季", "本尼迪克特·康伯巴奇 马丁·弗瑞曼 安德鲁·斯科特 鲁珀特·格雷夫斯 ", "英国", "剧情 犯罪 悬疑", 8.2],
        [6, "海洋奇缘", "奥丽伊·卡瓦洛 道恩·强森 艾伦·图代克 杰梅奈·克莱门特 ", "美国", "喜剧 动画 奇幻", 7.6],
        [7, "西游伏妖篇", "吴亦凡 林更新 姚晨 林允 ", "中国大陆 香港", "喜剧 动作 奇幻", 5.8],
        [8, "美女与野兽", "艾玛·沃森 丹·史蒂文斯 卢克·伊万斯 凯文·克莱恩 ", "美国", "爱情 奇幻 歌舞", 0],
        [9, "摆渡人", "梁朝伟 金城武 陈奕迅 杨颖 ", "中国大陆 香港", "喜剧 爱情", 4],
        [10, "驴得水", "任素汐 大力 刘帅良 裴魁山 ", "中国大陆", "剧情 喜剧", 8.3]
    ],
    [
        ["排行", "片名", "主演", "地区", "类型", "评论数", "走势"],
        [1, "爱乐之城", "瑞恩·高斯林 艾玛·斯通 约翰·传奇 罗丝玛丽·德薇特 ", "美国", "剧情 爱情 歌舞", 8.4],
        [2, "三生三世十里桃花", "杨幂 赵又廷 张智尧 迪丽热巴 ", "中国大陆", "剧情 爱情", 6.2],
        [3, "乐高蝙蝠侠大电影", "威尔·阿奈特 罗莎里奥·道森 拉尔夫·费因斯 迈克尔·塞拉 ", "美国", "喜剧 动作 动画", 8.3],
        [4, "功夫瑜伽", "成龙 李治廷 张艺兴 索努·苏德 ", "中国大陆 印度", "喜剧 动作 冒险", 5.3],
        [5, "从你的全世界路过", "邓超 白百何 杨洋 张天爱 ", "中国大陆", "喜剧 爱情", 5.3],
        [6, "魔弦传说", "查理兹·塞隆 马修·麦康纳 拉尔夫·费因斯 阿特·帕金森 ", "美国", "动画 奇幻 冒险", 7.5],
        [7, "血战钢锯岭", "安德鲁·加菲尔德 萨姆·沃辛顿 文斯·沃恩 雨果·维文 ", "美国 澳大利亚", "剧情 传记 动作", 8.7],
        [8, "欢乐好声音", "马修·麦康纳 瑞茜·威瑟斯彭 塞思·麦克法兰 斯嘉丽·约翰逊 ", "美国", "喜剧 动画 歌舞", 8.3],
        [9, "北京时间", "陈乔恩 李保田 马元 孙艺洲 ", "中国大陆", "剧情 爱情", 5.1],
        [10, "铁道飞虎", "成龙 黄子韬 王凯 王大陆 ", "中国大陆", "喜剧 动作", 5.1]
    ],
    [
        ["排行", "片名", "主演", "地区", "类型", "比率"],
        [1, "大闹天竺", "王宝强 白客 岳云鹏 柳岩 ", "中国大陆", "喜剧 动作 冒险", 3.9],
        [2, "微微一笑很倾城", "郑爽 杨洋 毛晓彤 白宇 ", "中国大陆", "剧情 爱情", 6.3],
        [3, "斗地主", "韩兆 刘桦 买红妹 曹随风 ", "中国大陆", "喜剧", 4.8],
        [4, "完美有多美", "姜武 蒋勤勤 李乃文 朱旭 ", "中国大陆", "喜剧 爱情 奇幻", 5.6],
        [5, "你的名字。", "神木隆之介 上白石萌音 长泽雅美 市原悦子 ", "日本", "剧情 爱情 动画", 8.5],
        [6, "朗读者", "董卿 濮存昕 李敬泽 蒋励 ", "中国大陆", "脱口秀", 9],
        [7, "探魔导师", "洪冰瑶 孔舒航 慕岩 金尤美 ", "中国大陆", "科幻 奇幻 冒险", 3.2],
        [8, "欢乐喜剧人", "郭德纲 岳云鹏 罗温·艾金森 艾伦 ", "中国大陆", "喜剧", 0],
        [9, "天黑请闭眼", "张书豪 简嫚书 陈祎伦 朱盛平 ", "台湾", "悬疑 惊悚", 7.4],
        [10, "乘风破浪", "邓超 彭于晏 赵丽颖 董子健 ", "中国大陆", "剧情 喜剧", 7]
    ]
]

var str = [
    '<li><span class="t-1">排行</span><span class="t-2">片名</span><span class="t-10">主演</span><span class="t-4">地区</span><span class="t-4">类型</span><span class="t-5">昨日新增</span><span class="t-6">走势</span></li>',
    '<li><span class="t-1">排行</span><span class="t-2">片名</span><span class="t-10">主演</span><span class="t-4">地区</span><span class="t-4">类型</span><span class="t-6">评分</span></li>',
    '<li><span class="t-1">排行</span><span class="t-2">片名</span><span class="t-10">主演</span><span class="t-4">地区</span><span class="t-4">类型</span><span class="t-5">昨日新增</span><span class="t-6">走势</span></li>',
    '<li><span class="t-1">排行</span><span class="t-2">片名</span><span class="t-10">主演</span><span class="t-4">地区</span><span class="t-4">类型</span><span class="t-6">评分</span></li>'
];

for (var k = 0; k < ia.length; ++k) {
    var listr = str[k];
    for (var i = 0; i < ia[k].length; ++i) {
        var lilen = ia[k][0].length;
        if (i == 0) {
            var li0 = $(listr);
            for (var j = 0; j < lilen; ++j) {
                li0.find('span:nth-child(' + (j + 1) + ')').html(ia[k][0][j]);
            }
            $($('.chart-list')[k]).html(li0);
        } else {
            var li = $(listr);
            li.find('span:first-child').html('<i class="rank-' + ((ia[k][i][0] > 3) ? 'other' : 'T3') + '">' + ia[k][i][0] + '</i>');
            li.find('span:nth-child(2)').html('<a href="searchmovie.html?' + ia[k][i][1] + '" title="点击查看：' + ia[k][i][1] + '" target="_blank">' + ia[k][i][1] + '</a>');

            for (var j = 2; j < lilen; ++j) {
                li.find('span:nth-child(' + (j + 1) + ')').html(ia[k][i][j]);
            }
            var last = li.find('span:last-child').text();
            if (last == '↑' || last == '↓') {
                li.find('span:last-child').addClass((last == '↑') ? 'up' : 'down');
            }
            $($('.chart-list')[k]).append(li);
        }
    }
}