var ia = [
    [
        ["排行", "片名", "主演", "导演", "类型", "影响力指数", "同比上期"],
        [1, "爱乐之城", "瑞恩·高斯林,   艾玛·斯通,   约翰·传奇,   罗丝玛丽·德薇特,   芬·维特洛克", "达米恩·查泽雷", "剧情,  爱情,  歌舞,  ", 8216, 3],
        [2, "月光男孩", "崔凡特·罗兹,  安德烈·霍兰,  马赫沙拉·阿里,  娜奥米·哈里斯,  加奈儿·梦奈,  艾什顿·桑德斯,  贾雷尔·杰罗姆,  艾利克斯·希伯特,  杰登·派纳,  段·桑德森,  艾德森·吉恩,  斯蒂芬·布隆,  ", "巴里·詹金斯,  ", "剧情,  同性,  ", 9816, -5],
        [3, "海边的曼彻斯特", "卡西·阿弗莱克,  卢卡斯·赫奇斯,  米歇尔·威廉姆斯,  C·J·威尔逊,  凯尔·钱德勒,  卡拉·海沃德,  格瑞辰·摩尔,  泰特·多诺万,  埃里卡·麦克德莫特,  希瑟·伯恩斯,  蜜西·雅格,  斯蒂芬·亨德森,  约什·汉密尔顿,  卡洛琳·皮克曼,  肖恩·菲茨吉本,  肯尼思·洛纳根,  利亚姆·麦克尼尔,  马修·布罗德里克,  ", "肯尼思·洛纳根,  ", "剧情,  家庭,  ", 8662, 3],
        [4, "八月", "孔维一,  张晨,  郭燕芸,  ", "张大磊,  ", "剧情,  ", 6039, 3],
        [5, "我不是潘金莲", "范冰冰,  郭涛,  大鹏,  张嘉译,  于和伟,  张译,  李宗翰,  赵立新,  田小洁,  范伟,  高明,  刘桦,  黄建新,  李晨,  ", "冯小刚,  ", "剧情,  喜剧,  ", 4938, 3],
        [6, "七月与安生", "周冬雨,  马思纯,  李程彬,  李萍,  蔡纲,  蒙亭宜,  沙全泽,  姚欣言,  李昊芳,  蒋亭轩,  ", "曾国祥,  ", "剧情,  爱情,  ", 6789, -5],
        [7, "血战钢锯岭", "安德鲁·加菲尔德,  萨姆·沃辛顿,  文斯·沃恩,  雨果·维文,  卢克·布雷西,  泰莉莎·帕尔墨,  瑞切尔·格里菲斯,  纳撒尼尔·布佐尼克,  理查德·劳斯伯格,  马特·纳夫莱,  费拉斯·迪拉尼,  瑞安·柯尔,  卢克·佩格勒,  ", "梅尔·吉布森,  ", "剧情,  动作,  传记,  历史,  战争,  ", 9312, -5],
        [8, "釜山行", " 孔侑,   郑有美,   马东锡,   金秀安,   金义城,   ", "延尚昊", "动作,   惊悚,   灾难", 8319, -5],
        [9, "推销员", "沙哈布·侯赛尼,  塔兰涅·阿里多斯蒂,  巴巴克·卡里米,  法里德·萨贾蒂·侯赛尼,  米娜·沙达蒂,  ", "阿斯哈·法哈蒂,  ", "剧情,  悬疑,  ", 132, -5],
        [10, "疯狂动物城", "金妮弗·古德温,  杰森·贝特曼,  伊德里斯·艾尔巴,  珍妮·斯蕾特,  内特·托伦斯,  邦尼·亨特,  唐·雷克,  汤米·钟,  J·K·西蒙斯,  奥克塔维亚·斯宾瑟,  艾伦·图代克,  夏奇拉,  雷蒙德·S·佩尔西,  德拉·萨巴,  莫里斯·拉马奇,  菲尔·约翰斯顿,  约翰·迪·玛吉欧,  凯蒂·洛斯,  吉塔·雷迪,  杰西·科尔蒂,  汤米·利斯特,  乔希·达拉斯,  瑞奇·摩尔,  凯特·索西,  彼得·曼斯布里奇,  拜伦·霍华德,  杰拉德·布什,  马克·史密斯,  乔西·特立尼达,  约翰·拉维尔,  克里斯汀·贝尔,  吉尔·科德斯,  梅利莎·古德温,  ", "拜伦·霍华德,  瑞奇·摩尔,  杰拉德·布什,  ", "喜剧,  动作,  动画,  冒险,  ", 757, 3]
    ],
    [
        ["排行", "片名", "主演", "导演", "类型", "评分"],
        [1, "疯狂动物城", "金妮弗·古德温,  杰森·贝特曼,  伊德里斯·艾尔巴,  珍妮·斯蕾特,  内特·托伦斯,  邦尼·亨特,  唐·雷克,  汤米·钟,  J·K·西蒙斯,  奥克塔维亚·斯宾瑟,  艾伦·图代克,  夏奇拉,  雷蒙德·S·佩尔西,  德拉·萨巴,  莫里斯·拉马奇,  菲尔·约翰斯顿,  约翰·迪·玛吉欧,  凯蒂·洛斯,  吉塔·雷迪,  杰西·科尔蒂,  汤米·利斯特,  乔希·达拉斯,  瑞奇·摩尔,  凯特·索西,  彼得·曼斯布里奇,  拜伦·霍华德,  杰拉德·布什,  马克·史密斯,  乔西·特立尼达,  约翰·拉维尔,  克里斯汀·贝尔,  吉尔·科德斯,  梅利莎·古德温,  ", "拜伦·霍华德,  瑞奇·摩尔,  杰拉德·布什,  ", "喜剧,  动作,  动画,  冒险,  ", 9.2],
        [2, "血战钢锯岭", "安德鲁·加菲尔德,  萨姆·沃辛顿,  文斯·沃恩,  雨果·维文,  卢克·布雷西,  泰莉莎·帕尔墨,  瑞切尔·格里菲斯,  纳撒尼尔·布佐尼克,  理查德·劳斯伯格,  马特·纳夫莱,  费拉斯·迪拉尼,  瑞安·柯尔,  卢克·佩格勒,  ", "梅尔·吉布森,  ", "剧情,  动作,  传记,  历史,  战争,  ", 8.7],
        [3, "海边的曼彻斯特", "卡西·阿弗莱克,  卢卡斯·赫奇斯,  米歇尔·威廉姆斯,  C·J·威尔逊,  凯尔·钱德勒,  卡拉·海沃德,  格瑞辰·摩尔,  泰特·多诺万,  埃里卡·麦克德莫特,  希瑟·伯恩斯,  蜜西·雅格,  斯蒂芬·亨德森,  约什·汉密尔顿,  卡洛琳·皮克曼,  肖恩·菲茨吉本,  肯尼思·洛纳根,  利亚姆·麦克尼尔,  马修·布罗德里克,  ", "肯尼思·洛纳根,  ", "剧情,  家庭,  ", 8.6],
        [4, "你的名字", " 神木隆之介,   上白石萌音,   长泽雅美,   市原悦子,   成田凌,  ", "新海诚", "剧情,   爱情,   动画", 8.5],
        [5, "驴得水", "任素汐,  大力,  刘帅良,  裴魁山,  阿如那,  韩彦博,  卜冠今,  王堃,  高阳,  苏千越,  查尔斯·亚瑟,  王峰,  ", "周申,  刘露,  ", "剧情,  喜剧,  ", 8.3],
        [6, "隐藏人物", "塔拉吉·P·汉森,  奥克塔维亚·斯宾瑟,  加奈儿·梦奈,  凯文·科斯特纳,  克斯汀·邓斯特,  吉姆·帕森斯,  马赫沙拉·阿里,  阿尔迪斯·霍吉,  格伦·鲍威尔,  金贝利·奎恩,  奥莱克·克鲁帕,  ", "特奥多尔·梅尔菲,  ", "剧情,  传记,  历史,  ", 8.6],
        [7, "萨利机长", "汤姆·汉克斯,  艾伦·艾克哈特,  劳拉·琳妮,  杰瑞·费拉拉,  安娜·冈,  奥图姆·瑞瑟,  霍特·麦克卡兰尼,  迈克·奥麦利,  杰米·谢尔丹,  安·库萨克,  莫莉·哈根,  马克斯·阿德勒,  萨姆·亨廷顿,  韦恩·巴斯楚普,  维勒莉·玛哈菲,  ", "克林特·伊斯特伍德,  ", "剧情,  传记,  灾难,  ", 8.3],
        [8, "釜山行", " 孔侑,   郑有美,   马东锡,   金秀安,   金义城,   ", "延尚昊", "动作,   惊悚,   灾难", 8.2],
        [9, "湄公河行动", "张涵予,  彭于晏,  孙淳,  陈宝国,  冯文娟,  刘显达,  赵健,  吴旭东,  吴嘉龙,  卢惠光,  柏华力·莫高彼斯彻,  维他亚·潘斯林加姆,  ", "林超贤,  ", "动作,  犯罪,  ", 8],
        [10, "罗曼蒂克消亡史", " 葛优,   章子怡,   浅野忠信,   杜淳,   钟欣潼,   ", "程耳", "剧情,  动作,  悬疑,  ", 7.7]
    ],
    [
        ["排行", "片名", "主演", "导演", "类型", "评论数", "同比上期"],
        [1, "爱乐之城", "瑞恩·高斯林,   艾玛·斯通,   约翰·传奇,   罗丝玛丽·德薇特,   芬·维特洛克", "达米恩·查泽雷", "剧情,  爱情,  歌舞,  ", 5532, 3],
        [2, "乐高蝙蝠侠大电影", "威尔·阿奈特,  罗莎里奥·道森,  拉尔夫·费因斯,  迈克尔·塞拉,  扎克·加利凡纳基斯,  珍妮·斯蕾特,  玛丽亚·凯莉,  查宁·塔图姆,  乔纳·希尔,  亚当·德维尼,  柯南·奥布莱恩,  杰森·曼兹沃克斯,  艾迪·伊扎德,  赛斯·格林,  佐伊·克罗维兹,  凯特 米库契,  瑞琪·琳德赫姆,  杰梅奈·克莱门特,  艾丽·坎伯尔,  ", "克里斯·麦凯,  ", "喜剧,  动作,  动画,  冒险,  ", 5546, 3],
        [3, "一条狗的使命", "布丽特·罗伯森,  丹尼斯·奎德,  佩吉·利普顿,  乔什·加德,  K·J·阿帕,  布莱斯·吉扎尔,  朱丽叶·瑞兰斯,  卢克·科比 ,  加布里埃尔·罗斯,  迈克尔·博夫舍维尔,  洛根·米勒,  柯比·豪厄-尔巴普蒂斯特,  普奇·豪尔,  约翰·奥提兹,  妮科尔·勒普拉卡,  彼特·科拉米斯,  卡罗琳·凯芙,  简·迈克格雷格,  科维西·阿梅扬,  卡琳·博姆拜克,  娜奥米·弗伦内特,  ", "拉斯·霍尔斯道姆,  ", "剧情,  喜剧,  冒险,  ", 1732, -5],
        [4, "欢乐好声音", "马修·麦康纳,  瑞茜·威瑟斯彭,  塞思·麦克法兰,  斯嘉丽·约翰逊,  塔伦·埃格顿,  托瑞·凯利,  约翰·C·赖利,  珍妮弗·桑德斯,  詹妮弗·哈德森,  加斯·詹宁斯,  彼得·塞拉菲诺威茨,  尼克·克罗尔,  贝克·班尼特,  杰·费罗尔,  尼克·奥弗曼,  ", "加斯·詹宁斯,  克里斯托夫·卢尔德莱,  ", "喜剧,  动画,  歌舞,  ", 4624, -5],
        [5, "金刚狼3", " 休·杰克曼,   帕特里克·斯图尔特,   达芙妮·基恩,   波伊德·霍布鲁克,   斯戴芬·莫昌特", "詹姆斯·曼高德", "剧情,   动作,   科幻", 4074, -5],
        [6, "生化危机：终章", "米拉·乔沃维奇,  伊恩·格雷,  艾丽·拉特,  鲁比·罗丝,  李准基,  肖恩·罗伯茨,  威廉·莱维,  欧文·马肯,  罗拉,  艾尔·安德森,  密尔顿·施尔,  西沃恩·霍奇森,  凯文·奥托,  保罗·汉普赛尔,  ", "保罗·安德森,  ", "动作,  科幻,  惊悚,  恐怖,  ", 5261, -5],
        [7, "极限特工3", "范·迪塞尔,   甄子丹,   迪皮卡·帕度柯妮,   吴亦凡,   鲁比·罗丝,  ", "D·J·卡卢索", "动作,   冒险", 5585, -5],
        [8, "乘风破浪", " 邓超,   彭于晏,   赵丽颖,   董子健,   金士杰,   ", "Philipp Comarella,  Simon Griesser,  ", "动画,  短片,  冒险,  运动,  ", 8912, -5],
        [9, "功夫瑜伽", "成龙,  李治廷,  张艺兴,  索努·苏德,  母其弥雅,  迪莎·帕塔尼,  艾米拉·达斯特,  尚语贤,  姜雯,  张国立,  伊利亚娜·狄克鲁兹,  ", "唐季礼,  ", "喜剧,  动作,  冒险,  ", 793, 3],
        [10, "西游伏妖篇", "吴亦凡,  林更新,  姚晨,  林允,  包贝尔,  巴特尔,  杨一威,  大鹏,  王丽坤,  汪铎,  张美娥,  ", "徐克,  ", "喜剧,  动作,  奇幻,  古装,  ", 8084, -5]
    ],
    [
        ["排行", "片名", "主演", "导演", "类型", "评分", "票房"],
        [1, "功夫瑜伽", "成龙,  李治廷,  张艺兴,  索努·苏德,  母其弥雅,  迪莎·帕塔尼,  艾米拉·达斯特,  尚语贤,  姜雯,  张国立,  伊利亚娜·狄克鲁兹,  ", "唐季礼,  ", "喜剧,  动作,  冒险,  ", 5.3, 17.5],
        [2, "西游伏妖篇", "吴亦凡,  林更新,  姚晨,  林允,  包贝尔,  巴特尔,  杨一威,  大鹏,  王丽坤,  汪铎,  张美娥,  ", "徐克,  ", "喜剧,  动作,  奇幻,  古装,  ", 5.8, 16.6],
        [3, "极限特工", "范·迪塞尔,  艾莎·阿基多,  马尔顿·索克斯,  塞缪尔·杰克逊,  Michael Roof,  里奇·穆勒,  维尔内尔·达赫,  Petr Jákl,  Jan Pavel Filipensky,  汤姆·埃沃雷特,  丹尼·特雷霍,  托马斯·伊安·格里菲斯,  伊芙,  莱拉·阿尔切里,  威廉·霍普,  ", "罗伯·科恩,  ", "动作,  犯罪,  冒险,  ", 7.3, 11.3],
        [4, "乘风破浪", " 邓超,   彭于晏,   赵丽颖,   董子健,   金士杰,   ", "Philipp Comarella,  Simon Griesser,  ", "动画,  短片,  冒险,  运动,  ", 7.8, 10.4],
        [5, "生化危机6", " 米拉·乔沃维奇,   伊恩·格雷,   艾丽·拉特,   鲁比·罗丝,   李准基,  ", "保罗·安德森", "动作,   科幻,   惊悚,   恐怖", 6.8, 10.08],
        [6, "大闹天竺", "王宝强,  白客,  岳云鹏,  柳岩,  黄渤,  林永健,  马浴柯,  陈佩斯,  朱时茂,  王祖蓝,  刘昊然,  ", "王宝强,  ", "喜剧,  动作,  冒险,  ", 3.9, 7.5],
        [7, "熊出没之奇幻空间", "尚雯婕,   鲍春来,   孙建弘,   曾舜晞", "丁亮", "动画,   儿童", 6.5, 1.11],
        [8, "金刚狼3", " 休·杰克曼,   帕特里克·斯图尔特,   达芙妮·基恩,   波伊德·霍布鲁克,   斯戴芬·莫昌特", "詹姆斯·曼高德", "剧情,   动作,   科幻", 8.4, 4.62],
        [9, "爱乐之城", "瑞恩·高斯林,   艾玛·斯通,   约翰·传奇,   罗丝玛丽·德薇特,   芬·维特洛克", "达米恩·查泽雷", "剧情,  爱情,  歌舞,  ", 8.5, 2.4],
        [10, "欢乐好声音", "马修·麦康纳,  瑞茜·威瑟斯彭,  塞思·麦克法兰,  斯嘉丽·约翰逊,  塔伦·埃格顿,  托瑞·凯利,  约翰·C·赖利,  珍妮弗·桑德斯,  詹妮弗·哈德森,  加斯·詹宁斯,  彼得·塞拉菲诺威茨,  尼克·克罗尔,  贝克·班尼特,  杰·费罗尔,  尼克·奥弗曼,  ", "加斯·詹宁斯,  克里斯托夫·卢尔德莱,  ", "喜剧,  动画,  歌舞,  ", 8.3, 1.9]
    ]
]



var title = $('#sec-title');
var chart = $('#chart-data');
// 替换标题和时间
title.html('<span>电影</span>排行榜TOP10').parent().append('<p> 更新时间: 2017/03/15 </p>');
// 替换tab
chart.html(`<div class="charts-kinds">
<a href="javascript:;" class="j-tab selected">电影影响力榜</a>
<a href="javascript:;" class="j-tab">电影好评榜</a>
<a href="javascript:;" class="j-tab">电影热议榜</a>
<a href="javascript:;" class="j-tab">本月票房排行</a>
</div>`);

Handlebars.registerHelper('selected', function(idx, opt){
    if(idx === 0) return 'selected';
});

Handlebars.registerHelper('rank', function(idx, opt){
    if(idx === '排行') return idx;
    if(idx <= 3) return '<i class="rank-T3">'+idx+'</i>';
    return '<i class="rank-other">'+idx+'</i>';
});

var lastIdx;
Handlebars.registerHelper('index', function(idx, opt){
    if( !parseInt(idx) ) {
        lastIdx = 100000;
        return idx;
    }
    if(idx < 10) return idx;
    
    lastIdx = lastIdx - Math.floor( Math.random()*lastIdx/2 ) ;
    return lastIdx;
});

var isBox = false;
Handlebars.registerHelper('status', function(val, opt){
    if(!val) return;
    
    if(!parseInt(val)){
        if(val === '票房')  isBox=!isBox; // 针对票房
        return val;
    } 
    // 针对票房
    if(isBox){
        return val+' 亿';
    }


    if(val > 0) return '<span class="up"> + '+ Math.floor(Math.random()*1000) +'</span>';
    return '<span class="down"> - '+  Math.floor(Math.random()*1000)  +'</span>'
});

var olstr =
`
<style>
.t-2 , .t-5 {
        width: 130px;
}
.t-4 {
        width: 90px;
}
@media (max-width: 767px) {
    .chart-list .t-5 {
        display: none;
    }
}
</style>

{{#each this}}
<ol class="chart-list j-for {{#selected @index}}{{/selected}}">
    {{#with this}}
        {{#each this}}
        <li>
            <span class="t-1"> {{#rank this.[0]}}{{/rank}} </span>
            <span class="t-2"> <a href="search.html?movie/{{ this.[1] }}" title="点击查看：{{ this.[1] }}" target="_blank"> {{ this.[1] }} </a></span>
            <span class="t-3">{{ this.[2] }}</span>
            <span class="t-4">{{ this.[3] }}</span>
            <span class="t-5">{{ this.[4] }}</span>
            <span class="t-6 text-center">{{#index this.[5]}}{{/index}}</span>
            <span class="t-7 text-center"> {{#status this.[6]}}{{/status}} </span>
        </li>
        {{/each}}
    {{/with}}
</ol>
{{/each}}
`
var template = Handlebars.compile(olstr);
var allstr = template(ia);
chart.append(allstr);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// var str = [
//     '<li><span class="t-1">排行</span><span class="t-2">片名</span><span class="t-10">主演</span><span class="t-4">导演</span><span class="t-4">类型</span><span class="t-5">昨日新增</span><span class="t-6">走势</span></li>',
//     '<li><span class="t-1">排行</span><span class="t-2">片名</span><span class="t-10">主演</span><span class="t-4">导演</span><span class="t-4">类型</span><span class="t-6">评分</span></li>',
//     '<li><span class="t-1">排行</span><span class="t-2">片名</span><span class="t-10">主演</span><span class="t-4">导演</span><span class="t-4">类型</span><span class="t-5">昨日新增</span><span class="t-6">走势</span></li>',
//     '<li><span class="t-1">排行</span><span class="t-2">片名</span><span class="t-10">主演</span><span class="t-4">导演</span><span class="t-4">类型</span><span class="t-4">评分</span><span class="t-4">票房</span></li>'
// ];

// var hbstr = `<li><span class="t-1">排行</span><span class="t-2">片名</span><span class="t-10">主演</span><span class="t-4">导演</span><span class="t-4">类型</span><span class="t-5">昨日新增</span><span class="t-6">走势</span></li>`

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// var ian = ia.length;
// var chartdata = $('.chart-data');
// var tabs = ['电影影响力榜', '电影热议榜', '电影好评榜', '本月票房排行', '更新时间: 2017/02/23'];

// $('.heading-inner').html('<h2 class="sec-title"> <span>电影</span>排行榜</h2><p>' + tabs[tabs.length-1] + '</p>');

// chartdata.find('.charts-kinds').find('a').html(tabs[0]);

// for (var i = 1; i < ian; ++i) {
//     chartdata.append('<ol class="chart-list j-for"></ol>').end().find('.charts-kinds').append('<a href="javascript:;"class="j-tab">' + tabs[i] + '</a>');
// }

// ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// for (var k = 0; k < ian; ++k) {
//     var listr = str[k];
//     for (var i = 0; i < ia[k].length; ++i) {
//         var lilen = ia[k][0].length;
//         if (i == 0) {
//             var li0 = $(listr);
//             for (var j = 0; j < lilen; ++j) {
//                 li0.find('span:nth-child(' + (j + 1) + ')').html(ia[k][0][j]);
//             }
//             $($('.chart-list')[k]).html(li0);
//         } else {
//             var li = $(listr);
//             li.find('span:first-child').html('<i class="rank-' + ((ia[k][i][0] > 3) ? 'other' : 'T3') + '">' + ia[k][i][0] + '</i>');

//             if (ia[k][i][1] == '湄公河行动')
//                 li.find('span:nth-child(2)').html('<a href="mghxd.html?' + ia[k][i][1] + '" title="点击查看：' + ia[k][i][1] + '" target="_blank">' + ia[k][i][1] + '</a>');
//             else
//                 li.find('span:nth-child(2)').html('<a href="search.html?movie/' + ia[k][i][1] + '" title="点击查看：' + ia[k][i][1] + '" target="_blank">' + ia[k][i][1] + '</a>');

//             for (var j = 2; j < lilen; ++j) {
//                 li.find('span:nth-child(' + (j + 1) + ')').html(ia[k][i][j]);
//             }
//             var last = li.find('span:last-child').text();
//             if (last == '↑' || last == '↓') {
//                 li.find('span:last-child').addClass((last == '↑') ? 'up' : 'down');
//             }
//             $($('.chart-list')[k]).append(li);
//         }
//     }
// }
$('.j-tab').hover(function() {
    if ($(this).hasClass('selected')) {
        return false;
    }
    $(this).siblings().removeClass('selected').end().addClass('selected');
    $('.j-for').removeClass('selected').eq($(this).index()).addClass('selected');
});