var ia = [
    [
        ["排行", "片名", "简介", "类型", "播放量", "走势"],
        [1, "向往的生活", "大型生活服务纪实节目《向往的生活》中黄磊与何炅首度荧屏合体，他们一个最适合做美食节目的男人和一个最适合做治愈节目的男人，外加音乐才子刘宪华，三人一起守拙归田园，将为观众们带来一幅“自力更生，自给自足，反映待 客之道”的生活画面。", "真人秀", 1986, "↓"],
        [2, "吐槽大会", "由腾讯视频、上海笑果文化传媒有限公司联合出品的喜剧脱口秀《吐槽大会》将于2017年1月8日起每周日晚在腾讯视频上线播出。“吐槽是门手艺，笑对需要勇气”，和传统喜剧节目最大的不同是，《吐槽大会》以网络独有的“吐槽文化”为切入点，每一期节目都会邀请一位话题名人，让他们接受吐槽和自嘲。光鲜亮丽的名人遭遇群嘲的场面实属罕见，也吊足观众胃口。", "脱口秀", 1992, "↓"],
        [3, "歌手", "《歌手2017》前身为《我是歌手》，引进自韩国MBC电视台歌手竞赛节目。\n2016年12月14日，湖南卫视公布官方消息，王牌音乐节目《我是歌手》确定更名为《歌手》，并换档至周六晚22：30播出。据了解，更名后的《歌手》是有别于《我是歌手》的全新音乐节目，虽然依旧主打专业实力歌手间的同台比拼，但在整体面貌上有所革新，仅赛制方面就变为期期有淘汰，更有往年《我是歌手》的实力唱将回归，邀请嘉宾的标准也从此前的“立足华语乐坛，放眼全亚洲”拓宽到世界范围，目前有国际唱将正在敲定中。", "音乐 真人秀", 1696, "↓"],
        [4, "朗读者", "《朗读者》是中央电视台推出的大型文化情感类节目，著名节目主持人董卿首次担当制作人，央视创造传媒有限公司、中广天择传媒股份有限公司承担制作，于中央电视台综合频道与综艺频道黄金时间联合播出。以个人成长、情感体验、背景故事与传世佳作相结合的方式，选用精美的文字，用最平实的情感读出文字背后的价值，节目旨 在实现文化感染人、鼓舞人、教育人的传导作用，展现有血有肉的真实人物情感。\n《朗读者》邀请各个领域具有影响力的嘉宾来到现场，分享自己的人生故事并倾情演绎来自朗读者文学顾问团的国家顶级文学家、出版人、专家、学者精心挑选的经典美文，最终节目将会呈现出生命之美、文学之美和情感之美。\n《朗读者》是著名节目主持人董卿20多年电视经验的一次全情绽放，她不仅担纲节目的主持工作，还首次以制作人的身份转型大型电视节目的幕后制作，呈现出不同于以往主持人的另一面。董卿表示《朗读者》中的“朗读”二字重文字，“者”字重人。我们要展现有血有肉的真实人物情感，并感动于他们让观众遇见了大千世界。", "脱口秀", 2788, "↓"],
        [5, "快乐大本营", "《快乐大本营》是本土制造的综艺先锋，以“清新、青春、快乐、激情、八卦、生活”的娱乐风格在中国电视娱乐版图迅速卡位，其带动的明星效应和倡导的快乐理念至今生命力不减，十几年来已融为中国青少年文化的一部分，并为湖南卫视打造成中国第一电视娱乐品牌定下基调。不仅是湖南卫视一直保持至今的品牌节目，也是中国电视界综艺娱乐节目的领头羊；同时也是中国最有影响力的娱乐节目之一甚至成为中国亿万观众娱乐生活的一部分。娱乐圈内的知名艺人几乎都曾经登上过《快乐大本营》的舞台，留下属于他们的精彩瞬间。《快乐大本营》新创意的主题性综艺节目，为普通观众或草根团体及组合打造了一个展现个性的“全民娱乐”平台和分享快乐的机会，同时也极力为电视机前的观众推介时尚、新奇的文艺表演形式，传递“快乐至上”的娱乐精神，突出了以观众为主体的“娱乐天下”的节目理念。", "脱口秀", 1526, "↑"],
        [6, "王牌对王牌 第一季", "《王牌对王牌》是浙江卫视2016年第一季度全新打造的大型棚内明星艺能成长类节目。近日，浙江卫视首度正式曝光了明年的版面编排，四个季度累计的季播节目多达22档以上，当属卫视之冠。其中第一季度更是周末三天全部叠播编排，每周累计7档季播节目。而明年的第一季度将由《王牌对王牌》和《二十四小时》两档节目叠播填充，《王牌对王牌》节目模式为“中国最红王牌队员对决”。", "真人秀", 564, "↓"],
        [7, "天天向上", "大型礼仪公德脱口秀\n用各种形式来传播中国千年礼仪之邦的礼仪文化，让国民在娱乐嬉笑之余感受中华传统美德的精髓并借此发扬光大是节目定位的深度体现，也是节目创建的一种背景，随着节目题材范围的拓宽，节目的核心气质是青春励志，并将把“青春励志”和“传统礼仪”作为必守的原则。", "脱口秀", 977, "↓"],
        [8, "火星情报局 第一季", "《火星情报局》旨在纵容一切新奇有趣的发现，以特工为单位，守护提案，舌战群儒。激活全民洞察潜能，用火星方式弄喜你。\n在节目氛围中，火星情报局被定义为某地外情报机构，由汪涵出任局长统领局内事务。明\n星作为火星特工代表，定期向局长汇报新奇有趣的新发现，并给出建设性提议，引发全民提案风潮。局内情报评估采用“火星元老院”的质询形式，对有价值的情报进行探讨、审议，并派遣火星特工对有价值的情报进行趣味验证。最终由局长对新发现提案进行裁决，通过的提案将被列入火星历法，被所有火星人遵守。\n节目讨论的话题都来自于优酷土豆大数据，这也意味着节目中的内容极易触发网友共鸣；节目还间接地为网友的“脑洞大开”提供了施展平台，节目形式和内容尺度都充分彰显了其网生综艺的特质，并通过颠覆性的玩法、革命性的形态，以及创新性的互动方式，让观众们在欢笑中探索新奇。", "脱口秀", 3004, "↓"],
        [9, "极限挑战 第三季", "极限挑战第二季收官，并表示极限挑战第三季将于明年到来 。", "真人秀", 39, "↑"],
        [10, "最强大脑 第四季", "《最强大脑》是江苏卫视借鉴德国节目《Super Brain》推出的国内首档大型科学类真人秀节目，是专注于传播脑科学知识和脑力竞技的节目。\n2016年12月5日，《最强大脑》第四季节目组宣布，将引入“人机大战”模式，百度研发的人工智能机器人“小度”将作为特别选手参赛，与人类“最强大脑”现场对决。", "真人秀", 722, "↓"]
    ],
    [
        ["排行", "片名", "简介", "类型", "评论数", "走势"],
        [1, "朗读者", "《朗读者》是中央电视台推出的大型文化情感类节目，著名节目主持人董卿首次担当制作人，央视创造传媒有限公司、中广天择传媒股份有限公司承担制作，于中央电视台综合频道与综艺频道黄金时间联合播出。以个人成长、情感体验、背景故事与传世佳作相结合的方式，选用精美的文字，用最平实的情感读出文字背后的价值，节目旨 在实现文化感染人、鼓舞人、教育人的传导作用，展现有血有肉的真实人物情感。\n《朗读者》邀请各个领域具有影响力的嘉宾来到现场，分享自己的人生故事并倾情演绎来自朗读者文学顾问团的国家顶级文学家、出版人、专家、学者精心挑选的经典美文，最终节目将会呈现出生命之美、文学之美和情感之美。\n《朗读者》是著名节目主持人董卿20多年电视经验的一次全情绽放，她不仅担纲节目的主持工作，还首次以制作人的身份转型大型电视节目的幕后制作，呈现出不同于以往主持人的另一面。董卿表示《朗读者》中的“朗读”二字重文字，“者”字重人。我们要展现有血有肉的真实人物情感，并感动于他们让观众遇见了大千世界。", "脱口秀", 2788, "↑"],
        [2, "吐槽大会", "由腾讯视频、上海笑果文化传媒有限公司联合出品的喜剧脱口秀《吐槽大会》将于2017年1月8日起每周日晚在腾讯视频上线播出。“吐槽是门手艺，笑对需要勇气”，和传统喜剧节目最大的不同是，《吐槽大会》以网络独有的“吐槽文化”为切入点，每一期节目都会邀请一位话题名人，让他们接受吐槽和自嘲。光鲜亮丽的名人遭遇群嘲的场面实属罕见，也吊足观众胃口。", "脱口秀", 1992, "↓"],
        [3, "向往的生活", "大型生活服务纪实节目《向往的生活》中黄磊与何炅首度荧屏合体，他们一个最适合做美食节目的男人和一个最适合做治愈节目的男人，外加音乐才子刘宪华，三人一起守拙归田园，将为观众们带来一幅“自力更生，自给自足，反映待 客之道”的生活画面。", "真人秀", 1986, "↓"],
        [4, "跨界歌王 第一季", "《跨界歌王》 是北京电视台倾全台之力重磅推出的首档大型明星跨界音乐节目，将于2016年5月28日开始，在北京卫视每周六21:18播出。《跨界歌王》旨在突破固有的娱乐边界，汇集了活跃在影视、娱乐等领域的众多重量级当红明星。他们在各自的领域成就斐然，却都曾拥有音乐的梦想。在《跨界歌王》的舞台上，他们将重拾音乐之梦，展现鲜为人知且令观众惊艳的音乐才华，争夺年度“跨界歌王”的殊荣。", "音乐 真人秀", 741, "↓"],
        [5, "歌手", "《歌手2017》前身为《我是歌手》，引进自韩国MBC电视台歌手竞赛节目。\n2016年12月14日，湖南卫视公布官方消息，王牌音乐节目《我是歌手》确定更名为《歌手》，并换档至周六晚22：30播出。据了解，更名后的《歌手》是有别于《我是歌手》的全新音乐节目，虽然依旧主打专业实力歌手间的同台比拼，但在整体面貌上有所革新，仅赛制方面就变为期期有淘汰，更有往年《我是歌手》的实力唱将回归，邀请嘉宾的标准也从此前的“立足华语乐坛，放眼全亚洲”拓宽到世界范围，目前有国际唱将正在敲定中。", "音乐 真人秀", 1696, "↓"],
        [6, "快乐大本营", "《快乐大本营》是本土制造的综艺先锋，以“清新、青春、快乐、激情、八卦、生活”的娱乐风格在中国电视娱乐版图迅速卡位，其带动的明星效应和倡导的快乐理念至今生命力不减，十几年来已融为中国青少年文化的一部分，并为湖南卫视打造成中国第一电视娱乐品牌定下基调。不仅是湖南卫视一直保持至今的品牌节目，也是中国电视界综艺娱乐节目的领头羊；同时也是中国最有影响力的娱乐节目之一甚至成为中国亿万观众娱乐生活的一部分。娱乐圈内的知名艺人几乎都曾经登上过《快乐大本营》的舞台，留下属于他们的精彩瞬间。《快乐大本营》新创意的主题性综艺节目，为普通观众或草根团体及组合打造了一个展现个性的“全民娱乐”平台和分享快乐的机会，同时也极力为电视机前的观众推介时尚、新奇的文艺表演形式，传递“快乐至上”的娱乐精神，突出了以观众为主体的“娱乐天下”的节目理念。", "脱口秀", 1526, "↓"],
        [7, "最强大脑 第四季", "《最强大脑》是江苏卫视借鉴德国节目《Super Brain》推出的国内首档大型科学类真人秀节目，是专注于传播脑科学知识和脑力竞技的节目。\n2016年12月5日，《最强大脑》第四季节目组宣布，将引入“人机大战”模式，百度研发的人工智能机器人“小度”将作为特别选手参赛，与人类“最强大脑”现场对决。", "真人秀", 722, "↓"],
        [8, "欢乐喜剧人 第二季", "经过上一季的惨烈搏杀，沈腾所率领的欢乐麻花团队最终击败宋小宝、贾玲、乔杉、修睿等一众强劲对手，摘得喜剧之王的桂冠。携着第一季的良好口碑，欢乐喜剧人第二季隆重登场。此次王宁和艾伦代表麻花继续出战，辽宁军团则有小沈阳的东北F4和宋晓峰的MP3前仆后继，大潘、佳佳顶住尴尬冲锋陷阵，贱萌岳云鹏和孙越领军德云社杀入重围，港台一方则请到赵正平以及香港喜剧宗师詹瑞文。比赛期间，更有白凯南、秦昊甚至潘长江、苑琼丹乱入战局。而主持人方面，郭德纲代替吴秀波更令场面异常火爆。\n升级版的欢乐喜剧人，精彩继续！©豆瓣", "真人秀", 2790, "↓"],
        [9, "王牌对王牌 第二季", "《王牌对王牌第二季》是浙江卫视推出的大型原创室内竞技真人秀节目，由浙江卫视节目中心制作。节目共12期。节目主持人为沈涛，宋茜担任固定王牌特工，王祖蓝、王源分任两队王牌队长。", "真人秀", 610, "↓"],
        [10, "见字如面 第一季", "国内首档也是全屏唯一一档季播型书信朗读节目《见字如面》，由成功制作了“中国汉字听写大会“和中国成语大会”两档国民文化节目的国内顶尖视频创作团队实力文化制作。《见字如面》是一档以明星读信为主要形式的阅读推广季播节目，旨在用书信打开历史节点，带领观众走进那些依然鲜活的时代场 景、人生故事，去触碰那些依然可感的人物情状和社会风物，重新领会中国人的精神情怀与生活智慧。", "脱口秀", 4127, "↓"]
    ],
    [
        ["排行", "片名", "简介", "类型", "好评榜", "走势"],
        [1, "朗读者", "《朗读者》是中央电视台推出的大型文化情感类节目，著名节目主持人董卿首次担当制作人，央视创造传媒有限公司、中广天择传媒股份有限公司承担制作，于中央电视台综合频道与综艺频道黄金时间联合播出。以个人成长、情感体验、背景故事与传世佳作相结合的方式，选用精美的文字，用最平实的情感读出文字背后的价值，节目旨 在实现文化感染人、鼓舞人、教育人的传导作用，展现有血有肉的真实人物情感。\n《朗读者》邀请各个领域具有影响力的嘉宾来到现场，分享自己的人生故事并倾情演绎来自朗读者文学顾问团的国家顶级文学家、出版人、专家、学者精心挑选的经典美文，最终节目将会呈现出生命之美、文学之美和情感之美。\n《朗读者》是著名节目主持人董卿20多年电视经验的一次全情绽放，她不仅担纲节目的主持工作，还首次以制作人的身份转型大型电视节目的幕后制作，呈现出不同于以往主持人的另一面。董卿表示《朗读者》中的“朗读”二字重文字，“者”字重人。我们要展现有血有肉的真实人物情感，并感动于他们让观众遇见了大千世界。", "脱口秀", 2788, "↓"],
        [2, "奇葩大会", "《奇葩大会》将于2017年1月20日晚8：00在爱奇艺独家上线！作为“奇葩”系列节目之一，《奇葩大会》将打造一个史无前例的先锋青年观点集会，华人世界最先行、最勇敢、最新锐的青年聚集在这里，放肆分享，自由表达，带来自己最真实的生命体验和人生观点。《奇葩大会》由何炅、马东、蔡康永、高晓松担任导师，集结一大波老奇葩马薇薇、范湉湉、肖骁、颜如晶、姜思达、艾力、邱晨、大王、黄执中、李林、陈咏开、陈铭、董婧、欧阳超坐镇现场，李开复、李银河、贾伟等各界领袖人物悉数登场，导师与老奇葩们将在现场向杰出的分享者发出直通《奇葩说4》的诚意邀请，而选择权，在分享者手中，他们有权拒绝！", "脱口秀", 2821, "↑"],
        [3, "向往的生活", "大型生活服务纪实节目《向往的生活》中黄磊与何炅首度荧屏合体，他们一个最适合做美食节目的男人和一个最适合做治愈节目的男人，外加音乐才子刘宪华，三人一起守拙归田园，将为观众们带来一幅“自力更生，自给自足，反映待 客之道”的生活画面。", "真人秀", 1986, "↓"],
        [4, "中国诗词大会 第二季", "《中国诗词大会》（第二季）是科教频道自主研发的一档大型演播室季播节目。本节目以“赏中华诗词、寻文化基因、品生活之美”为宗旨，邀请全国各个年龄段、各个领域的诗词爱好者共同参与诗词知识比拼。", "真人秀", 2342, "↑"],
        [5, "奇葩说 第三季", "《奇葩说》是爱奇艺马东工作室打造的中国首档说话达人秀，由高晓松和蔡康永担任团长，旨在寻找华人华语世界中，观点独特、口才出众的 “最会说话的人”。", "脱口秀", 5777, "↓"],
        [6, "极限挑战 第二季", "《极限挑战第二季》是上海东方卫视推出的大型励志体验真人秀节目，节目共12期，第二季节目六位固定成员是黄渤、孙红雷、黄磊、罗志祥、王迅、张艺兴。\n《极限挑战第二季》每一期节目都围绕一个社会热点或时代背景而展开，节目中“极限男人帮”体验过出租车司机、家政服务等最平凡普通的职业；常走在城市街头，与普通百姓“亲密接触”，而路人们不再仅仅只是围观，也可能为节目的进展起到关键作用。\n节目于2016年4月17日起每周日晚21:00接档《欢乐喜剧人第二季》在东方卫视首播，24点优酷土豆独播。", "真人秀", 10435, "↑"],
        [7, "晓松奇谈", "《晓松奇谈》为一档周播文化类脱口秀节目，互联网脱口秀第一人高晓松的网络脱口秀节目。每集节目30分钟左右。\n由主讲人高晓松开谈天文地理，海外见闻，中西野史，并在节目中设置幽默动画版块以及网友互动环节，高晓松将在每期节目的末尾，回答网友的犀利提问。\n头发长可不一定见识短，四十载中西练达，谈天说地，无门无类，不偏不邪，笑对千金裘马，亦侃雪月风花。", "脱口秀", 1974, "↓"],
        [8, "明星大侦探 第一季", "《明星大侦探》作为中国首档明星推理综艺秀，节目创意源自韩国《犯罪现场》，内容包括“30%跌宕剧情+40%综艺搞笑+30%智能推理”，堪称综艺版的《唐人街探案》。韩国原版付费频道收视1.54%(收费频道VS普通频道收视比率为10倍)，受众集中为高知、高收入人群。超高收视、超高人气及好口碑让节目组对本土化悬疑推理大IP《明星大侦探》的播出信心满满。\n另外，从《神探夏洛克》、《心理罪》、《唐人街探案》等悬疑推理题材电视剧、电影的热播情况来看，一大波忠实“悬疑推理”粉丝基础，佐证了《明星大侦探》的巨大市场潜力。\n据了解，每期节目6位嘉宾参与，1人扮演侦探，5人为嫌疑人。每期节目解决1起不可思议的杀人事件，真凶就在嫌疑人之中。6位玩家需在现场6-8个场景内，寻找线索指认真凶!据悉，节目将在芒果TV和芒果直播APP平台播出，网友可以全程参与互动竞猜嫌疑人，还可点播回看精彩剧情。", "犯罪 悬疑 真人秀", 3833, "↑"],
        [9, "中国成语大会 第二季", "《中国成语大会》是继《中国汉字听写大会》之后，又一档重大影响力大型电视文化节目，于2014年4月18日起登陆央视。每周五晚20:00CCTV-10科教频道播出。是中央电视台2014年的重点节目，是实力传媒推出的第二档原创形态的电视节目创新品种。", "真人秀", 1285, "↑"]
    ]
]

var str = ['<li><span class="t-1">排行</span><span class="t-5">片名</span><span class="t-7">简介</span><span class="t-4">类型</span><span class="t-4">播放量</span><span class="t-6">走势</span></li>', '<li><span class="t-1">排行</span><span class="t-5">片名</span><span class="t-7">简介</span><span class="t-4">类型</span><span class="t-4">评论数</span><span class="t-6">走势</span></li>', '<li><span class="t-1">排行</span><span class="t-5">片名</span><span class="t-7">简介</span><span class="t-4">类型</span><span class="t-4">好评</span><span class="t-6">走势</span></li>', , ];
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
var ian = ia.length;
var chartdata = $('.chart-data');
var tabs = ['热播榜', '热议榜', '好评榜', '更新时间: 2017/02/23'];

$('.heading-inner').html('<h2 class="sec-title"> <span>综艺</span>排行榜</h2><p>' + tabs.join(' , ') + '</p>');

chartdata.find('.charts-kinds').find('a').html(tabs[0]);
for (var i = 1; i < ian; ++i) {
    chartdata.append('<ol class="chart-list j-for"></ol>').find('.charts-kinds').append('<a href="javascript:;"class="j-tab">' + tabs[i] + '<i class="ic i-selected"></i></a>');
}

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
for (var k = 0; k < ia.length; ++k) {
    var listr = str[k];
    for (var i = 0; i < ia[k].length; ++i) {
        var lilen = ia[k][0].length;
        if (i == 0) {
            var li0 = $(listr);
            for (var j = 0; j < lilen; ++j) {
                li0.find('span:nth-child(' + (j + 1) + ')').html(ia[k][0][j]);
            }
            $($('.chart-list')[k]).html(li0);
        } else {
            var li = $(listr);
            li.find('span:first-child').html('<i class="rank-' + ((ia[k][i][0] > 3) ? 'other' : 'T3') + '">' + ia[k][i][0] + '</i>');
            li.find('span:nth-child(2)').html('<a href="search.html?show/' + ia[k][i][1] + '" title="点击查看：' + ia[k][i][1] + '" target="_blank">' + ia[k][i][1] + '</a>');

            for (var j = 2; j < lilen; ++j) {
                li.find('span:nth-child(' + (j + 1) + ')').html(ia[k][i][j]);
            }
            var last = li.find('span:last-child').text();
            if (last == '↑' || last == '↓') {
                li.find('span:last-child').addClass((last == '↑') ? 'up' : 'down');
            }
            $($('.chart-list')[k]).append(li);
        }
    }
}
$('.j-tab').hover(function() {
    if ($(this).hasClass('selected')) {
        return false;
    }
    $(this).siblings().removeClass('selected').end().addClass('selected');
    $('.j-for').removeClass('selected').eq($(this).index()).addClass('selected');
});