
 var ia = [[["排行","片名","主演","地区","类型","昨日新增","走势"],[1,"蒲公英","山崎努 宫本信子 役所广司 大泷秀治 ","日本","喜剧",8634819,"↑"],[2,"越狱 第一季","温特沃斯·米勒 多米尼克·珀塞尔 彼得·斯特曼 阿莫里·诺拉斯科 ","美国","动作 犯罪 剧情",2813684,"↓"],[3,"神雕侠侣","古天乐 李若彤 李绮虹 张可颐 ","香港","爱情 武侠 古装",4064857,"↓"],[4,"芈月传","孙俪 黄轩 方中信 刘涛 ","中国大陆","剧情 古装",7460451,"↓"],[5,"大明王朝1566","陈宝国 黄志忠 倪大红 王庆祥 ","中国大陆","剧情 历史",4886115,"↑"],[6,"笑傲江湖","吕颂贤 梁艺龄 何宝生 陈少霞 ","香港","武侠 古装",9649757,"↓"],[7,"西部世界 第一季","埃文·蕾切尔·伍德 安东尼·霍普金斯 艾德·哈里斯 坦迪·牛顿 ","美国","科幻 西部",134889,"↓"],[8,"星光灿烂","范伟 郑奇 冯嘉怡 杨童舒 ","中国大陆","剧情",5041596,"↓"],[9,"盗墓笔记","井柏然 鹿晗 马思纯 王景春 ","中国大陆","悬疑 奇幻 冒险",8788550,"↑"],[10,"大唐荣耀","景甜 任嘉伦 万茜 舒畅 ","中国大陆","剧情 爱情 古装",8089142,"↑"]],[["排行","片名","上榜天数","最高排名","昨日新增","走势"],[1,"神探夏洛克 第四季","43天","Top0",1837681,"↑"],[2,"琅琊榜","13天","Top0",7632429,"↓"],[3,"STB超级教师","45天","Top0",1836200,"↑"],[4,"花千骨","29天","Top2",5504465,"↓"],[5,"三生三世十里桃花","1天","Top2",5180223,"↓"],[6,"伪装者","8天","Top2",8194296,"↑"],[7,"鬼吹灯之精绝古城","61天","Top0",4657821,"↓"],[8,"请回答1988","82天","Top3",3116677,"↑"],[9,"爱，来的刚好","99天","Top7",2656410,"↑"],[10,"云巅之上","43天","Top7",5305455,"↑"]],[["排行","片名","主演","地区","类型","评分"],[1,"锦绣未央","唐嫣 罗晋 吴建豪 毛晓彤 ","中国大陆","剧情 爱情 古装",4.8],[2,"余罪 第一季","张一山 吴优 常戎 张锦程 ","中国大陆","剧情 犯罪 悬疑",8.2],[3,"微微一笑很倾城","郑爽 杨洋 毛晓彤 白宇 ","中国大陆","剧情 爱情",6.3],[4,"欢乐颂","刘涛 蒋欣 王子文 杨紫 ","中国大陆","剧情 爱情",7.3],[5,"孤芳不自赏","钟汉良 杨颖 甘婷婷 孙艺洲 ","中国大陆","剧情 古装",3.6],[6,"那片星空那片海","冯绍峰 郭碧婷 王阳明 王萌黎 ","中国大陆","爱情 奇幻",3.4],[7,"择天记","鹿晗 娜扎 吴倩 曾舜晞 ","中国大陆","剧情 奇幻 古装",0],[8,"寻找前世之旅","付辛博 马可 周雨彤 那家威 ","中国大陆","剧情 奇幻",5.2],[9,"奇星记之鲜衣怒马少年时","吴磊 陈翔 郑合惠子 郝劭文 ","中国大陆","剧情 奇幻 古装",4.7],[10,"百思不得姐","孙雪宁 王燕阳 赵晖 张冬 ","中国大陆","喜剧 爱情 歌舞",0]]]

    var str = ['<li><span class="t-1">排行</span><span class="t-2">片名</span><span class="t-10">主演</span><span class="t-4">地区</span><span class="t-4">类型</span><span class="t-5">昨日新增</span><span class="t-6">走势</span></li>','<li><span class="t-1">排行</span><span class="t-2">片名</span><span class="t-3">上榜天数</span><span class="t-4">最高排名</span> <span class="t-5">昨日新增</span><span class="t-6">走势</span></li>','<li><span class="t-1">排行</span><span class="t-2">片名</span><span class="t-3">主演</span><span class="t-4">地区</span><span class="t-5">类型</span><span class="t-6">评分</span></li>'
    ];

    for (var k = 0; k < ia.length; ++k) {
        var listr = str[k];
        for (var i = 0; i < ia[k].length; ++i) {
            var lilen = ia[k][0].length;
            if (i == 0) {
                var li0 = $(listr);
                for (var j = 0; j < lilen; ++j) {
                    li0.find('span:nth-child(' + (j + 1) + ')').html(ia[k][0][j]);
                }
                $($('.chart-list')[k]).html(li0);
            } else {
                var li = $(listr);
                li.find('span:first-child').html('<i class="rank-' + ((ia[k][i][0] > 3) ? 'other' : 'T3') + '">' + ia[k][i][0] + '</i>');
                li.find('span:nth-child(2)').html('<a href="searchtv.html?' + ia[k][i][1] + '" title="点击查看：' + ia[k][i][1] + '" target="_blank">' + ia[k][i][1] + '</a>');

                for (var j = 2; j < lilen; ++j) {
                    li.find('span:nth-child(' + (j + 1) + ')').html(ia[k][i][j]);
                }
                var last = li.find('span:last-child').text();
                if (last == '↑' || last == '↓') {
                    li.find('span:last-child').addClass((last == '↑') ? 'up' : 'down');
                }
                $($('.chart-list')[k]).append(li);
            }
        }
    }
    