
 var infor = {"content":[{"name":"name","value":"七月与安生"},{"name":"导演","value":"曾国祥,"},{"name":"编剧","value":"林咏琛,李媛,许伊萌,吴楠,安妮宝贝,"},{"name":"主演","value":"周冬雨,马思纯,李程彬,李萍,蔡纲,蒙亭宜,沙全泽,姚欣言,李昊芳,蒋亭轩,"},{"name":"类型","value":"剧情,爱情,"},{"name":"上映日期","value":"2016-09-14(中国大陆),2016-10-27(香港),"},{"name":"summary","value":"七月（马思纯 饰）和安生（周冬雨 饰）的第一次相识在十三岁，她们一个是特立独行飞扬跋扈的“野孩子”，一个是单纯温婉循规蹈矩的“乖乖女”，从那一年开始，七月和安生几乎形影不离，她是她的光，她是她的影子，直到某一天，一位名为苏家明（李程彬 饰）的少年出现在了七月的身边，七月恋爱了。安生决定前往北京讨生活，临别之前，七月意外的发现苏家明贴身带着的玉佩，竟然出现在了安生的衣领里。安生走了，七月和苏家明的恋情持续着，他们考入了同一所大学，约定一毕业就结婚。可是，事情并没有像七月所想象的那样发展，而她和苏家明之间的关系，亦因为安生的归来而产生了新的变数。"},{"name":"评分","value":7.6},{"name":"image","value":"https://img3.doubanio.com/view/movie_poster_cover/lpst/public/p2378140502.jpg"},{"name":"id","value":"25827935"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [22371,23929,21925,20540,19966,20294,18492,12215,21218,21196,21784,20061,20127,18056,18178,17584,16223,17059,24121,24913,20041,16666,15182,13672,10299,9097,9721,9565,9385,10635,10126,8184,9630,9615,8153,7979,10886,9503,6336,5845,5954,7914,8366,9763,9868]
            }, ]
        };

        var word_list = [{"text":"细腻","weight":0.6264029843829317},{"text":"平淡","weight":0.042068008063687656},{"text":"善良","weight":0.5437045544802087},{"text":"沉闷","weight":0.6519151604085209},{"text":"惊悚","weight":0.26027667244554575},{"text":"焦虑","weight":0.39646796933350453},{"text":"伤害","weight":0.3735847473762437},{"text":"很小","weight":0.6028061765389846},{"text":"落后","weight":0.5619339528967585},{"text":"幽默","weight":0.19567729765062933},{"text":"微妙","weight":0.02034687771819061},{"text":"不安","weight":0.11221187559586956},{"text":"尊严","weight":0.30393822148765814},{"text":"平凡","weight":0.09569503199418648},{"text":"悲伤","weight":0.3180330038254665},{"text":"尊重","weight":0.17573293503385112},{"text":"完美","weight":0.3701087926870304},{"text":"羞耻","weight":0.19897376118703516},{"text":"歡喜","weight":0.24004268089336014},{"text":"细微","weight":0.3958684571988027},{"text":"隐晦","weight":0.32593668482672666},{"text":"幸福","weight":0.14483992064332907},{"text":"犀利","weight":0.2714524471694693},{"text":"模糊","weight":0.17707227637981693},{"text":"揪心","weight":0.31477703918840355},{"text":"琐碎","weight":0.16903104055708496},{"text":"扎实","weight":0.33674523578520316},{"text":"巧妙","weight":0.3595417547354569},{"text":"尴尬","weight":0.1483718421890519},{"text":"无聊","weight":0.0569942339866933},{"text":"可悲","weight":0.2817640481988829},{"text":"不急","weight":0.06924265673986413},{"text":"不慢","weight":0.24441442442723033},{"text":"有趣","weight":0.39570260944956126},{"text":"强大","weight":0.23714485846769412},{"text":"电影","weight":0.21426268652462943},{"text":"社会","weight":0.14981263904784686},{"text":"故事","weight":0.5012862637341323},{"text":"男主","weight":0.3106233663691742},{"text":"推销员","weight":0.09944843522584983},{"text":"困境","weight":0.2817987417858557},{"text":"妻子","weight":0.19505706357496608},{"text":"人性","weight":0.12249721888572138},{"text":"剧本","weight":0.1068136960324197},{"text":"剧情","weight":0.06818999087772483},{"text":"家庭","weight":0.19217266379044654},{"text":"戏中戏","weight":0.055969984789785245},{"text":"文化","weight":0.10915324251557286},{"text":"剧作","weight":0.03862700244787518},{"text":"关系","weight":0.09379567283983575},{"text":"现实","weight":0.22493118183206254},{"text":"女性","weight":0.19314189009446808},{"text":"宗教","weight":0.19399294416654236},{"text":"情感","weight":0.16914321464530027},{"text":"角色","weight":0.024557763447550937},{"text":"老头","weight":0.16389296727525993},{"text":"结尾","weight":0.04213952219420192},{"text":"人物","weight":0.20194108320677137},{"text":"互文","weight":0.09560729266468782},{"text":"戏剧","weight":0.10485374607552951},{"text":"细节","weight":0.09740945261323189},{"text":"影片","weight":0.15249658129745816},{"text":"观众","weight":0.19157385036565625},{"text":"情绪","weight":0.021691593220127783},{"text":"事件","weight":0.03422969616548274},{"text":"演员","weight":0.1420755375325442},{"text":"镜头","weight":0.10566149721502073},{"text":"精彩","weight":0.11191489163262254},{"text":"情节","weight":0.07379926351785056},{"text":"丈夫","weight":0.021378363135394547},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        