
 var infor = {"content":[{"name":"name","value":"乐高蝙蝠侠大电影"},{"name":"导演","value":"克里斯·麦凯,"},{"name":"编剧","value":"赛斯·格雷厄姆-史密斯,克里斯·麦克纳,埃里克·萨默斯,贾里德·斯特恩,约翰·惠廷顿,鲍勃·凯恩,比尔·芬格,杰里·西格尔,乔·舒斯特,"},{"name":"主演","value":"威尔·阿奈特,罗莎里奥·道森,拉尔夫·费因斯,迈克尔·塞拉,扎克·加利凡纳基斯,珍妮·斯蕾特,玛丽亚·凯莉,查宁·塔图姆,乔纳·希尔,亚当·德维尼,柯南·奥布莱恩,杰森·曼兹沃克斯,艾迪·伊扎德,赛斯·格林,佐伊·克罗维兹,凯特 米库契,瑞琪·琳德赫姆,杰梅奈·克莱门特,艾丽·坎伯尔,"},{"name":"类型","value":"喜剧,动作,动画,冒险,"},{"name":"上映日期","value":"2017-03-03(中国大陆),2017-02-10(美国),"},{"name":"summary","value":"蝙蝠侠（威尔·阿奈特 Will Arnett 配音）一边要阻止小丑（扎克·加利凡纳基斯 Zach Galifianakis 配音）犯罪，一边要抚养罗宾（迈克尔·塞拉 Michael Cera 配音）长大，而且，为了保护哥谭市的安全，蝙蝠侠不得不从一个独行侠，变成善于“团队合作”的城市警察。"},{"name":"评分","value":8.2},{"name":"image","value":"https://img3.doubanio.com/view/movie_poster_cover/lpst/public/p2417949761.jpg"},{"name":"id","value":"26145033"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [654,659,652,681,4563,45056,28925,5926,7554,11168,4905,5968,6006,7068,11566,3369,4604,5203,4899,4857,9329,6990,10576,7212,6495,12055,9247,8755,7879,6785,6140,8825,6370,14603,8062,12742,7484,0,10887,14441,22969,38056,120892,224828,65186]
            }, ]
        };

        var word_list = [{"text":"乐高","weight":2.294736802447722},{"text":"欢乐","weight":0.7684787477934928},{"text":"不错","weight":0.605848696409851},{"text":"恶搞","weight":0.2116506765343692},{"text":"无聊","weight":0.26859817279476567},{"text":"惊喜","weight":0.5694444930882394},{"text":"有趣","weight":0.4807711481803343},{"text":"孤独","weight":0.10630915868633363},{"text":"轻松","weight":0.006039591548480421},{"text":"意外","weight":0.364093227932537},{"text":"幽默","weight":0.24586545133714624},{"text":"自大","weight":0.11164451118652878},{"text":"紧凑","weight":0.23022020138833407},{"text":"幼稚","weight":0.0014732216867628875},{"text":"炫酷","weight":0.1695667240250189},{"text":"完整","weight":0.11512312808523825},{"text":"孤僻","weight":0.3308728938783144},{"text":"不熟","weight":0.2483340542431281},{"text":"神奇","weight":0.20909334584618694},{"text":"深感","weight":0.06482466364735025},{"text":"幸福","weight":0.19675089324838876},{"text":"好困","weight":0.18716316510695374},{"text":"嘴硬","weight":0.18987634879014},{"text":"心软","weight":0.26040762536064654},{"text":"蛮酷","weight":0.15762227889561387},{"text":"很大","weight":0.09410067196271055},{"text":"美好","weight":0.11057929805113487},{"text":"隽永","weight":0.14068968667974593},{"text":"良心","weight":0.058406979461492044},{"text":"太乱","weight":0.1967434382305366},{"text":"美妙","weight":0.2927115010056574},{"text":"激烈","weight":0.1410064272572641},{"text":"悲喜","weight":0.1949432580341359},{"text":"忧乐","weight":0.10560864134263612},{"text":"尊重","weight":0.2596350641140705},{"text":"电影","weight":1.258136350616771},{"text":"蝙蝠侠","weight":0.18029883440549263},{"text":"老爷","weight":0.5907703260794638},{"text":"笑点","weight":0.11828933359188161},{"text":"剧情","weight":0.24383929777292193},{"text":"故事","weight":0.15114151625125455},{"text":"动画","weight":0.16973895847051992},{"text":"动画片","weight":0.2369072881914872},{"text":"全程","weight":0.10173945341539584},{"text":"积木","weight":0.05647622632293895},{"text":"世界","weight":0.03744677321751106},{"text":"配音","weight":0.061557194441131405},{"text":"角色","weight":0.08308001028478582},{"text":"画面","weight":0.023522692655694583},{"text":"台词","weight":0.023782645741218224},{"text":"超人","weight":0.16557158026617966},{"text":"彩蛋","weight":0.020201688753559262},{"text":"电影院","weight":0.06522626172796675},{"text":"真人","weight":0.017240593858202674},{"text":"玩梗","weight":0.05590668935659095},{"text":"玩具","weight":0.0034212167695307216},{"text":"节奏","weight":0.029278453836656743},{"text":"密集","weight":0.05296225993954589},{"text":"伏地","weight":0.027059902349528},{"text":"蝙蝠","weight":0.024266832561083945},{"text":"经典","weight":0.043829347234852746},{"text":"人物","weight":0.08485091325271657},{"text":"风格","weight":0.020384732818483117},{"text":"家庭","weight":0.09038139607397724},{"text":"主题","weight":0.03913597168160433},{"text":"感情","weight":0.08723672702330006},{"text":"官方","weight":0.0589736744031101},{"text":"版权","weight":0.07514102482382369},{"text":"孩子","weight":0.0073342816587549705},{"text":"爆米花","weight":0.05463069806850304},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        