
 var infor = {"content":[{"name":"name","value":"八月"},{"name":"导演","value":"张大磊,"},{"name":"编剧","value":"张大磊,"},{"name":"主演","value":"孔维一,张晨,郭燕芸,"},{"name":"类型","value":"剧情,"},{"name":"上映日期","value":"2017-03-24(中国大陆),2016-07-23(FIRST青年影展),"},{"name":"summary","value":"九十年代初的西部小城，结束了小升初考试的晓雷终于迎来了盼望已久的没有作业的暑假。然而这个自由的，炎热的夏天并不是想象中那样红火热烈，更多是平常反复的家庭生活和大把闲工夫⋯⋯恰逢那一年国家开始实施国有单位转型，铁饭碗被打破，晓雷父亲的单位也受到改革冲击，他们生活的家属院里每一个家庭的生活都被改革影响着。孩子们整日百无聊赖，而看似平静的大人们，心却像烈日炙烤着那般燥热。晓雷就那么静静的耗着，感受着身边隐隐发生的一切。直到父亲为了生活同其他人远走他乡，家里只剩下了母子俩，晓雷才着实感觉到时间过去了，生活不一样了。立秋那天夜里，晓雷家的昙花在院子里悄然开放，像是意味着什么⋯⋯"},{"name":"评分","value":7.3},{"name":"image","value":"https://img3.doubanio.com/view/movie_poster_cover/lpst/public/p2435823620.jpg"},{"name":"id","value":"26820836"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [893,709,757,696,737,605,648,495,612,589,604,644,736,744,889,791,783,824,876,1060,1027,1144,940,1175,954,856,873,993,896,896,902,864,979,1034,977,993,1026,1011,972,1271,1369,1214,1208,1084,1127]
            }, ]
        };

        var word_list = [{"text":"温和","weight":0.5146235549273324},{"text":"平淡","weight":0.6820166745486943},{"text":"诚实","weight":0.10019899555197272},{"text":"成熟","weight":1.0636300886243946},{"text":"不错","weight":0.6598653017815728},{"text":"优异","weight":0.3236478160396652},{"text":"散淡","weight":0.2949277230424755},{"text":"完整","weight":0.3018880183638788},{"text":"淳朴","weight":0.665622830713806},{"text":"美好","weight":0.5244889884864051},{"text":"巧妙","weight":0.7199758132737272},{"text":"野蛮","weight":0.5580403036823691},{"text":"残忍","weight":0.5368008997505138},{"text":"生硬","weight":0.10939760824449753},{"text":"脆弱","weight":0.11987379345639758},{"text":"固执","weight":0.23471990315320332},{"text":"舒服","weight":0.4026018254963475},{"text":"细腻","weight":0.7148027753948706},{"text":"怪异","weight":0.3030960418142486},{"text":"浅显","weight":0.636175637624294},{"text":"简便","weight":0.36955334248250893},{"text":"沉闷","weight":0.12425945129691365},{"text":"成效","weight":0.562410838796974},{"text":"平缓","weight":0.3078968009682284},{"text":"炎热","weight":0.026402714872899555},{"text":"简洁","weight":0.23977065450577667},{"text":"炙热","weight":0.5104535833628263},{"text":"稳定","weight":0.6671254054943654},{"text":"娴熟","weight":0.2403702749130706},{"text":"孤独","weight":0.36128391487279493},{"text":"衰老","weight":0.27219615754240317},{"text":"琐碎","weight":0.483079513822648},{"text":"平静","weight":0.17955486366820472},{"text":"流畅","weight":0.5595833336072573},{"text":"聪明","weight":0.1720942798210309},{"text":"电影","weight":0.09804746033344129},{"text":"时代","weight":0.5754488516810544},{"text":"父亲","weight":0.46788556710858964},{"text":"记忆","weight":0.26588464879129503},{"text":"故事","weight":0.22941508499385865},{"text":"情感","weight":0.24907708018062744},{"text":"小时候","weight":0.2970826985648792},{"text":"视角","weight":0.30127997047483956},{"text":"演员","weight":0.29032774529817695},{"text":"小孩","weight":0.20748253681889034},{"text":"镜头","weight":0.13298847820032836},{"text":"声音","weight":0.2201778647047055},{"text":"细节","weight":0.08154870088770692},{"text":"时间","weight":0.19992537942729705},{"text":"剪辑","weight":0.14490028794017434},{"text":"孩子","weight":0.03477600429723046},{"text":"家庭","weight":0.24958173051629015},{"text":"影片","weight":0.03929787062356399},{"text":"历史","weight":0.19663972484670725},{"text":"摄影","weight":0.2149933699336629},{"text":"孩童","weight":0.14633253737186752},{"text":"散文","weight":0.0642219290751626},{"text":"昙花","weight":0.21579784232032292},{"text":"爸爸","weight":0.02435315282829752},{"text":"符号","weight":0.09416796684626737},{"text":"母亲","weight":0.13185951920844616},{"text":"地方","weight":0.15502721536195116},{"text":"人物","weight":0.16789689342812042},{"text":"制片厂","weight":0.1896823823773802},{"text":"现实","weight":0.0356066406483472},{"text":"诗意","weight":0.047096697057651855},{"text":"世界","weight":0.03710242493160585},{"text":"父辈","weight":0.0017127135147697564},{"text":"质感","weight":0.09487340741745956},{"text":"媽媽","weight":0.12234864422751839},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        