
 var infor = {"content":[{"name":"name","value":"功夫瑜伽"},{"name":"导演","value":"唐季礼,"},{"name":"编剧","value":"唐季礼,"},{"name":"主演","value":"成龙,李治廷,张艺兴,索努·苏德,母其弥雅,迪莎·帕塔尼,艾米拉·达斯特,尚语贤,姜雯,张国立,伊利亚娜·狄克鲁兹,"},{"name":"类型","value":"喜剧,动作,冒险,"},{"name":"上映日期","value":"2017-01-28(中国大陆),"},{"name":"summary","value":"考古学教授Jack（成龙 饰）多年没有踏出学校，校长和学生都对他添油加醋的历史半信半疑。一次授课后，一个印度女孩找到Jack，用一张千年地图吸引了Jack的目光。于是Jack和挚友的儿子李琼斯（李治廷 饰）、助教小光（张艺兴 饰）组成“寻宝小分队”，为“神秘宝石”展开冒险，在迪拜和土豪飙车，在冰岛潜入神秘冰穴，在印度大战土狼，和印度贵族斗舞，动作喜剧再升级，打笑全世界。"},{"name":"评分","value":5.3},{"name":"image","value":"https://img1.doubanio.com/view/movie_poster_cover/lpst/public/p2412371389.jpg"},{"name":"id","value":"26182910"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [28725,30533,33234,28681,25330,31222,33355,39250,218542,245344,240279,250591,252959,237556,229950,207606,198449,165924,143948,129518,108884,102718,98343,85312,63844,69032,60439,53769,53789,60287,57608,41806,40737,39375,37859,35937,43154,39899,26697,24283,25353,24544,27415,32856,33345]
            }, ]
        };

        var word_list = [{"text":"特效","weight":0.5862876192723334},{"text":"尴尬","weight":1.1053316917334992},{"text":"不错","weight":0.5886423894645298},{"text":"惊喜","weight":0.20516303578186104},{"text":"欢乐","weight":0.48031120278817674},{"text":"热闹","weight":0.15309921580169766},{"text":"轻松","weight":0.30453286956849634},{"text":"肤浅","weight":0.2549558556986897},{"text":"心疼","weight":0.2902446820625154},{"text":"凶猛","weight":0.07829505880731384},{"text":"彪悍","weight":0.04025941223515298},{"text":"生猛","weight":0.1803911602722676},{"text":"不宜","weight":0.11736463627094096},{"text":"青涩","weight":0.22574555904765406},{"text":"友好","weight":0.36919483077274257},{"text":"紧张","weight":0.07647263178009128},{"text":"妥妥","weight":0.3329068113473213},{"text":"紧凑","weight":0.32775520255411117},{"text":"亲切","weight":0.3521832667922317},{"text":"真诚","weight":0.02490878264175842},{"text":"虔诚","weight":0.11566556059253418},{"text":"太美","weight":0.0418350630672128},{"text":"著實","weight":0.36814649542411637},{"text":"尷尬","weight":0.1784934527311416},{"text":"憋气","weight":0.35992136274205827},{"text":"一星","weight":0.02621632710182823},{"text":"柔韧","weight":0.10033301387880426},{"text":"宏伟","weight":0.15269243186635212},{"text":"奢华","weight":0.08179709511271696},{"text":"簡單","weight":0.021930349828294362},{"text":"很重","weight":0.2432289412361257},{"text":"充满","weight":0.136371746078118},{"text":"绚丽","weight":0.05876027306525629},{"text":"简单","weight":0.14918698280770798},{"text":"生硬","weight":0.20441131153740177},{"text":"电影","weight":0.45918780536308856},{"text":"剧情","weight":0.42016921055787576},{"text":"大哥","weight":0.20610954742318263},{"text":"神话","weight":0.3312519047402294},{"text":"瑜伽","weight":0.15844350474593855},{"text":"动作","weight":0.13455331971733306},{"text":"故事","weight":0.25255078336792686},{"text":"功夫","weight":0.23103038305366214},{"text":"狮子","weight":0.23781078996755936},{"text":"美女","weight":0.06358111076359639},{"text":"喜剧","weight":0.13902798507441022},{"text":"笑点","weight":0.16581799285610543},{"text":"歌舞","weight":0.20513041049833194},{"text":"套路","weight":0.1996915565651304},{"text":"演员","weight":0.17291850585977878},{"text":"贺岁片","weight":0.06056114308485713},{"text":"结尾","weight":0.12147029268380143},{"text":"鲜肉","weight":0.030271180005585256},{"text":"舞蹈","weight":0.029838697279907452},{"text":"台词","weight":0.13989296895912798},{"text":"身材","weight":0.025413915728296273},{"text":"情节","weight":0.09667398277063284},{"text":"演技","weight":0.014982828808351108},{"text":"逻辑","weight":0.02088501347062458},{"text":"角色","weight":0.03850474185437302},{"text":"电影院","weight":0.0027068729799321627},{"text":"观众","weight":0.11775666280485694},{"text":"动物","weight":0.0815196598488566},{"text":"全程","weight":0.05060273563679541},{"text":"风格","weight":0.07804790214080173},{"text":"颜值","weight":0.052981402024887415},{"text":"影院","weight":0.06841389284489985},{"text":"影片","weight":0.08876397384486079},{"text":"观影","weight":0.058668013643640785},{"text":"镜头","weight":0.08320349163441373},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        