
 var infor = {"content":[{"name":"name","value":"月光男孩"},{"name":"导演","value":"巴里·詹金斯,"},{"name":"编剧","value":"巴里·詹金斯,塔瑞尔·麦卡尼,"},{"name":"主演","value":"崔凡特·罗兹,安德烈·霍兰,马赫沙拉·阿里,娜奥米·哈里斯,加奈儿·梦奈,艾什顿·桑德斯,贾雷尔·杰罗姆,艾利克斯·希伯特,杰登·派纳,段·桑德森,艾德森·吉恩,斯蒂芬·布隆,"},{"name":"类型","value":"剧情,同性,"},{"name":"上映日期","value":"2016-09-02(特柳赖德电影节),2016-09-10(多伦多电影节),2016-10-21(美国),"},{"name":"summary","value":"奇伦（艾什顿·桑德斯 Ashton Sanders 饰）的母亲宝拉（娜奥米·哈里斯 Naomie Harris 饰）吸毒成瘾根本无心照顾孩子，奇伦从小在孤独中长大，因为过于瘦小的身材而时常遭到周围人的欺侮和作弄。一次偶然中，奇伦结识了毒贩胡安（马赫沙拉·阿里 Maher shala Ali 饰），从此，胡安和其女友特蕾莎（加奈儿·梦奈 Janelle Monae 饰）的住处成为了奇伦的第二个家。凯文（贾雷尔·杰罗姆 Jharrel Jerome 饰）是奇伦唯一的朋友，随着时间的推移，两人之间的感情渐渐超越了友谊。然而，为了隐藏自己的性取向，凯文不得不在同伴的怂恿下对奇伦大打出手，之后，两人再也没有见过面。一晃眼多年过去，奇伦忽然接到了凯文打来的电话，两人终于决定正视各自心中真正的感情。"},{"name":"评分","value":7.2},{"name":"image","value":"https://img3.doubanio.com/view/movie_poster_cover/lpst/public/p2373594741.jpg"},{"name":"id","value":"26648249"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [2124,2479,1878,2015,2112,3389,2568,1812,1866,1959,1895,1987,1884,1837,1837,1813,1848,2080,1978,1925,1886,1830,1800,1833,1752,1758,1908,2135,2426,2456,2470,3231,3176,3169,3122,3720,4670,5753,166304,78990,38729,25983,21349,22125,19546]
            }, ]
        };

        var word_list = [{"text":"细腻","weight":1.4530234358601493},{"text":"温柔","weight":0.5377860561490683},{"text":"清新","weight":0.8202116264228796},{"text":"敏感","weight":0.7143023249775173},{"text":"平淡","weight":0.2663365284673925},{"text":"脆弱","weight":0.3625350859531753},{"text":"美好","weight":0.3458509880160917},{"text":"悲伤","weight":0.18292940646263453},{"text":"孤独","weight":0.44278075154215},{"text":"简单","weight":0.09630668793769065},{"text":"很好","weight":0.23743128862804228},{"text":"不错","weight":0.06590696802158078},{"text":"沉闷","weight":0.3076411221068997},{"text":"曖昧","weight":0.3221547126711642},{"text":"炽热","weight":0.2925584729135918},{"text":"紧张","weight":0.18823012653334278},{"text":"深沉","weight":0.018172443833171705},{"text":"不安","weight":0.22321493797500133},{"text":"害羞","weight":0.17975679751960272},{"text":"很淡","weight":0.31534139300492536},{"text":"勇敢","weight":0.32426352144099624},{"text":"强壮","weight":0.14648646827304218},{"text":"简洁","weight":0.11787592257220497},{"text":"善良","weight":0.24930397269332713},{"text":"沉默","weight":0.09321695380606451},{"text":"很小","weight":0.18912615011940567},{"text":"柔软","weight":0.026745394180369763},{"text":"聪明","weight":0.1614514832198004},{"text":"单靠","weight":0.13001896202987107},{"text":"伤害","weight":0.19195802013950186},{"text":"惊喜","weight":0.10204345904774441},{"text":"意外","weight":0.07995717807454619},{"text":"单薄","weight":0.004903487450816076},{"text":"清晰","weight":0.06440895574723585},{"text":"平庸","weight":0.182710853975902},{"text":"电影","weight":0.5789755330713893},{"text":"黑人","weight":0.25602476913504096},{"text":"故事","weight":0.570223281494946},{"text":"月光","weight":0.39879443131193393},{"text":"男孩","weight":0.20894953741560457},{"text":"镜头","weight":0.07055571760314305},{"text":"情感","weight":0.27667832661625086},{"text":"题材","weight":0.03400738577024937},{"text":"种族","weight":0.14936433433770113},{"text":"同性","weight":0.07082191333316523},{"text":"人生","weight":0.011746477110089772},{"text":"男主","weight":0.02226524460754909},{"text":"政治","weight":0.010828754587740233},{"text":"主角","weight":0.13589230541467753},{"text":"剧情","weight":0.02961561830295585},{"text":"影片","weight":0.061436466184622174},{"text":"内心","weight":0.06285029805070728},{"text":"蓝色","weight":0.16343870806641037},{"text":"摄影","weight":0.17415652437654672},{"text":"三段式","weight":0.19494602456250065},{"text":"节奏","weight":0.10332039230449376},{"text":"同志","weight":0.10712790494555836},{"text":"演员","weight":0.01667996974401894},{"text":"社会","weight":0.0026906954344983933},{"text":"人物","weight":0.08496635318866164},{"text":"毒品","weight":0.00297540607485862},{"text":"爱情","weight":0.15607774766567617},{"text":"最佳影片","weight":0.10965939077489273},{"text":"风格","weight":0.017104260600694962},{"text":"眼神","weight":0.09182827346394173},{"text":"文艺","weight":0.1387743275606018},{"text":"男人","weight":0.1162285826300172},{"text":"感情","weight":0.12888819760015136},{"text":"一个男孩","weight":0.1343347930818033},{"text":"全片","weight":0.1186826147812922},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        