var infor = { "content": [{ "name": "name", "value": "朗读者" }, { "name": "导演", "value": "史蒂芬·戴德利" }, { "name": "编剧", "value": "戴维·黑尔" }, { "name": "主演", "value": null }, { "name": "类型", "value": "剧情,爱情," }, { "name": "上映日期", "value": "2008-12-10(纽约首映)" }, { "name": "summary", "value": "15岁的少年米夏·伯格（大卫·克劳斯 David Kross 饰）偶遇36岁的中年神秘女列车售票员汉娜（凯特·温丝莱特 Kate Winslet 饰），后来两个发展出一段秘密的情人关系。汉娜最喜欢躺在米夏怀里听米夏为他读书，她总是沉浸在那朗朗的读书声中。年轻的米夏沉溺于这种关系不能自拔的同时，却发现他自己根本不了解汉娜。忽然有一天，这个神秘女人不告而别，米夏在短暂的迷惑和悲伤之后，开始了新的生活。二战虽然结束了，但德国对于纳粹战犯的审判还在继续。成为法律学校的实习生的米夏，在一次旁听对纳粹战犯的审判过程中，竟然发现一个熟悉的身影。虽然已经事隔8年，但米夏还是一眼便认出那就是消失8年的汉娜。而这一次，她坐上了纳粹战犯审判法庭的被告席，这个神秘女人的往事在案件的审理过程中逐渐清晰。然而，米夏却发现了一个汉娜宁愿搭上性命也要隐藏秘密。汉娜最终被判终身监..." }, { "name": "评分", "value": 8.5 }, { "name": "image", "value": "https://img1.doubanio.com/view/movie_poster_cover/lpst/public/p1140984198.jpg" }, { "name": "id", "value": "2213597" }] }

var bar_stack_option = {
    title: {
        x: 'left'
    },
    tooltip: {
        trigger: 'axis',
        axisPointer: { // 坐标轴指示器，坐标轴触发有效
            type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
        }
    },
    legend: {
        data: ['热度变化', '百度指数', '评论数']
    },
    grid: {
        left: '3%',
        right: '4%',
        bottom: '3%',
        containLabel: true
    },
    xAxis: [{
        type: 'category',
        data: ['2017-01-20', '2017-01-21', '2017-01-22', '2017-01-23', '2017-01-24', '2017-01-25', '2017-01-26', '2017-01-27', '2017-01-28', '2017-01-29', '2017-01-30', '2017-01-31', '2017-02-01', '2017-02-02', '2017-02-03', '2017-02-04', '2017-02-05', '2017-02-06', '2017-02-07', '2017-02-08', '2017-02-09', '2017-02-10', '2017-02-11', '2017-02-12', '2017-02-13', '2017-02-14', '2017-02-15', '2017-02-16', '2017-02-17', '2017-02-18', '2017-02-19', '2017-02-20', '2017-02-21', '2017-02-22', '2017-02-23', '2017-02-24', '2017-02-25', '2017-02-26', '2017-02-27', '2017-02-28', '2017-03-01']
    }],
    yAxis: [{
        name: '热度',
        type: 'value',
    }, {
        name: '评论数',
        type: 'value',
    }, {
        name: '百度指数',
        type: 'value',
        offset: 65
    }],
    series: [{
        name: '热度变化',
        type: 'line',
        data: [3898.2, 5972.9, 6539.0, 7285.2, 7706.9, 8606.3, 9112.5, 7997.5, 5177.8, 5150.5, 3700.9, 3295.5, 3023.2, 2737.1, 3727.9, 6218.4, 4915.5, 1988.2, 1811.4, 1680.2, 1435.6, 1246.6, 2410.7, 2085.0, 822.0, 819.7, 737.0]
    }, {
        name: '评论数',
        type: 'line',
        yAxisIndex: 1,
        data: [2674, 4782, 5896, 6898, 7041, 7486, 7498, 7276, 6100, 4179, 3155, 2571, 2257, 1930, 2019, 3200, 3087, 1853, 1318, 1193, 985, 884, 1071, 1009, 878, 704, 213]
    }, {
        name: '百度指数',
        type: 'line',
        yAxisIndex: 2,
        data: [5213, 2904, 1510, 1479, 1404, 1326, 2276, 1323, 1410, 1342, 1507, 1448, 1454, 1493, 1500, 2086, 1782, 1495, 1587, 1759, 1710, 1602, 1500, 1577, 1547, 428, 97567, 110321, 132232, 244929, 210181, 135026, 152097, 159909, 179789, 214181, 298472, 237092, 139372, 133535, 132470]
    }, ]
};

var word_list = [{ "text": "不错", "weight": 0.01214946867225019 }, { "text": "惊喜", "weight": 0.01104100167328003 }, { "text": "温柔", "weight": 0.010586579487726865 }, { "text": "舒服", "weight": 0.009989459871543498 }, { "text": "很棒", "weight": 0.00963601867981032 }, { "text": "简单", "weight": 0.009615077684923158 }, { "text": "有趣", "weight": 0.008479205939521808 }, { "text": "幽默", "weight": 0.008151498824733917 }, { "text": "风靡", "weight": 0.008151498824733917 }, { "text": "坚韧", "weight": 0.008151498824733917 }, { "text": "惊艳", "weight": 0.007731031271960948 }, { "text": "真挚", "weight": 0.007258842556802745 }, { "text": "淳厚", "weight": 0.007258842556802745 }, { "text": "激动", "weight": 0.007258842556802745 }, { "text": "欣喜", "weight": 0.007258842556802745 }, { "text": "一星", "weight": 0.007258842556802745 }, { "text": "平和", "weight": 0.006871385006590386 }, { "text": "真诚", "weight": 0.006871385006590386 }, { "text": "愉悦", "weight": 0.006867429577780833 }, { "text": "平实", "weight": 0.0066874458261044 }, { "text": "美好", "weight": 0.006418253724672276 }, { "text": "诙谐", "weight": 0.0061926971505094994 }, { "text": "生硬", "weight": 0.006106397940045175 }, { "text": "一大", "weight": 0.006106397940045175 }, { "text": "平淡", "weight": 0.0060799076032955895 }, { "text": "节目", "weight": 0.023575373684006983 }, { "text": "主持人", "weight": 0.014337386701517055 }, { "text": "书信", "weight": 0.013697394566388634 }, { "text": "读信", "weight": 0.008570005345488482 }, { "text": "历史", "weight": 0.008059264303472624 }, { "text": "老师", "weight": 0.007786036570810163 }];


///////////////////////////////////////////////////////////////////////

$('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
for (var i = 0; i < infor.content.length; ++i) {
    if (infor.content[i].name === 'summary') {
        $('.intro').html(infor.content[i].value);
    } else if (infor.content[i].name === 'id') {
        continue;
    } else if (infor.content[i].name === 'image') {
        $('.product-image-large img').attr('src', infor.content[i].value);
    } else if (infor.content[i].name === 'name') {
        $('.section-breadcrumbs h1').html(infor.content[i].value);
        $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
    } else {
        if (infor.content[i].value != null)
            $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
    }
}


var tab1 = document.getElementById('tab1');
var bar_dom = document.getElementById('bar_dom');

echarts.init(bar_dom).setOption(bar_stack_option, true);
$('#key_dom').jQCloud(word_list);

function randomData() {
    return Math.round(Math.random() * 1000);
}