var infor = { "content": [{ "name": "name", "value": "爱乐之城" }, { "name": "导演", "value": "达米恩·查泽雷" }, { "name": "编剧", "value": "达米恩·查泽雷" }, { "name": "主演", "value": "瑞恩·高斯林 / 艾玛·斯通 / 约翰·传奇 / 罗丝玛丽·德薇特 / 芬·维特洛克" }, { "name": "类型", "value": "剧情,爱情,歌舞," }, { "name": "上映日期", "value": "2017-02-14(中国大陆)" }, { "name": "summary", "value": "米娅（艾玛·斯通 Emma Stone 饰）渴望成为一名演员，但至今她仍旧只是片场咖啡厅里的一名平凡的咖啡师，尽管不停的参加着大大小小的试镜，但米娅收获的只有失败。某日，在一场派对之中，米娅邂逅了名为塞巴斯汀（瑞恩·高斯林 Ryan Gosling 饰）的男子，起初两人之间产生了小小的矛盾，但很快，米娅便被塞巴斯汀身上闪耀的才华以及他对爵士乐的纯粹追求所吸引，最终两人走到了一起。在塞巴斯汀的鼓励下，米娅辞掉了咖啡厅的工作，专心为自己写起了剧本，与此同时，塞巴斯汀为了获得一份稳定的收入，加入了一支流行爵士乐队，开始演奏自己并不喜欢的现代爵士乐，没想到一炮而红。随着时间的推移，努力追求梦想的两人，彼此之间的距离却越来越远，在理想和感情之间，他们必须做出选择。" }, { "name": "评分", "value": 8.5 }, { "name": "image", "value": "https://img3.doubanio.com/view/movie_poster_cover/lpst/public/p2425658570.jpg" }, { "name": "id", "value": "25934014" }] }

var bar_stack_option = {
    title: {
        x: 'left'
    },
    tooltip: {
        trigger: 'axis',
        axisPointer: { // 坐标轴指示器，坐标轴触发有效
            type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
        }
    },
    legend: {
        data: ['热度变化', '百度指数', '评论数']
    },
    grid: {
        left: '3%',
        right: '4%',
        bottom: '3%',
        containLabel: true
    },
    xAxis: [{
        type: 'category',
        data: ['2017-01-20', '2017-01-21', '2017-01-22', '2017-01-23', '2017-01-24', '2017-01-25', '2017-01-26', '2017-01-27', '2017-01-28', '2017-01-29', '2017-01-30', '2017-01-31', '2017-02-01', '2017-02-02', '2017-02-03', '2017-02-04', '2017-02-05', '2017-02-06', '2017-02-07', '2017-02-08', '2017-02-09', '2017-02-10', '2017-02-11', '2017-02-12', '2017-02-13', '2017-02-14', '2017-02-15', '2017-02-16', '2017-02-17', '2017-02-18', '2017-02-19', '2017-02-20', '2017-02-21', '2017-02-22', '2017-02-23', '2017-02-24', '2017-02-25', '2017-02-26', '2017-02-27', '2017-02-28', '2017-03-01', '2017-03-02', '2017-03-03', '2017-03-04', '2017-03-05']
    }],
    yAxis: [{
        name: '热度',
        type: 'value',
    }, {
        name: '评论数',
        type: 'value',
    }, {
        name: '百度指数',
        type: 'value',
        offset: 65
    }],
    series: [{
        name: '热度变化',
        type: 'line',
        data: []
    }, {
        name: '评论数',
        type: 'line',
        yAxisIndex: 1,
        data: []
    }, {
        name: '百度指数',
        type: 'line',
        yAxisIndex: 2,
        data: [6121, 6791, 7616, 7477, 12796, 26987, 16031, 8283, 11974, 11632, 11802, 10991, 12948, 14695, 14772, 15291, 16254, 17173, 18815, 26338, 24568, 34357, 92766, 75401, 88214, 286319, 200176, 134039, 140914, 163786, 157218, 98312, 77303, 69236, 61614, 63133, 73717, 67343, 195420, 106348, 69440, 54731, 49533, 55745, 46850]
    }, ]
};

var word_list = [{ "text": "浪漫", "weight": 1.1065651906832648 }, { "text": "美好", "weight": 0.7239999169079662 }, { "text": "遗憾", "weight": 0.8779518838779561 }, { "text": "完美", "weight": 0.22630106535745412 }, { "text": "尴尬", "weight": 0.39077837520896297 }, { "text": "简单", "weight": 0.3218828373300938 }, { "text": "充满", "weight": 0.14093938125642116 }, { "text": "成功", "weight": 0.34765828681610395 }, { "text": "精致", "weight": 0.002171771214960857 }, { "text": "悲伤", "weight": 0.07693603184699829 }, { "text": "甜蜜", "weight": 0.12350793647804872 }, { "text": "不错", "weight": 0.08558029316451708 }, { "text": "幸福", "weight": 0.15447844378089676 }, { "text": "欢快", "weight": 0.08645531097333022 }, { "text": "平庸", "weight": 0.1288144970953794 }, { "text": "惊喜", "weight": 0.08881286176891162 }, { "text": "残酷", "weight": 0.012606505660497348 }, { "text": "温柔", "weight": 0.21266080684573585 }, { "text": "完整", "weight": 0.11541316744033343 }, { "text": "漂亮", "weight": 0.03057389753023693 }, { "text": "很美", "weight": 0.018981270214953657 }, { "text": "流畅", "weight": 0.19225732395190342 }, { "text": "珍惜", "weight": 0.19175087463401688 }, { "text": "孤独", "weight": 0.09541654502729277 }, { "text": "珍贵", "weight": 0.1556308896177558 }, { "text": "正好", "weight": 0.1355405868865718 }, { "text": "很棒", "weight": 0.10071449825883619 }, { "text": "俏皮", "weight": 0.01816992686021498 }, { "text": "愚蠢", "weight": 0.13814452546491662 }, { "text": "拖沓", "weight": 0.01391577386015857 }, { "text": "电影", "weight": 0.12648132688560842 }, { "text": "梦想", "weight": 0.3180295902140733 }, { "text": "爱情", "weight": 0.05989416746319901 }, { "text": "歌舞", "weight": 0.29627880576791893 }, { "text": "故事", "weight": 0.38625336786498793 }, { "text": "歌舞片", "weight": 0.24307118757901444 }, { "text": "音乐", "weight": 0.19103771481474852 }, { "text": "结尾", "weight": 0.05974354710600764 }, { "text": "现实", "weight": 0.020805033170891 }, { "text": "石头", "weight": 0.12496823174765566 }, { "text": "司令", "weight": 0.06072096235915596 }, { "text": "女主", "weight": 0.21205058557889692 }, { "text": "结局", "weight": 0.08044741692323794 }, { "text": "剧情", "weight": 0.16862702565137544 }, { "text": "人生", "weight": 0.06808899683549179 }, { "text": "男主", "weight": 0.030086358039303762 }, { "text": "爵士乐", "weight": 0.0639130217444232 }, { "text": "镜头", "weight": 0.11655629031034491 }, { "text": "爵士", "weight": 0.1583017571070126 }, { "text": "电影院", "weight": 0.06349862009461604 }, { "text": "舞蹈", "weight": 0.08877124702078831 }, { "text": "画面", "weight": 0.057468761573926344 }, { "text": "演员", "weight": 0.07003303935894276 }, { "text": "男女", "weight": 0.08449648474465153 }, { "text": "理想", "weight": 0.08683895964928207 }, { "text": "长镜头", "weight": 0.01338474741553552 }, { "text": "观众", "weight": 0.04133419473197594 }, { "text": "世界", "weight": 0.036697540890591025 }, { "text": "场景", "weight": 0.057300230655197175 }, { "text": "感情", "weight": 0.08267590462874715 }, { "text": "", "weight": null }];


///////////////////////////////////////////////////////////////////////

$('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
for (var i = 0; i < infor.content.length; ++i) {
    if (infor.content[i].name === 'summary') {
        $('.intro').html(infor.content[i].value);
    } else if (infor.content[i].name === 'id') {
        continue;
    } else if (infor.content[i].name === 'image') {
        $('.product-image-large img').attr('src', infor.content[i].value);
    } else if (infor.content[i].name === 'name') {
        $('.section-breadcrumbs h1').html(infor.content[i].value);
        $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
    } else {
        if (infor.content[i].value != null)
            $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
    }
}


var tab1 = document.getElementById('tab1');
var bar_dom = document.getElementById('bar_dom');

echarts.init(bar_dom).setOption(bar_stack_option, true);
$('#key_dom').jQCloud(word_list);

function randomData() {
    return Math.round(Math.random() * 1000);
}