
 var infor = {"content":[{"name":"name","value":"疯狂动物城"},{"name":"导演","value":"拜伦·霍华德,瑞奇·摩尔,杰拉德·布什,"},{"name":"编剧","value":"拜伦·霍华德,瑞奇·摩尔,杰拉德·布什,吉姆·里尔顿,乔西·特立尼达,菲尔·约翰斯顿,珍妮弗·李,"},{"name":"主演","value":"金妮弗·古德温,杰森·贝特曼,伊德里斯·艾尔巴,珍妮·斯蕾特,内特·托伦斯,邦尼·亨特,唐·雷克,汤米·钟,J·K·西蒙斯,奥克塔维亚·斯宾瑟,艾伦·图代克,夏奇拉,雷蒙德·S·佩尔西,德拉·萨巴,莫里斯·拉马奇,菲尔·约翰斯顿,约翰·迪·玛吉欧,凯蒂·洛斯,吉塔·雷迪,杰西·科尔蒂,汤米·利斯特,乔希·达拉斯,瑞奇·摩尔,凯特·索西,彼得·曼斯布里奇,拜伦·霍华德,杰拉德·布什,马克·史密斯,乔西·特立尼达,约翰·拉维尔,克里斯汀·贝尔,吉尔·科德斯,梅利莎·古德温,"},{"name":"类型","value":"喜剧,动作,动画,冒险,"},{"name":"上映日期","value":"2016-03-04(中国大陆/美国),"},{"name":"summary","value":"故事发生在一个所有哺乳类动物和谐共存的美好世界中，兔子朱迪（金妮弗·古德温 Ginnifer Goodwin 配音）从小就梦想着能够成为一名惩恶扬善的刑警，凭借着智慧和努力，朱迪成功的从警校中毕业进入了疯狂动物城警察局，殊不知这里是大型肉食类动物的领地，作为第一只，也是唯一的小型食草类动物，朱迪会遇到怎样的故事呢？近日里，城中接连发生动物失踪案件，就在全部警员都致力于调查案件真相之时，朱迪却被局长（伊德瑞斯·艾尔巴 Idris Elba 配音）发配成为了一名无足轻重的交警。某日，正在执勤的兔子遇见了名为尼克（杰森·贝特曼 Jason Bateman 配音）的狐狸，两人不打不相识，之后又误打误撞的接受了寻找失踪的水獭先生的任务，如果不能在两天之内找到水獭先生，朱迪就必须自愿离开警局。朱迪找到了尼克，两人联手揭露了一个隐藏在疯狂动物城之中的惊天秘密。"},{"name":"评分","value":9.2},{"name":"image","value":"https://img1.doubanio.com/view/movie_poster_cover/lpst/public/p2315672647.jpg"},{"name":"id","value":"25662329"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [16986,17262,17185,16861,16695,17157,17385,15124,18660,18410,17825,17785,17634,17297,17125,16514,16554,15892,16349,17077,15804,15969,16325,13512,10126,9850,9600,9963,11754,14820,14277,10520,10762,10752,10200,11731,16010,14977,17841,12558,11382,10800,12567,17588,16351]
            }, ]
        };

        var word_list = [{"text":"有趣","weight":0.4412360147877867},{"text":"简单","weight":0.5379121837247117},{"text":"充满","weight":0.08120623759145881},{"text":"幽默","weight":0.5808143687558881},{"text":"聪明","weight":0.06751976825853777},{"text":"惊喜","weight":0.537061044147102},{"text":"美好","weight":0.2255478123463147},{"text":"疯狂","weight":0.23758451660309254},{"text":"优秀","weight":0.4913268796308342},{"text":"平等","weight":0.3110052154177533},{"text":"扎实","weight":0.37745617413365523},{"text":"敏感","weight":0.2417991616692845},{"text":"惊人","weight":0.2495747374065839},{"text":"和谐","weight":0.0014569544288747106},{"text":"邪恶","weight":0.41181835611234335},{"text":"细思","weight":0.33009903228550486},{"text":"狡猾","weight":0.23625217609885196},{"text":"完整","weight":0.3269786627687436},{"text":"恶搞","weight":0.03120420359923936},{"text":"无聊","weight":0.3908012692330551},{"text":"精致","weight":0.06620924795294643},{"text":"完美","weight":0.07100121223796035},{"text":"巧妙","weight":0.36014074288207465},{"text":"高矮","weight":0.23467213884874497},{"text":"惊险","weight":0.18098269282457113},{"text":"善良","weight":0.23724759192805153},{"text":"成熟","weight":0.2910456916233593},{"text":"欢乐","weight":0.23087794842562054},{"text":"甜甜","weight":0.0501801664471452},{"text":"遗憾","weight":0.20955229735849226},{"text":"微妙","weight":0.2187467789809861},{"text":"厉害","weight":0.10533034508192662},{"text":"愉悦","weight":0.048763863667181086},{"text":"铮铮","weight":0.27884584126992845},{"text":"绚丽","weight":0.004058515588066727},{"text":"动物","weight":0.3239919004587888},{"text":"动画","weight":0.30124749346579044},{"text":"狐狸","weight":0.4560382512546495},{"text":"电影","weight":0.20351943290243518},{"text":"树懒","weight":0.13318442471242223},{"text":"故事","weight":0.1863169825415835},{"text":"动画片","weight":0.2476454448743416},{"text":"兔子","weight":0.2710672951438478},{"text":"政治","weight":0.3381585559446807},{"text":"社会","weight":0.20334459430680657},{"text":"细节","weight":0.1086321698678641},{"text":"世界","weight":0.21533328479401967},{"text":"种族","weight":0.21532934327060252},{"text":"角色","weight":0.20466685151510178},{"text":"教父","weight":0.07381382413064322},{"text":"剧情","weight":0.10631406683401964},{"text":"现实","weight":0.17190138077393788},{"text":"笑点","weight":0.10647399320303065},{"text":"主题","weight":0.049913336520764635},{"text":"成人","weight":0.026548784832906885},{"text":"隐喻","weight":0.0822200522311223},{"text":"励志","weight":0.1301806542855312},{"text":"梦想","weight":0.08249527449081163},{"text":"主角","weight":0.13372888162483246},{"text":"人物","weight":0.02952355426400753},{"text":"人类","weight":0.10490424136316713},{"text":"精彩","weight":0.0005124608498852885},{"text":"孩子","weight":0.0711480420339163},{"text":"动画电影","weight":0.08172446247440669},{"text":"影片","weight":0.027723034510897346},{"text":"地方","weight":0.004985943839000435},{"text":"剧本","weight":0.004591065974110424},{"text":"童话","weight":0.10036830494178986},{"text":"观众","weight":0.0036550351809019653},{"text":"配音","weight":0.04772076203875488},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
              }
        