
 var infor = {"content":[{"name":"name","value":"罗曼蒂克消亡史"},{"name":"导演","value":"程耳"},{"name":"编剧","value":"程耳"},{"name":"主演","value":null},{"name":"类型","value":"剧情,动作,悬疑,"},{"name":"上映日期","value":"2016-12-16(中国大陆)"},{"name":"summary","value":"他一直拖到一九四九年五月初才坐上去香港的轮船，算得上真正的末班车。没有人知道他在拖什么或等待什么，我想他自己也未必知道，不过是下意识的拖延。不久他就死在香港，死前再没有值得记述的事件或说过的话，他基本没再说话，这没什么可奇怪的，一切都不值一提，他终于走向自己的沉默。上世纪30年代的上海，叱咤风云的帮派大佬，不甘寂寞的交际花，说着地道上海话的日本妹夫，只收交通费的杀手，被冷落却忠诚的姨太太，外表光鲜的电影皇后，深宅大院里深不可测的管家，偶尔偷腥的电影皇帝，荷尔蒙满溢大脑的帮派小弟，一心想要破处的处男，善良的妓女，随波逐流的明星丈夫，投靠日本人的帮派二哥，日理万机却抽空恋爱的戴先生。战争之下，繁华落尽。帮派大佬逃亡香港，交际花不知所踪，日本妹夫死在上海，电影皇后被丈夫抛弃，处男遇上妓女，姨太太杀死二哥。战争惨烈，战争终于结束。他轻易选择沉默，因为伤口..."},{"name":"评分","value":7.7},{"name":"image","value":"https://img1.doubanio.com/view/movie_poster_cover/lpst/public/p2404553168.jpg"},{"name":"id","value":"24751763"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [8440,10039,8436,7276,7259,6958,7535,4859,8222,8738,8836,8065,8409,8936,8935,8552,7998,7030,7877,7360,6285,6589,6383,6786,5385,5764,5967,5990,6419,7535,7173,5961,6904,82238,184910,157604,142339,126153,72080,58249,57614,50779,51982,60349,58827]
            }, ]
        };

        var word_list = [{"text":"细腻","weight":0.35947419539772263},{"text":"平淡","weight":0.7980453161851424},{"text":"善良","weight":0.7094147527774107},{"text":"沉闷","weight":0.6814636009836478},{"text":"惊悚","weight":0.4262276335527005},{"text":"焦虑","weight":0.12616953036222048},{"text":"伤害","weight":0.1959020052165178},{"text":"很小","weight":0.40311848060703753},{"text":"落后","weight":0.19938474257520666},{"text":"幽默","weight":0.1696927532851295},{"text":"微妙","weight":0.08557675419454742},{"text":"不安","weight":0.4282630458488423},{"text":"尊严","weight":0.2399404344601991},{"text":"平凡","weight":0.05785106141244613},{"text":"悲伤","weight":0.19688717689989912},{"text":"尊重","weight":0.32871462695839715},{"text":"完美","weight":0.17513993112296147},{"text":"羞耻","weight":0.01697245234980263},{"text":"歡喜","weight":0.36744584765845784},{"text":"细微","weight":0.2719616447260285},{"text":"隐晦","weight":0.10202565604765111},{"text":"幸福","weight":0.25702922608573875},{"text":"犀利","weight":0.1930823640047088},{"text":"模糊","weight":0.28159936579022327},{"text":"揪心","weight":0.17464476327650363},{"text":"琐碎","weight":0.20909216449618848},{"text":"扎实","weight":0.2611191529120639},{"text":"巧妙","weight":0.2503706398842586},{"text":"尴尬","weight":0.24182599224919465},{"text":"无聊","weight":0.10313306275404942},{"text":"可悲","weight":0.2533041677828249},{"text":"不急","weight":0.09189653978609709},{"text":"不慢","weight":0.15498847391079482},{"text":"有趣","weight":0.2701922844122504},{"text":"强大","weight":0.016351639591805873},{"text":"电影","weight":0.04211680536263857},{"text":"社会","weight":0.4102512317592062},{"text":"故事","weight":0.29472278708890975},{"text":"男主","weight":0.14240393337557403},{"text":"推销员","weight":0.21332597840705686},{"text":"困境","weight":0.19808398969165625},{"text":"妻子","weight":0.06952474917740852},{"text":"人性","weight":0.05749109217523534},{"text":"剧本","weight":0.15074992226382},{"text":"剧情","weight":0.11743607158693317},{"text":"家庭","weight":0.20867603162253318},{"text":"戏中戏","weight":0.2507123833082173},{"text":"文化","weight":0.2244294949900864},{"text":"剧作","weight":0.13312678854971563},{"text":"关系","weight":0.14363542030836904},{"text":"现实","weight":0.10704818251881333},{"text":"女性","weight":0.03526195039367232},{"text":"宗教","weight":0.07114187580582558},{"text":"情感","weight":0.04712592702204706},{"text":"角色","weight":0.03398532083438089},{"text":"老头","weight":0.18912241659805037},{"text":"结尾","weight":0.12942614492684398},{"text":"人物","weight":0.04930771373966054},{"text":"互文","weight":0.1378883496968955},{"text":"戏剧","weight":0.0986883423718403},{"text":"细节","weight":0.11422605591329514},{"text":"影片","weight":0.17466884768412458},{"text":"观众","weight":0.07824262826054397},{"text":"情绪","weight":0.040799455238704825},{"text":"事件","weight":0.15773844265697506},{"text":"演员","weight":0.016242860215688455},{"text":"镜头","weight":0.1574007664477784},{"text":"精彩","weight":0.0026055318983753684},{"text":"情节","weight":0.044154562004514536},{"text":"丈夫","weight":0.07141911174072592},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        