
 var infor = {"content":[{"name":"name","value":"西游伏妖篇"},{"name":"导演","value":"徐克,"},{"name":"编剧","value":"周星驰,李思臻,"},{"name":"主演","value":"吴亦凡,林更新,姚晨,林允,包贝尔,巴特尔,杨一威,大鹏,王丽坤,汪铎,张美娥,"},{"name":"类型","value":"喜剧,动作,奇幻,古装,"},{"name":"上映日期","value":"2017-01-28(中国大陆),"},{"name":"summary","value":"电影《西游伏妖篇》作为2013年周星驰导演电影《西游降魔篇》的后继故事，讲述了唐三藏（吴亦凡 饰）在上集感化了杀死段小姐的齐天大圣（林更新 饰），并收其为徒后，带着孙悟空、猪八戒（杨一威&汪铎 饰）及沙僧（巴特尔 饰），师徒一行四人踏上西天取经之旅。路途凶险，除魔伏妖，师徒四人也在取经的过程中有了各自的成长与改变。"},{"name":"评分","value":5.8},{"name":"image","value":"https://img3.doubanio.com/view/movie_poster_cover/lpst/public/p2411953504.jpg"},{"name":"id","value":"25801066"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [30025,37060,44540,37636,43744,41713,47068,65498,655781,622859,494228,415909,365263,325340,296933,260068,228392,193722,167253,153662,135654,126453,114443,102159,90712,84803,78242,67441,67525,77109,72400,54873,52401,50884,48227,48899,56124,52448,36036,32752,35184,34458,38903,50296,47399]
            }, ]
        };

        var word_list = [{"text":"特效","weight":0.5303214321866826},{"text":"尴尬","weight":0.28255780221940263},{"text":"不错","weight":0.45809472282190944},{"text":"惊喜","weight":0.2898428422150742},{"text":"丑陋","weight":0.22859503238138987},{"text":"残暴","weight":0.33327244025682184},{"text":"血腥","weight":0.21090545494778767},{"text":"惊人","weight":0.12345151593749107},{"text":"意外","weight":0.01662486201945625},{"text":"僵硬","weight":0.14169202519647517},{"text":"优秀","weight":0.20883127150717293},{"text":"简单","weight":0.06753111576393539},{"text":"生硬","weight":0.06919878437547984},{"text":"出奇","weight":0.14381586373747066},{"text":"很大","weight":0.06550527726822757},{"text":"惊艳","weight":0.2048176951111092},{"text":"恐怖","weight":0.1515609311071695},{"text":"典殊","weight":0.10220944667248781},{"text":"愉快","weight":0.13949274981244952},{"text":"混乱","weight":0.027005362928127257},{"text":"独特","weight":0.0033078193510842784},{"text":"奇异","weight":0.07495998288653553},{"text":"低俗","weight":0.02552511094258062},{"text":"恶劣","weight":0.00702181734426594},{"text":"妖艳","weight":0.10217840849115974},{"text":"恐极","weight":0.02874380184951147},{"text":"肮脏","weight":0.084717552643988},{"text":"暴躁","weight":0.21985502467875082},{"text":"顽劣","weight":0.21979811565785598},{"text":"遗憾","weight":0.13744388332855637},{"text":"细思","weight":0.21874932007861805},{"text":"轻松","weight":0.24839361986717312},{"text":"怪戾","weight":0.009156763730346976},{"text":"贫乏","weight":0.09200364827267406},{"text":"著名","weight":0.22709103491287252},{"text":"电影","weight":0.8284738921007553},{"text":"星爷","weight":0.12447635543246019},{"text":"演技","weight":0.12781793328874572},{"text":"故事","weight":0.0999328674847727},{"text":"剧情","weight":0.1323367671331353},{"text":"演员","weight":0.10766123997508258},{"text":"台词","weight":0.032008123830849236},{"text":"红孩儿","weight":0.17827211889053987},{"text":"猴子","weight":0.18166907812006025},{"text":"想象力","weight":0.012219898302579581},{"text":"笑点","weight":0.1561685665129959},{"text":"西游记","weight":0.14945983851225866},{"text":"观众","weight":0.17684058505962086},{"text":"角色","weight":0.09811188013469314},{"text":"造型","weight":0.004860318957366188},{"text":"情怀","weight":0.17426538198192348},{"text":"悟空","weight":0.04228716165666003},{"text":"喜剧","weight":0.10320006408872383},{"text":"风格","weight":0.08733686418142145},{"text":"师徒","weight":0.02410157979569724},{"text":"经典","weight":0.018233718799050586},{"text":"特技","weight":0.07100072833120118},{"text":"大话西游","weight":0.003210193711352476},{"text":"蜘蛛","weight":0.09184242873069369},{"text":"烂片","weight":0.10734137633599605},{"text":"世界","weight":0.020882003381161515},{"text":"降魔","weight":0.10338513853331867},{"text":"美术","weight":0.10327539107176291},{"text":"八戒","weight":0.09717996473655603},{"text":"套路","weight":0.05785564971546954},{"text":"天马行空","weight":0.02059970934317857},{"text":"画面","weight":0.09286866430025814},{"text":"爱情","weight":0.04078145644858376},{"text":"彩蛋","weight":0.059796505248815496},{"text":"恶心","weight":0.03909601068946599},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        