
 var infor = {"content":[{"name":"name","value":"驴得水"},{"name":"导演","value":"周申,刘露,"},{"name":"编剧","value":"周申,刘露,"},{"name":"主演","value":"任素汐,大力,刘帅良,裴魁山,阿如那,韩彦博,卜冠今,王堃,高阳,苏千越,查尔斯·亚瑟,王峰,"},{"name":"类型","value":"剧情,喜剧,"},{"name":"上映日期","value":"2016-10-28(中国大陆),"},{"name":"summary","value":"一群“品行不端”却怀揣教育梦想的大学教师，从大城市来到偏远乡村开办了一所小学校。学校待遇惨淡、生活艰苦，但老师们都自得其乐，每天嘻嘻哈哈打成一片。然而教育部特派员要来突击检查的消息打破了安宁，因为学校有一位“驴得水老师”隐藏着不可告人的秘密。就在所有人都担心丑事即将败露的时候，一个神奇天才的出现拯救了大家，然而谁能料到真正的麻烦才刚刚开始……"},{"name":"评分","value":8.3},{"name":"image","value":"https://img3.doubanio.com/view/movie_poster_cover/lpst/public/p2393044761.jpg"},{"name":"id","value":"25921812"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [21192,23032,21523,20609,19754,21472,21071,13856,24874,26454,25695,25524,25648,25569,24427,23714,25560,21127,20770,20041,18645,17906,17222,16988,13545,30445,36637,37252,46883,50556,44420,30721,29272,29378,27573,26912,30551,31931,22309,18849,18645,18753,19200,23185,24949]
            }, ]
        };

        var word_list = [{"text":"荒诞","weight":0.232180241557096},{"text":"一曼","weight":0.009644285243719068},{"text":"不错","weight":0.11969924224315152},{"text":"有趣","weight":0.3199953781388107},{"text":"美好","weight":0.5818769661752942},{"text":"自由","weight":0.4834561755668632},{"text":"漂亮","weight":0.07573445961255462},{"text":"尴尬","weight":0.055708639828301564},{"text":"丑陋","weight":0.08467898199571433},{"text":"软弱","weight":0.09481503363982242},{"text":"贪婪","weight":0.0732108165722994},{"text":"阴暗","weight":0.009967504101531435},{"text":"简单","weight":0.23046007465763152},{"text":"自私","weight":0.27122806055006893},{"text":"充满","weight":0.38525429121111227},{"text":"舒服","weight":0.23292949251552303},{"text":"精巧","weight":0.1298504390587067},{"text":"悲恐","weight":0.3556012313667587},{"text":"幽默","weight":0.18999728193706492},{"text":"轻松","weight":0.012846061209790743},{"text":"伤害","weight":0.14684157376046336},{"text":"惊喜","weight":0.07184566939798602},{"text":"心疼","weight":0.30957896463848106},{"text":"惊艳","weight":0.03370758379895413},{"text":"完好","weight":0.3057038775050894},{"text":"疯狂","weight":0.26959749699690455},{"text":"鲜明","weight":0.12376870371999912},{"text":"独特","weight":0.1535167362539242},{"text":"优秀","weight":0.17016366164241403},{"text":"淳朴","weight":0.2604980390485094},{"text":"紧凑","weight":0.006481133413423555},{"text":"严肃","weight":0.24300773042079474},{"text":"烦恼","weight":0.04824344356343166},{"text":"年轻","weight":0.24033224788481874},{"text":"险恶","weight":0.013495275350135106},{"text":"电影","weight":0.22937987641791704},{"text":"话剧","weight":0.775787957076002},{"text":"喜剧","weight":0.46419695749470385},{"text":"演员","weight":0.20211273591965195},{"text":"人性","weight":0.20514105819039993},{"text":"故事","weight":0.31286907174353384},{"text":"人物","weight":0.23525742075620498},{"text":"剧情","weight":0.20154665040636113},{"text":"舞台剧","weight":0.09279390083573684},{"text":"角色","weight":0.10929227129806018},{"text":"悲剧","weight":0.24947832463150307},{"text":"剧本","weight":0.002039986563021383},{"text":"现实","weight":0.08604647229005476},{"text":"校长","weight":0.17248910212637694},{"text":"一曼","weight":0.11134244548546605},{"text":"铜匠","weight":0.01051373301332378},{"text":"社会","weight":0.06448542887521078},{"text":"结局","weight":0.05486252503338228},{"text":"国产","weight":0.05442825399157705},{"text":"知识分子","weight":0.016474174174730856},{"text":"女性","weight":0.012784220609967777},{"text":"麻花","weight":0.05190127166403816},{"text":"演技","weight":0.1037147920254731},{"text":"镜头","weight":0.006034507328210729},{"text":"女主","weight":0.06542338985046274},{"text":"背景","weight":0.10190602496644692},{"text":"民国","weight":0.05607662789205801},{"text":"结尾","weight":0.006422183530211348},{"text":"影片","weight":0.09963699181940415},{"text":"国产电影","weight":0.04107228438871779},{"text":"场景","weight":0.08287099009329103},{"text":"刻画","weight":0.08052884057308544},{"text":"内容","weight":0.06198013906542432},{"text":"作品","weight":0.09413705130886797},{"text":"情节","weight":0.06919839979654357},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        