
 var infor = {"content":[{"name":"name","value":"一条狗的使命"},{"name":"导演","value":"拉斯·霍尔斯道姆,"},{"name":"编剧","value":"W·布鲁斯·卡梅伦,凯瑟琳·迈克,奥黛丽·威尔斯,玛雅·福布斯,沃利·亚历斯戴尔,"},{"name":"主演","value":"布丽特·罗伯森,丹尼斯·奎德,佩吉·利普顿,乔什·加德,K·J·阿帕,布莱斯·吉扎尔,朱丽叶·瑞兰斯,卢克·科比 ,加布里埃尔·罗斯,迈克尔·博夫舍维尔,洛根·米勒,柯比·豪厄-尔巴普蒂斯特,普奇·豪尔,约翰·奥提兹,妮科尔·勒普拉卡,彼特·科拉米斯,卡罗琳·凯芙,简·迈克格雷格,科维西·阿梅扬,卡琳·博姆拜克,娜奥米·弗伦内特,"},{"name":"类型","value":"剧情,喜剧,冒险,"},{"name":"上映日期","value":"2017-03-03(中国大陆),2017-01-27(美国),"},{"name":"summary","value":"影片以汪星人的视角展现狗狗和人类的微妙情感，一只狗狗陪伴小主人长大成人，甚至为他追到了女朋友，后来它年迈死去又转世投胎变成其他性别和类型的汪，第二次轮回狗狗变成了警犬威风凛凛，再次转轮回，又成了陪伴一位单身女青年的小柯基犬。在经历了多次轮回之后，最终回到最初的主人身边。"},{"name":"评分","value":7.9},{"name":"image","value":"https://img1.doubanio.com/view/movie_poster_cover/lpst/public/p2432493858.jpg"},{"name":"id","value":"6873143"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [1380,1192,996,1276,1012,1042,916,959,1331,1312,1483,1380,1385,1777,2388,2182,2122,1839,1820,1882,1813,1772,1512,1615,1688,1782,1817,1767,2309,2440,2329,2339,3933,3504,3723,7105,8467,7971,9253,28252,41854,103625,151063,136903]
            }, ]
        };

        var word_list = [{"text":"孤独","weight":0.368877236618705},{"text":"简单","weight":0.2734552437908468},{"text":"快乐","weight":0.7959826372610119},{"text":"无聊","weight":0.8688369542195374},{"text":"圆满","weight":0.7084261468303835},{"text":"幸福","weight":0.6049562654095851},{"text":"轻松","weight":0.5724411778560498},{"text":"不错","weight":0.4342624849055993},{"text":"遗憾","weight":0.3051234238251365},{"text":"有趣","weight":0.37180047455140447},{"text":"厉害","weight":0.20528723846994593},{"text":"幼稚","weight":0.22493463150142426},{"text":"最怕","weight":0.16081068810133414},{"text":"愉快","weight":0.35696848234023276},{"text":"平庸","weight":0.11908044546995607},{"text":"细微","weight":0.1801356264687723},{"text":"善良","weight":0.18872188975150214},{"text":"温柔","weight":0.2708948460555699},{"text":"自由","weight":0.39435792608616405},{"text":"好奇","weight":0.26287463298524144},{"text":"纯真","weight":0.10700715855608962},{"text":"热爱","weight":0.07491268315308218},{"text":"愚蠢","weight":0.40199756064582914},{"text":"矫情","weight":0.12909786466600792},{"text":"幸运","weight":0.4544085059273679},{"text":"伤害","weight":0.4036566952131259},{"text":"混乱","weight":0.1364115326232365},{"text":"平常","weight":0.41216746324924364},{"text":"笨拙","weight":0.19859310002845254},{"text":"粗心","weight":0.37979034384413607},{"text":"甜蜜","weight":0.22325660142414963},{"text":"苦涩","weight":0.3128525577090799},{"text":"平等","weight":0.44356364057617803},{"text":"稀松","weight":0.21571812630191964},{"text":"纤细","weight":0.3244319153392572},{"text":"狗狗","weight":1.0204905237069277},{"text":"电影","weight":0.2452913865200004},{"text":"故事","weight":0.7277280999423001},{"text":"主人","weight":0.38992391728178005},{"text":"感人","weight":0.14368797565702107},{"text":"温情","weight":0.30473772821146133},{"text":"剧情","weight":0.1883364022053072},{"text":"套路","weight":0.2524245722765725},{"text":"动物","weight":0.29300178441813984},{"text":"泪点","weight":0.17272848436017538},{"text":"贝利","weight":0.21328855030204671},{"text":"人类","weight":0.22885686506130998},{"text":"养狗","weight":0.2032384220962731},{"text":"催泪","weight":0.096105105297679},{"text":"观众","weight":0.14943398441266154},{"text":"宠物","weight":0.18110038177525187},{"text":"人生","weight":0.0032847865095713275},{"text":"情感","weight":0.006794360537032142},{"text":"电影院","weight":0.07371632368580561},{"text":"男主","weight":0.14205319099394498},{"text":"情节","weight":0.04466015552874027},{"text":"经历","weight":0.047192466463457525},{"text":"眼睛","weight":0.12127043065733682},{"text":"意义","weight":0.1788510069995734},{"text":"八公","weight":0.15574365831709563},{"text":"影片","weight":0.06180896594373846},{"text":"眼泪","weight":0.09603458210939758},{"text":"陪伴","weight":0.16690569252175844},{"text":"影院","weight":0.01783938758415882},{"text":"孩子","weight":0.039124546451686074},{"text":"纸巾","weight":0.1336165357116765},{"text":"狗生","weight":0.06691804918277071},{"text":"结尾","weight":0.09620827294876776},{"text":"感情","weight":0.045426015029468726},{"text":"视角","weight":0.034944433196485845},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        