var infor = { "content": [{ "name": "name", "value": "乘风破浪" }, { "name": "导演", "value": "Philipp Comarella,Simon Griesser," }, { "name": "编剧", "value": "Philipp Comarella,Simon Griesser," }, { "name": "主演", "value": " 邓超 / 彭于晏 / 赵丽颖 / 董子健 / 金士杰 / " }, { "name": "类型", "value": "动画,短片,冒险,运动," }, { "name": "上映日期", "value": "2011," }, { "name": "summary", "value": "一间似乎很久没人光临的小书屋，各种用品随意摆放。百叶窗帘歪歪斜斜挂在窗上，将透过来的阳光切成碎片，慵懒地铺展在桌上。前尘浮动，枯叶飘落，让屋中多少显得破败凄凉。某本书直直地立在桌上，一张白色便签纸看似随意地夹在中间。在阳光的照射下，便签纸渐渐变形，变了颜色。直到某一天，老旧的窗棂再也无法承受狂风的攻击，窗子终于被吹了开来。风儿卷入书房，弄乱了桌上的一切。便签纸随着倒下的书甩了出来。此时此刻，它仿佛有了生命。在它面前，随风翻动的书页仿佛一个又一个浪头。便签纸义无反顾冲了上去，开始一段惊险刺激的冲浪之旅……" }, { "name": "评分", "value": 7.8 }, { "name": "image", "value": "https://img1.doubanio.com/lpic/s11098957.jpg" }, { "name": "id", "value": "11507683" }] }

var bar_stack_option = {
    title: {
        x: 'left'
    },
    tooltip: {
        trigger: 'axis',
        axisPointer: { // 坐标轴指示器，坐标轴触发有效
            type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
        }
    },
    legend: {
        data: ['热度变化', '百度指数', '评论数']
    },
    grid: {
        left: '3%',
        right: '4%',
        bottom: '3%',
        containLabel: true
    },
    xAxis: [{
        type: 'category',
        data: ['2017-01-20', '2017-01-21', '2017-01-22', '2017-01-23', '2017-01-24', '2017-01-25', '2017-01-26', '2017-01-27', '2017-01-28', '2017-01-29', '2017-01-30', '2017-01-31', '2017-02-01', '2017-02-02', '2017-02-03', '2017-02-04', '2017-02-05', '2017-02-06', '2017-02-07', '2017-02-08', '2017-02-09', '2017-02-10', '2017-02-11', '2017-02-12', '2017-02-13', '2017-02-14', '2017-02-15', '2017-02-16', '2017-02-17', '2017-02-18', '2017-02-19', '2017-02-20', '2017-02-21', '2017-02-22', '2017-02-23', '2017-02-24', '2017-02-25', '2017-02-26', '2017-02-27', '2017-02-28', '2017-03-01', '2017-03-02', '2017-03-03', '2017-03-04', '2017-03-05']
    }],
    yAxis: [{
        name: '热度',
        type: 'value',
    }, {
        name: '评论数',
        type: 'value',
    }, {
        name: '百度指数',
        type: 'value',
        offset: 65
    }],
    series: [{
        name: '热度变化',
        type: 'line',
        data: []
    }, {
        name: '评论数',
        type: 'line',
        yAxisIndex: 1,
        data: []
    }, {
        name: '百度指数',
        type: 'line',
        yAxisIndex: 2,
        data: [18038, 23863, 24937, 30498, 28212, 25519, 35888, 34756, 202109, 216904, 212972, 203759, 209410, 203493, 204722, 188374, 177017, 148576, 140455, 120139, 103888, 1, 93026, 82524, 68344, 70458, 56075, 6, 46908, 55721, 53660, 39308, 36305, 37820, 36750, 34577, 38177, 36411, 23695, 20522, 20991, 20930, 22095, 28051, 25804]
    }, ]
};

var word_list = [{ "text": "细腻", "weight": 0.7878349692643366 }, { "text": "平淡", "weight": 0.6687659439142983 }, { "text": "善良", "weight": 0.43244460080336605 }, { "text": "沉闷", "weight": 0.5306740195405928 }, { "text": "惊悚", "weight": 0.27783312481943684 }, { "text": "焦虑", "weight": 0.49875464556887145 }, { "text": "伤害", "weight": 0.46690420682455075 }, { "text": "很小", "weight": 0.3534626528460148 }, { "text": "落后", "weight": 0.5919125477719643 }, { "text": "幽默", "weight": 0.24963875015022394 }, { "text": "微妙", "weight": 0.0927783515123842 }, { "text": "不安", "weight": 0.4609398038237096 }, { "text": "尊严", "weight": 0.360809950693312 }, { "text": "平凡", "weight": 0.11792128030149625 }, { "text": "悲伤", "weight": 0.39855827928160575 }, { "text": "尊重", "weight": 0.14403934752433098 }, { "text": "完美", "weight": 0.397617535794067 }, { "text": "羞耻", "weight": 0.09860872950871231 }, { "text": "歡喜", "weight": 0.3464945946772271 }, { "text": "细微", "weight": 0.3060071100051698 }, { "text": "隐晦", "weight": 0.4045429514998418 }, { "text": "幸福", "weight": 0.20212846339185075 }, { "text": "犀利", "weight": 0.3442656320551418 }, { "text": "模糊", "weight": 0.25581101520166 }, { "text": "揪心", "weight": 0.2692571595327755 }, { "text": "琐碎", "weight": 0.20477168062040182 }, { "text": "扎实", "weight": 0.4138936752068306 }, { "text": "巧妙", "weight": 0.14162877685877298 }, { "text": "尴尬", "weight": 0.052551379886613646 }, { "text": "无聊", "weight": 0.17475844391235124 }, { "text": "可悲", "weight": 0.04935327117813183 }, { "text": "不急", "weight": 0.20419236603887825 }, { "text": "不慢", "weight": 0.3201068369968524 }, { "text": "有趣", "weight": 0.015058178554674477 }, { "text": "强大", "weight": 0.01216557166729587 }, { "text": "电影", "weight": 0.4671730227047703 }, { "text": "社会", "weight": 0.16546469715285161 }, { "text": "故事", "weight": 0.06235608370706944 }, { "text": "男主", "weight": 0.36181521273830264 }, { "text": "推销员", "weight": 0.08767126025231792 }, { "text": "困境", "weight": 0.13654479879388162 }, { "text": "妻子", "weight": 0.1877855701110185 }, { "text": "人性", "weight": 0.18471168653555928 }, { "text": "剧本", "weight": 0.29513948169021104 }, { "text": "剧情", "weight": 0.3010995502732348 }, { "text": "家庭", "weight": 0.07353662743834943 }, { "text": "戏中戏", "weight": 0.19991158129943074 }, { "text": "文化", "weight": 0.08583557606091428 }, { "text": "剧作", "weight": 0.17535107504497244 }, { "text": "关系", "weight": 0.08650985739044437 }, { "text": "现实", "weight": 0.07244484511430078 }, { "text": "女性", "weight": 0.07924322760435652 }, { "text": "宗教", "weight": 0.042214000627562975 }, { "text": "情感", "weight": 0.03066283759413953 }, { "text": "角色", "weight": 0.1180486058557572 }, { "text": "老头", "weight": 0.017642433361895988 }, { "text": "结尾", "weight": 0.01138847317128544 }, { "text": "人物", "weight": 0.04602953785815698 }, { "text": "互文", "weight": 0.02092451629965073 }, { "text": "戏剧", "weight": 0.1110425103654944 }, { "text": "细节", "weight": 0.019219634689760002 }, { "text": "影片", "weight": 0.04137145264901893 }, { "text": "观众", "weight": 0.04848947889931779 }, { "text": "情绪", "weight": 0.16648106398535245 }, { "text": "事件", "weight": 0.14899718691323885 }, { "text": "演员", "weight": 0.033294074661532384 }, { "text": "镜头", "weight": 0.180964135099802 }, { "text": "精彩", "weight": 0.03150230175648521 }, { "text": "情节", "weight": 0.1177921154091815 }, { "text": "丈夫", "weight": 0.13018867939498086 }, { "text": "", "weight": null }];


///////////////////////////////////////////////////////////////////////

$('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
for (var i = 0; i < infor.content.length; ++i) {
    if (infor.content[i].name === 'summary') {
        $('.intro').html(infor.content[i].value);
    } else if (infor.content[i].name === 'id') {
        continue;
    } else if (infor.content[i].name === 'image') {
        $('.product-image-large img').attr('src', infor.content[i].value);
    } else if (infor.content[i].name === 'name') {
        $('.section-breadcrumbs h1').html(infor.content[i].value);
        $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
    } else {
        if (infor.content[i].value != null)
            $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
    }
}


var tab1 = document.getElementById('tab1');
var bar_dom = document.getElementById('bar_dom');

echarts.init(bar_dom).setOption(bar_stack_option, true);
$('#key_dom').jQCloud(word_list);

function randomData() {
    return Math.round(Math.random() * 1000);
}