
 var infor = {"content":[{"name":"name","value":"我不是潘金莲"},{"name":"导演","value":"冯小刚,"},{"name":"编剧","value":"刘震云,"},{"name":"主演","value":"范冰冰,郭涛,大鹏,张嘉译,于和伟,张译,李宗翰,赵立新,田小洁,范伟,高明,刘桦,黄建新,李晨,"},{"name":"类型","value":"剧情,喜剧,"},{"name":"上映日期","value":"2016-11-18(中国大陆),2016-09-08(多伦多电影节),"},{"name":"summary","value":"一个普通的农村妇女李雪莲（范冰冰 饰），为了纠正一句话，与上上下下、方方面面打了十年交道。打交道的过程中，她没想到一件事变成了另一件事，接着变成了第三件事。十年过去，她没有把这句话纠正过来，但她饱尝了世间的人情冷暖，悟明白了另外一个道理。李雪莲要纠正的这句话是她前夫说的。她前夫说：你是李雪莲吗？我咋觉得你是潘金莲呢？李雪莲要告诉大家的是：我不是潘金莲。"},{"name":"评分","value":6.8},{"name":"image","value":"https://img3.doubanio.com/view/movie_poster_cover/lpst/public/p2378133884.jpg"},{"name":"id","value":"26630781"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [16774,80111,143944,101999,79527,68520,57008,32934,51526,52689,50340,47288,46284,44626,43108,41102,41351,35041,34952,34716,29751,26291,23566,23035,17766,16069,16684,16785,16881,17354,17227,13991,15079,14118,11732,10759,11586,12792,8614,8333,8711,10077,9703,11113,11460]
            }, ]
        };

        var word_list = [{"text":"荒诞","weight":0.039070677467546576},{"text":"幽默","weight":0.023626602578824516},{"text":"不错","weight":0.018544441770995256},{"text":"生硬","weight":0.01134939824500015},{"text":"舒服","weight":0.010861231707385096},{"text":"愚昧","weight":0.010701094342516142},{"text":"荒谬","weight":0.010701094342516142},{"text":"完整","weight":0.010686349210152518},{"text":"苦涩","weight":0.009533958422725817},{"text":"尴尬","weight":0.008220943955514901},{"text":"便宜","weight":0.00813288166767843},{"text":"稳定","weight":0.008036401624129965},{"text":"流畅","weight":0.007929844390594083},{"text":"诙谐","weight":0.007683878899805062},{"text":"意外","weight":0.0074020813229576585},{"text":"不易","weight":0.007343794211431804},{"text":"巧妙","weight":0.007343794211431804},{"text":"合适","weight":0.007343794211431804},{"text":"圆滑","weight":0.007343794211431804},{"text":"幸运","weight":0.007343794211431804},{"text":"简单","weight":0.007343794211431804},{"text":"无聊","weight":0.007343794211431804},{"text":"微妙","weight":0.007343794211431804},{"text":"適度","weight":0.007343794211431804},{"text":"糟心","weight":0.007343794211431804},{"text":"丑陋","weight":0.007343794211431804},{"text":"很棒","weight":0.007343794211431804},{"text":"纯净","weight":0.007343794211431804},{"text":"勇敢","weight":0.007343794211431804},{"text":"阴暗","weight":0.007343794211431804},{"text":"很明","weight":0.007343794211431804},{"text":"平庸","weight":0.007343794211431804},{"text":"干净","weight":0.007343794211431804},{"text":"简明","weight":0.007343794211431804},{"text":"庞大","weight":0.007343794211431804},{"text":"电影","weight":0.020716895967179683},{"text":"故事","weight":0.014972124640585841},{"text":"官场","weight":0.010480452514391819},{"text":"演技","weight":0.008658057597645819},{"text":"镜头","weight":0.007273202881379413},{"text":"画面","weight":0.007216023597162573},{"text":"画幅","weight":0.005972243649368154},{"text":"剧情","weight":0.004883490894637161},{"text":"官员","weight":0.00480322302985575},{"text":"演员","weight":0.004751991611762841},{"text":"观众","weight":0.004667709367808311},{"text":"社会","weight":0.0042582860505207595},{"text":"圆形","weight":0.004200666550231779},{"text":"结尾","weight":0.003729138693666902},{"text":"法盲","weight":0.003626828023238687},{"text":"人物","weight":0.0034855285441489675},{"text":"配角","weight":0.003391450520151708},{"text":"女主","weight":0.0033106929704705577},{"text":"逻辑","weight":0.00320577211601505},{"text":"方言","weight":0.0031435959016854697},{"text":"政府","weight":0.0031041836443282456},{"text":"现实","weight":0.003020414894434937},{"text":"农村","weight":0.0029359474454722988},{"text":"题材","weight":0.0027303266170697646},{"text":"领导","weight":0.00268163018834044},{"text":"作品","weight":0.0026776939371510777},{"text":"喜剧","weight":0.0026185097850322404},{"text":"台词","weight":0.0025561298578149457},{"text":"摄影","weight":0.002543520298283903},{"text":"市长","weight":0.002392021572883747},{"text":"方形","weight":0.002388071344811192},{"text":"方圆","weight":0.002382396043874029},{"text":"剧本","weight":0.0023597252250414217},{"text":"恶心","weight":0.0022537821791703346},{"text":"形式","weight":0.0022517616714793436},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        