
 var infor = {"content":[{"name":"name","value":"推销员"},{"name":"导演","value":"阿斯哈·法哈蒂,"},{"name":"编剧","value":"阿斯哈·法哈蒂,"},{"name":"主演","value":"沙哈布·侯赛尼,塔兰涅·阿里多斯蒂,巴巴克·卡里米,法里德·萨贾蒂·侯赛尼,米娜·沙达蒂,"},{"name":"类型","value":"剧情,悬疑,"},{"name":"上映日期","value":"2016-05-21(戛纳电影节),2016-08-17(法国),"},{"name":"summary","value":"尹麦德（沙哈布·侯赛尼 Shahab Hosseini 饰）是学校里教授文学的老师，同时，他和妻子蕾娜（塔兰涅·阿里多斯蒂 Taraneh Alidoosti 饰）一起在剧团里表演话剧，夫妻两人感情十分深厚。某日，两人所住的房子成为了危楼，随时都有倒塌的危险，无奈之下，尹麦德和蕾娜只得临时找了另一个住所，匆匆入住。某日，蕾娜提前回到家中，不想遭到了陌生男子的袭击晕倒在浴室之中，愤怒的尹麦德根据罪犯遗漏的车钥匙找到了一辆小货车，一路尾随至面包店。最终，尹麦德找到了罪魁祸首巴巴克（巴巴克·卡里米 Babak Karimi 饰），却发现他当时亦只是一念之差走错了路，并且对自己的所作所为充满了愧疚。尹麦德要求巴巴克在自己的妻子和儿子面前坦白罪行，没想到却酿成了所有人都无法承受的惨痛后果。"},{"name":"评分","value":7.7},{"name":"image","value":"https://img1.doubanio.com/view/movie_poster_cover/lpst/public/p2378401788.jpg"},{"name":"id","value":"26679552"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [201,191,167,184,235,266,241,224,182,653,567,815,374,312,280,310,320,290,277,319,309,297,273,312,295,286,271,341,737,1073,804,890,894,871,1147,1510,1340,1166,7299,3681,2383,1911,1798,1830,1793]
            }, ]
        };

        var word_list = [{"text":"细腻","weight":0.33265580966323105},{"text":"平淡","weight":0.6399232070491686},{"text":"善良","weight":0.12385855793530942},{"text":"沉闷","weight":0.6125710671763721},{"text":"惊悚","weight":0.07779888523773609},{"text":"焦虑","weight":0.16656064787175576},{"text":"伤害","weight":0.42824647065804217},{"text":"很小","weight":0.5407619779966154},{"text":"落后","weight":0.4456777500778093},{"text":"幽默","weight":0.14061879821944417},{"text":"微妙","weight":0.323492560804532},{"text":"不安","weight":0.18310282981983048},{"text":"尊严","weight":0.26457286492610593},{"text":"平凡","weight":0.020215720802959723},{"text":"悲伤","weight":0.18219570330607734},{"text":"尊重","weight":0.19905285170060175},{"text":"完美","weight":0.3115221024516442},{"text":"羞耻","weight":0.16193415278646706},{"text":"歡喜","weight":0.15333874326904937},{"text":"细微","weight":0.1762681799512721},{"text":"隐晦","weight":0.038187880783529006},{"text":"幸福","weight":0.35350992249832874},{"text":"犀利","weight":0.05302532706535536},{"text":"模糊","weight":0.1312691261356015},{"text":"揪心","weight":0.32762651367850976},{"text":"琐碎","weight":0.1602809295283944},{"text":"扎实","weight":0.15964610512203972},{"text":"巧妙","weight":0.3322542972498295},{"text":"尴尬","weight":0.07970733271315414},{"text":"无聊","weight":0.14103637848311623},{"text":"可悲","weight":0.1709004037141949},{"text":"不急","weight":0.016030768982212017},{"text":"不慢","weight":0.09957517728728693},{"text":"有趣","weight":0.026504917630581163},{"text":"强大","weight":0.35040525334775624},{"text":"电影","weight":0.44223058190454456},{"text":"社会","weight":0.24720236461115289},{"text":"故事","weight":0.12219402538108917},{"text":"男主","weight":0.17107009943434034},{"text":"推销员","weight":0.09540147053107569},{"text":"困境","weight":0.2981113687204763},{"text":"妻子","weight":0.1989067243361829},{"text":"人性","weight":0.3195372965227676},{"text":"剧本","weight":0.21520355455826778},{"text":"剧情","weight":0.011803964102439215},{"text":"家庭","weight":0.2457912730616544},{"text":"戏中戏","weight":0.08847903155583932},{"text":"文化","weight":0.18988924556098688},{"text":"剧作","weight":0.016019449884251233},{"text":"关系","weight":0.14389073813246145},{"text":"现实","weight":0.1320162466439814},{"text":"女性","weight":0.18667431200360984},{"text":"宗教","weight":0.09492755885631975},{"text":"情感","weight":0.20704553542085571},{"text":"角色","weight":0.17865252332761392},{"text":"老头","weight":0.1252551365714244},{"text":"结尾","weight":0.001920973627108639},{"text":"人物","weight":0.0018056034016590969},{"text":"互文","weight":0.18705465986054898},{"text":"戏剧","weight":0.1375859076611297},{"text":"细节","weight":0.05603178663667948},{"text":"影片","weight":0.18650244121886192},{"text":"观众","weight":0.13964900148892764},{"text":"情绪","weight":0.14246804575149374},{"text":"事件","weight":0.08569903688760878},{"text":"演员","weight":0.09066118432101845},{"text":"镜头","weight":0.00045620310628353056},{"text":"精彩","weight":0.11061353755622913},{"text":"情节","weight":0.12531505365154616},{"text":"丈夫","weight":0.14163424369049024},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        