
 var infor = {"content":[{"name":"name","value":"月光男孩"},{"name":"导演","value":"巴里·詹金斯,"},{"name":"编剧","value":"巴里·詹金斯,塔瑞尔·麦卡尼,"},{"name":"主演","value":"崔凡特·罗兹,安德烈·霍兰,马赫沙拉·阿里,娜奥米·哈里斯,加奈儿·梦奈,艾什顿·桑德斯,贾雷尔·杰罗姆,艾利克斯·希伯特,杰登·派纳,段·桑德森,艾德森·吉恩,斯蒂芬·布隆,"},{"name":"类型","value":"剧情,同性,"},{"name":"上映日期","value":"2016-09-02(特柳赖德电影节),2016-09-10(多伦多电影节),2016-10-21(美国),"},{"name":"summary","value":"奇伦（艾什顿·桑德斯 Ashton Sanders 饰）的母亲宝拉（娜奥米·哈里斯 Naomie Harris 饰）吸毒成瘾根本无心照顾孩子，奇伦从小在孤独中长大，因为过于瘦小的身材而时常遭到周围人的欺侮和作弄。一次偶然中，奇伦结识了毒贩胡安（马赫沙拉·阿里 Maher shala Ali 饰），从此，胡安和其女友特蕾莎（加奈儿·梦奈 Janelle Monae 饰）的住处成为了奇伦的第二个家。凯文（贾雷尔·杰罗姆 Jharrel Jerome 饰）是奇伦唯一的朋友，随着时间的推移，两人之间的感情渐渐超越了友谊。然而，为了隐藏自己的性取向，凯文不得不在同伴的怂恿下对奇伦大打出手，之后，两人再也没有见过面。一晃眼多年过去，奇伦忽然接到了凯文打来的电话，两人终于决定正视各自心中真正的感情。"},{"name":"评分","value":7.2},{"name":"image","value":"https://img3.doubanio.com/view/movie_poster_cover/lpst/public/p2373594741.jpg"},{"name":"id","value":"26648249"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [2124,2479,1878,2015,2112,3389,2568,1812,1866,1959,1895,1987,1884,1837,1837,1813,1848,2080,1978,1925,1886,1830,1800,1833,1752,1758,1908,2135,2426,2456,2470,3231,3176,3169,3122,3720,4670,5753,166304,78990,38729,25983,21349,22125,19546]
            }, ]
        };

        var word_list = [{"text":"细腻","weight":0.03172653953321232},{"text":"温柔","weight":0.020630100300399763},{"text":"清新","weight":0.01648261668946933},{"text":"敏感","weight":0.015197938180068933},{"text":"平淡","weight":0.012501740068824594},{"text":"脆弱","weight":0.011434564558122615},{"text":"美好","weight":0.010968761435704919},{"text":"悲伤","weight":0.009785317884105577},{"text":"孤独","weight":0.00939097627426481},{"text":"简单","weight":0.008696567331486956},{"text":"很好","weight":0.008231702251002344},{"text":"不错","weight":0.008079540725250337},{"text":"沉闷","weight":0.008004595709496288},{"text":"曖昧","weight":0.007479718480333224},{"text":"炽热","weight":0.007479718480333224},{"text":"紧张","weight":0.007479718480333224},{"text":"深沉","weight":0.0074797184803332235},{"text":"不安","weight":0.0074797184803332235},{"text":"害羞","weight":0.007396201680600333},{"text":"很淡","weight":0.006644038642479309},{"text":"勇敢","weight":0.006644038642479307},{"text":"强壮","weight":0.006644038642479307},{"text":"简洁","weight":0.0064294119707723},{"text":"善良","weight":0.00620985046332885},{"text":"沉默","weight":0.006158825868593024},{"text":"很小","weight":0.005768839217637915},{"text":"柔软","weight":0.0055692280204324785},{"text":"聪明","weight":0.005529009053612406},{"text":"单靠","weight":0.005329781770262472},{"text":"伤害","weight":0.005117705609251719},{"text":"惊喜","weight":0.005117705609251719},{"text":"意外","weight":0.005117705609251719},{"text":"单薄","weight":0.005117705609251719},{"text":"清晰","weight":0.005117705609251719},{"text":"平庸","weight":0.005117705609251719},{"text":"电影","weight":0.019648900321722212},{"text":"黑人","weight":0.018823184977141326},{"text":"故事","weight":0.012859128652305957},{"text":"月光","weight":0.008076565545855419},{"text":"男孩","weight":0.007458870026673501},{"text":"镜头","weight":0.0074103482417398866},{"text":"情感","weight":0.006291435974863285},{"text":"题材","weight":0.005849500853716141},{"text":"种族","weight":0.005843101732140049},{"text":"同性","weight":0.005780908849947494},{"text":"人生","weight":0.005220273783457125},{"text":"男主","weight":0.005138318223022214},{"text":"政治","weight":0.004948928865828764},{"text":"主角","weight":0.004948437886259946},{"text":"剧情","weight":0.004946917897796569},{"text":"影片","weight":0.004831708858939446},{"text":"内心","weight":0.0045496053855639445},{"text":"蓝色","weight":0.004257647665004205},{"text":"摄影","weight":0.004256046802849426},{"text":"三段式","weight":0.004220057269352816},{"text":"节奏","weight":0.004199235668018991},{"text":"同志","weight":0.004047107236253468},{"text":"演员","weight":0.004046586007642589},{"text":"社会","weight":0.00384433999946251},{"text":"人物","weight":0.003659572487342204},{"text":"毒品","weight":0.003495748516594081},{"text":"爱情","weight":0.0032929202849796765},{"text":"最佳影片","weight":0.003267755943951222},{"text":"风格","weight":0.003145496639678227},{"text":"眼神","weight":0.0030513420820414815},{"text":"文艺","weight":0.0029485299863304007},{"text":"男人","weight":0.0028919070442003127},{"text":"感情","weight":0.0028227058471629683},{"text":"一个男孩","weight":0.0028153965161233107},{"text":"全片","weight":0.0027950578080949743},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        