
 var infor = {"content":[{"name":"name","value":"极限特工"},{"name":"导演","value":"罗伯·科恩,"},{"name":"编剧","value":"里奇·威尔克斯,"},{"name":"主演","value":"范·迪塞尔,艾莎·阿基多,马尔顿·索克斯,塞缪尔·杰克逊,Michael Roof,里奇·穆勒,维尔内尔·达赫,Petr Jákl,Jan Pavel Filipensky,汤姆·埃沃雷特,丹尼·特雷霍,托马斯·伊安·格里菲斯,伊芙,莱拉·阿尔切里,威廉·霍普,"},{"name":"类型","value":"动作,犯罪,冒险,"},{"name":"上映日期","value":"2002-08-09(美国),"},{"name":"summary","value":"克桑德（范•迪塞尔 Vin Diesel 饰）是极限运动界的明星，但他离经叛道，总是以他的身手对社会上那些败类名流发出挑战，当地警方对他也经常无可奈何。特工头子奥古斯塔斯看上了克桑德，于是派人将他抓了回来，说服他前往捷克进行一项危险而艰巨的任务。捷克的地下犯罪组织头子尤里（马尔顿•索克斯 Marton Csokas 饰）正在进行一项疯狂的计划，他抓走了很多前苏联的科学家，利用他们研究一种威力无比的武器——毒气弹。他企图利用即将研制成功的武器引起世界大战，进而达到他统治世界的目的。克桑德以走私汽车贩子的身份前往捷克接近了尤里的组织，一场惊心动魄的行动展开了！"},{"name":"评分","value":7.3},{"name":"image","value":"https://img1.doubanio.com/view/movie_poster_cover/lpst/public/p972392728.jpg"},{"name":"id","value":"1306737"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [3645,3832,4653,4479,4726,4072,3520,3006,14838,17733,11847,14648,15645,17219,24504,28156,34167,46874,53533,76409,113070,240071,227584,208498,150545,143209,109718,70169,72747,86708,78303,47169,40006,35608,31961,30797,35157,30371,20436,17154,16156,14574,14046,16442,15328]
            }, ]
        };

        var word_list = [{"text":"不错","weight":0.3520826655344875},{"text":"特效","weight":0.8278795244274938},{"text":"极限","weight":0.9673071810943759},{"text":"炫酷","weight":0.5315758391030379},{"text":"尴尬","weight":0.6431769779110769},{"text":"无聊","weight":0.08282478677289205},{"text":"简单","weight":0.3149655319253842},{"text":"意外","weight":0.15761495711240298},{"text":"很酷","weight":0.08222116656177843},{"text":"挺酷","weight":0.2230251933555273},{"text":"紧凑","weight":0.4012382954159008},{"text":"漂亮","weight":0.14260162512311078},{"text":"紧张","weight":0.2726258038187777},{"text":"很烂","weight":0.40600509163795656},{"text":"强大","weight":0.24856156662176185},{"text":"挺好玩","weight":0.18278318939379437},{"text":"激烈","weight":0.23516526926122255},{"text":"神奇","weight":0.15067644147977552},{"text":"寂寞","weight":0.018704595960432977},{"text":"光滑","weight":0.30050817965809207},{"text":"害羞","weight":0.28147610303774023},{"text":"平凡","weight":0.36235649511246915},{"text":"幸福","weight":0.41324541496913464},{"text":"连续","weight":0.19524899213010877},{"text":"幼稚","weight":0.09554537659835859},{"text":"热闹","weight":0.03593212075587455},{"text":"爽爽爽","weight":0.29333963631057874},{"text":"惊喜","weight":0.2616696541614824},{"text":"粗暴","weight":0.11196924398961326},{"text":"很棒","weight":0.01679485976035927},{"text":"火爆","weight":0.00460376451359909},{"text":"合适","weight":0.24049559667554124},{"text":"很易","weight":0.018637144004035086},{"text":"糟糕","weight":0.012235213942095135},{"text":"特烂","weight":0.16595446875427575},{"text":"电影","weight":0.7804876844681674},{"text":"剧情","weight":0.10495807452672118},{"text":"动作","weight":0.0238311028680895},{"text":"特工","weight":0.2603331128070509},{"text":"爆米花","weight":0.046922081601454745},{"text":"角色","weight":0.17284684636668515},{"text":"美女","weight":0.010456370517838296},{"text":"动作片","weight":0.19121116464605456},{"text":"极限运动","weight":0.04014670422782356},{"text":"套路","weight":0.24742832983128013},{"text":"场面","weight":0.12347057031481713},{"text":"滑板","weight":0.16371402265074028},{"text":"全程","weight":0.03859063376544823},{"text":"故事","weight":0.14225060688134725},{"text":"妹子","weight":0.16284903602986872},{"text":"逻辑","weight":0.05601932681553435},{"text":"演技","weight":0.09268867287296766},{"text":"大片","weight":0.07621236098590871},{"text":"主角","weight":0.08587209411355144},{"text":"演员","weight":0.011705194273958157},{"text":"观众","weight":0.0014629908941242626},{"text":"子弹","weight":0.030032209088199577},{"text":"台词","weight":0.06937211305257901},{"text":"无脑","weight":0.11687308323506228},{"text":"烂片","weight":0.04171539589916684},{"text":"精彩","weight":0.05316538685175738},{"text":"镜头","weight":0.12186145419911418},{"text":"节奏","weight":0.020459271971554817},{"text":"肌肉","weight":0.0555422977904802},{"text":"男主","weight":0.11103419678537749},{"text":"技能","weight":0.030608104377953502},{"text":"音乐","weight":0.07607255980135363},{"text":"身材","weight":0.061022577723472055},{"text":"浪费","weight":0.02581480676732438},{"text":"枪战","weight":0.09329169454970646},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        