
 var infor = {"content":[{"name":"name","value":"湄公河行动"},{"name":"导演","value":"林超贤,"},{"name":"编剧","value":"林超贤,"},{"name":"主演","value":"张涵予,彭于晏,孙淳,陈宝国,冯文娟,刘显达,赵健,吴旭东,吴嘉龙,卢惠光,柏华力·莫高彼斯彻,维他亚·潘斯林加姆,"},{"name":"类型","value":"动作,犯罪,"},{"name":"上映日期","value":"2016-09-30(中国大陆),2016-10-07(台湾),"},{"name":"summary","value":"金三角湄公河上，一处被称为“鬼门关”的河段，两艘来自中国的商船遭到不明身份之人的枪击袭击。未过多久，泰国军方召开新闻发布会，指责中国商船贩卖毒品。虽然发布会宣称船员全部逃亡，但是十三具遭受残忍杀害的中国船员尸体很快被人发现。这起胆大妄为的案件令中国警方大为震惊，云南省缉毒总队队长高刚（张涵予 饰）受命带特别行动小组前往泰国，并与情报员方新武（彭于晏 饰）合作接洽。根据现有资料显示，这件案子由盘踞在金三角的大毒枭糯卡所为。糯卡贪婪残忍，胆大包天，是湄公河流域上一颗惊扰运输安全的毒瘤。为了将这个恶棍绳之于法，中国、老挝、缅甸开展了三国联合巡逻，集中对糯卡的制毒窝点进行扫荡。而高刚等人也深入最危险境地，与丧失人性的贩毒分子进行惨烈对决……本片根据真实事件改编。"},{"name":"评分","value":8},{"name":"image","value":"https://img5.doubanio.com/view/movie_poster_cover/lpst/public/p2380677316.jpg"},{"name":"id","value":"25815034"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [23903,24122,22884,21525,21174,22468,23123,17132,28047,28771,28017,116310,58669,37848,30075,26295,24536,20866,19585,20145,17155,16745,16277,14625,11579,10760,11179,26044,29956,30188,29671,21398,19946,18944,17074,17375,19349,17214,11438,9967,9932,9971,10451,12870,12352]
            }, ]
        };

        var word_list = [{"text":"细腻","weight":0.30102256837123453},{"text":"平淡","weight":0.4717084446220652},{"text":"善良","weight":0.40568139012598303},{"text":"沉闷","weight":0.6757313445258173},{"text":"惊悚","weight":0.05132014368181725},{"text":"焦虑","weight":0.43154530044631856},{"text":"伤害","weight":0.07721652907112586},{"text":"很小","weight":0.3449772073400639},{"text":"落后","weight":0.24500922321764343},{"text":"幽默","weight":0.10751866916387798},{"text":"微妙","weight":0.24043380104804446},{"text":"不安","weight":0.43870526914387775},{"text":"尊严","weight":0.23877479933319992},{"text":"平凡","weight":0.40860689202838807},{"text":"悲伤","weight":0.1561455236525922},{"text":"尊重","weight":0.29869321742573035},{"text":"完美","weight":0.17929427884301127},{"text":"羞耻","weight":0.13043175545615282},{"text":"歡喜","weight":0.2109158825354678},{"text":"细微","weight":0.25560563901060346},{"text":"隐晦","weight":0.1501697326816257},{"text":"幸福","weight":0.0348174848268001},{"text":"犀利","weight":0.10202987652847677},{"text":"模糊","weight":0.21888318904012813},{"text":"揪心","weight":0.30230933734807347},{"text":"琐碎","weight":0.06622488362668934},{"text":"扎实","weight":0.2822370861121305},{"text":"巧妙","weight":0.14761010183456616},{"text":"尴尬","weight":0.1606770575494271},{"text":"无聊","weight":0.10503721750048108},{"text":"可悲","weight":0.29093726615309445},{"text":"不急","weight":0.2817764271017947},{"text":"不慢","weight":0.1260443338909222},{"text":"有趣","weight":0.27121079398654585},{"text":"强大","weight":0.08440855389663102},{"text":"电影","weight":0.3676616004874816},{"text":"社会","weight":0.14690712900458405},{"text":"故事","weight":0.41876360576070215},{"text":"男主","weight":0.3394682031132205},{"text":"推销员","weight":0.36764811504854855},{"text":"困境","weight":0.15880629027355406},{"text":"妻子","weight":0.33281191175870756},{"text":"人性","weight":0.028231332249923687},{"text":"剧本","weight":0.1250359472373795},{"text":"剧情","weight":0.2895875388512955},{"text":"家庭","weight":0.2626580491027466},{"text":"戏中戏","weight":0.14245401778777733},{"text":"文化","weight":0.17148091930473128},{"text":"剧作","weight":0.11869993763849408},{"text":"关系","weight":0.2498729714621793},{"text":"现实","weight":0.16757985809594741},{"text":"女性","weight":0.22582812863979554},{"text":"宗教","weight":0.06922531798685871},{"text":"情感","weight":0.19100554406974793},{"text":"角色","weight":0.08114756757848263},{"text":"老头","weight":0.11127282222873168},{"text":"结尾","weight":0.04213482321010219},{"text":"人物","weight":0.039642797298965},{"text":"互文","weight":0.1556823419726909},{"text":"戏剧","weight":0.149041397245202},{"text":"细节","weight":0.03601324435643033},{"text":"影片","weight":0.0979517729398944},{"text":"观众","weight":0.002937715889283919},{"text":"情绪","weight":0.16800485683725014},{"text":"事件","weight":0.10658963971499351},{"text":"演员","weight":0.13304252247375792},{"text":"镜头","weight":0.021311448815940586},{"text":"精彩","weight":0.07267899966434592},{"text":"情节","weight":0.10248943197848939},{"text":"丈夫","weight":0.021141607409572747},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        