
 var infor = {"content":[{"name":"name","value":"爱乐之城"},{"name":"导演","value":"达米恩·查泽雷"},{"name":"编剧","value":"达米恩·查泽雷"},{"name":"主演","value":null},{"name":"类型","value":"剧情,爱情,歌舞,"},{"name":"上映日期","value":"2017-02-14(中国大陆)"},{"name":"summary","value":"米娅（艾玛·斯通 Emma Stone 饰）渴望成为一名演员，但至今她仍旧只是片场咖啡厅里的一名平凡的咖啡师，尽管不停的参加着大大小小的试镜，但米娅收获的只有失败。某日，在一场派对之中，米娅邂逅了名为塞巴斯汀（瑞恩·高斯林 Ryan Gosling 饰）的男子，起初两人之间产生了小小的矛盾，但很快，米娅便被塞巴斯汀身上闪耀的才华以及他对爵士乐的纯粹追求所吸引，最终两人走到了一起。在塞巴斯汀的鼓励下，米娅辞掉了咖啡厅的工作，专心为自己写起了剧本，与此同时，塞巴斯汀为了获得一份稳定的收入，加入了一支流行爵士乐队，开始演奏自己并不喜欢的现代爵士乐，没想到一炮而红。随着时间的推移，努力追求梦想的两人，彼此之间的距离却越来越远，在理想和感情之间，他们必须做出选择。"},{"name":"评分","value":8.5},{"name":"image","value":"https://img3.doubanio.com/view/movie_poster_cover/lpst/public/p2425658570.jpg"},{"name":"id","value":"25934014"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [6121,6791,7616,7477,12796,26987,16031,8283,11974,11632,11802,10991,12948,14695,14772,15291,16254,17173,18815,26338,24568,34357,92766,75401,88214,286319,200176,134039,140914,163786,157218,98312,77303,69236,61614,63133,73717,67343,195420,106348,69440,54731,49533,55745,46850]
            }, ]
        };

        var word_list = [{"text":"浪漫","weight":0.022969824717913746},{"text":"美好","weight":0.020450982748051967},{"text":"遗憾","weight":0.01925204978003288},{"text":"完美","weight":0.013179273231910388},{"text":"尴尬","weight":0.0080386778773251},{"text":"简单","weight":0.007547288365487123},{"text":"充满","weight":0.007158738955767768},{"text":"成功","weight":0.007114323225319537},{"text":"精致","weight":0.0070188289607101455},{"text":"悲伤","weight":0.005896130057836239},{"text":"甜蜜","weight":0.005514195579978684},{"text":"不错","weight":0.0049827556422516114},{"text":"幸福","weight":0.004907899178571703},{"text":"欢快","weight":0.004768626605860546},{"text":"平庸","weight":0.004685365097343485},{"text":"惊喜","weight":0.004557019401090459},{"text":"残酷","weight":0.00433786000004797},{"text":"温柔","weight":0.004269328188196098},{"text":"完整","weight":0.004261578856386425},{"text":"漂亮","weight":0.004240152543744295},{"text":"很美","weight":0.004216043450334959},{"text":"流畅","weight":0.003982812037168742},{"text":"珍惜","weight":0.003960159624930782},{"text":"孤独","weight":0.0038853098901257344},{"text":"珍贵","weight":0.0037390480103747037},{"text":"正好","weight":0.0036551055858178756},{"text":"很棒","weight":0.003488138750510037},{"text":"俏皮","weight":0.0034250671852384617},{"text":"愚蠢","weight":0.0033836312577350106},{"text":"拖沓","weight":0.0033224344568511185},{"text":"电影","weight":0.016436770727173557},{"text":"梦想","weight":0.010259744347537406},{"text":"爱情","weight":0.008766448971366548},{"text":"歌舞","weight":0.008312753244855987},{"text":"故事","weight":0.008161701437886665},{"text":"歌舞片","weight":0.007710747986986998},{"text":"音乐","weight":0.0075687594814879975},{"text":"结尾","weight":0.005618233956408121},{"text":"现实","weight":0.004811827487893383},{"text":"石头","weight":0.0047302274111283345},{"text":"司令","weight":0.004697578025364223},{"text":"女主","weight":0.004391218194061881},{"text":"结局","weight":0.004238089086136399},{"text":"剧情","weight":0.004202594853770082},{"text":"人生","weight":0.004158327075645523},{"text":"男主","weight":0.003774992158138431},{"text":"爵士乐","weight":0.0035745917092785333},{"text":"镜头","weight":0.0034633467879071882},{"text":"爵士","weight":0.003247836028555508},{"text":"电影院","weight":0.0029001193417243637},{"text":"舞蹈","weight":0.002857778745556355},{"text":"画面","weight":0.002772082256256462},{"text":"演员","weight":0.002692235412119002},{"text":"男女","weight":0.0026717110915772634},{"text":"理想","weight":0.002501143336442276},{"text":"长镜头","weight":0.0023761237547475773},{"text":"观众","weight":0.0022801293390682337},{"text":"世界","weight":0.002241452778389622},{"text":"场景","weight":0.002214161171867734},{"text":"感情","weight":0.0022013612912952923},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        