
 var infor = {"content":[{"name":"name","value":"疯狂动物城"},{"name":"导演","value":"拜伦·霍华德,瑞奇·摩尔,杰拉德·布什,"},{"name":"编剧","value":"拜伦·霍华德,瑞奇·摩尔,杰拉德·布什,吉姆·里尔顿,乔西·特立尼达,菲尔·约翰斯顿,珍妮弗·李,"},{"name":"主演","value":"金妮弗·古德温,杰森·贝特曼,伊德里斯·艾尔巴,珍妮·斯蕾特,内特·托伦斯,邦尼·亨特,唐·雷克,汤米·钟,J·K·西蒙斯,奥克塔维亚·斯宾瑟,艾伦·图代克,夏奇拉,雷蒙德·S·佩尔西,德拉·萨巴,莫里斯·拉马奇,菲尔·约翰斯顿,约翰·迪·玛吉欧,凯蒂·洛斯,吉塔·雷迪,杰西·科尔蒂,汤米·利斯特,乔希·达拉斯,瑞奇·摩尔,凯特·索西,彼得·曼斯布里奇,拜伦·霍华德,杰拉德·布什,马克·史密斯,乔西·特立尼达,约翰·拉维尔,克里斯汀·贝尔,吉尔·科德斯,梅利莎·古德温,"},{"name":"类型","value":"喜剧,动作,动画,冒险,"},{"name":"上映日期","value":"2016-03-04(中国大陆/美国),"},{"name":"summary","value":"故事发生在一个所有哺乳类动物和谐共存的美好世界中，兔子朱迪（金妮弗·古德温 Ginnifer Goodwin 配音）从小就梦想着能够成为一名惩恶扬善的刑警，凭借着智慧和努力，朱迪成功的从警校中毕业进入了疯狂动物城警察局，殊不知这里是大型肉食类动物的领地，作为第一只，也是唯一的小型食草类动物，朱迪会遇到怎样的故事呢？近日里，城中接连发生动物失踪案件，就在全部警员都致力于调查案件真相之时，朱迪却被局长（伊德瑞斯·艾尔巴 Idris Elba 配音）发配成为了一名无足轻重的交警。某日，正在执勤的兔子遇见了名为尼克（杰森·贝特曼 Jason Bateman 配音）的狐狸，两人不打不相识，之后又误打误撞的接受了寻找失踪的水獭先生的任务，如果不能在两天之内找到水獭先生，朱迪就必须自愿离开警局。朱迪找到了尼克，两人联手揭露了一个隐藏在疯狂动物城之中的惊天秘密。"},{"name":"评分","value":9.2},{"name":"image","value":"https://img1.doubanio.com/view/movie_poster_cover/lpst/public/p2315672647.jpg"},{"name":"id","value":"25662329"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [16986,17262,17185,16861,16695,17157,17385,15124,18660,18410,17825,17785,17634,17297,17125,16514,16554,15892,16349,17077,15804,15969,16325,13512,10126,9850,9600,9963,11754,14820,14277,10520,10762,10752,10200,11731,16010,14977,17841,12558,11382,10800,12567,17588,16351]
            }, ]
        };

        var word_list = [{"text":"有趣","weight":0.020092434580627715},{"text":"简单","weight":0.019788843623444723},{"text":"充满","weight":0.013247574876109766},{"text":"幽默","weight":0.013052553630126688},{"text":"聪明","weight":0.011928169110941139},{"text":"惊喜","weight":0.011737961812784872},{"text":"美好","weight":0.011452965713562965},{"text":"疯狂","weight":0.010482964030972737},{"text":"优秀","weight":0.010111796555855217},{"text":"平等","weight":0.009791156891227242},{"text":"扎实","weight":0.008868499266772556},{"text":"敏感","weight":0.008868499266772556},{"text":"惊人","weight":0.008868499266772554},{"text":"和谐","weight":0.008868499266772554},{"text":"邪恶","weight":0.008868499266772554},{"text":"细思","weight":0.008868499266772554},{"text":"狡猾","weight":0.00866345694253218},{"text":"完整","weight":0.008392598877827511},{"text":"恶搞","weight":0.008099546986759062},{"text":"无聊","weight":0.007896849606229222},{"text":"精致","weight":0.007896849606229222},{"text":"完美","weight":0.007896849606229222},{"text":"巧妙","weight":0.007896849606229222},{"text":"高矮","weight":0.007896849606229222},{"text":"惊险","weight":0.0074166348106813555},{"text":"善良","weight":0.006988849335901313},{"text":"成熟","weight":0.006550032134648198},{"text":"欢乐","weight":0.006167162923634541},{"text":"甜甜","weight":0.006082709757452602},{"text":"遗憾","weight":0.006082709757452602},{"text":"微妙","weight":0.006082709757452602},{"text":"厉害","weight":0.006082709757452602},{"text":"愉悦","weight":0.006082709757452602},{"text":"铮铮","weight":0.006082709757452602},{"text":"绚丽","weight":0.006082709757452602},{"text":"动物","weight":0.016663488642023182},{"text":"动画","weight":0.015233503743888705},{"text":"狐狸","weight":0.011953162609581519},{"text":"电影","weight":0.009969523183973076},{"text":"树懒","weight":0.00905402381357677},{"text":"故事","weight":0.008661289265034889},{"text":"动画片","weight":0.00803356776549765},{"text":"兔子","weight":0.007119912015325463},{"text":"政治","weight":0.006893980191869315},{"text":"社会","weight":0.006421977699412084},{"text":"细节","weight":0.00561828190578957},{"text":"世界","weight":0.005416413609527591},{"text":"种族","weight":0.00524993191069947},{"text":"角色","weight":0.0052051310872231445},{"text":"教父","weight":0.004611960183974319},{"text":"剧情","weight":0.00435528995438518},{"text":"现实","weight":0.004317835281768746},{"text":"笑点","weight":0.0040663434146393515},{"text":"主题","weight":0.003421561275124183},{"text":"成人","weight":0.00292498984005737},{"text":"隐喻","weight":0.0028257147241299726},{"text":"励志","weight":0.0027990478515802658},{"text":"梦想","weight":0.0027714060532591837},{"text":"主角","weight":0.002746818050273615},{"text":"人物","weight":0.0025999949076596024},{"text":"人类","weight":0.00248399234595232},{"text":"精彩","weight":0.0024611109347488767},{"text":"孩子","weight":0.002455357635349607},{"text":"动画电影","weight":0.002409530006181648},{"text":"影片","weight":0.002376901447442927},{"text":"地方","weight":0.002373271290284984},{"text":"剧本","weight":0.0022658888080662656},{"text":"童话","weight":0.0021932613780251617},{"text":"观众","weight":0.0021292287736496243},{"text":"配音","weight":0.0021165078142680797},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        