
 var infor = {"content":[{"name":"name","value":"萨利机长"},{"name":"导演","value":"克林特·伊斯特伍德,"},{"name":"编剧","value":"托德·考马尔尼基,切斯利·舒伦伯格,杰弗里·札斯洛,"},{"name":"主演","value":"汤姆·汉克斯,艾伦·艾克哈特,劳拉·琳妮,杰瑞·费拉拉,安娜·冈,奥图姆·瑞瑟,霍特·麦克卡兰尼,迈克·奥麦利,杰米·谢尔丹,安·库萨克,莫莉·哈根,马克斯·阿德勒,萨姆·亨廷顿,韦恩·巴斯楚普,维勒莉·玛哈菲,"},{"name":"类型","value":"剧情,传记,灾难,"},{"name":"上映日期","value":"2016-12-09(中国大陆),2016-09-09(美国),"},{"name":"summary","value":"影片根据真实事件改编，2009年1月15日，萨利（汤姆·汉克斯 Tom Hanks 饰）在全美航空1549号班担任机长，飞机起飞两分钟后遭到飞鸟攻击，两架发动机全部熄火，萨利决定在哈德逊河上迫降，155人全数生还。但之后的调查显示他做了错误的抉择，认为大可选择返回拉瓜地亚机场。机内到底发生了什么呢？"},{"name":"评分","value":8.3},{"name":"image","value":"https://img3.doubanio.com/view/movie_poster_cover/lpst/public/p2403319543.jpg"},{"name":"id","value":"26416603"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [4327,4955,4139,3830,3892,4292,5547,10072,16128,15492,12733,11358,9982,9482,0,8601,10422,7893,0,6813,6036,6099,6659,6362,4477,3944,3842,3666,4014,4851,4290,3508,4526,3855,3855,3426,3954,4716,3422,3200,3172,2787,2857,3669,3595]
            }, ]
        };

        var word_list = [{"text":"冷静","weight":0.4060243271790881},{"text":"简单","weight":0.5771329036754768},{"text":"沉稳","weight":0.5582452371547031},{"text":"很好","weight":0.4335649319079708},{"text":"成功","weight":0.33721426049679276},{"text":"干净","weight":0.25569952062468004},{"text":"紧张","weight":0.20773594611710075},{"text":"坚定","weight":0.4329644437390767},{"text":"稳健","weight":0.3548404882434148},{"text":"特效","weight":0.3573388494699876},{"text":"流畅","weight":0.4032357808630662},{"text":"严谨","weight":0.15404704748596226},{"text":"乐观","weight":0.44207359982064365},{"text":"完美","weight":0.1286864936392993},{"text":"平淡","weight":0.2222367377610482},{"text":"惊险","weight":0.2276533771641689},{"text":"厉害","weight":0.01009053136429997},{"text":"不安","weight":0.22783943261672632},{"text":"冗長","weight":0.14141539130245712},{"text":"平實","weight":0.25301073032615057},{"text":"曲折","weight":0.06405090373015207},{"text":"不顯","weight":0.035104837504164974},{"text":"清晰","weight":0.04358708486419968},{"text":"严肃","weight":0.16851398637597698},{"text":"成熟","weight":0.2842765315886198},{"text":"很稳","weight":0.28883769081165883},{"text":"幽默","weight":0.1822942288606322},{"text":"平缓","weight":0.07989370277242162},{"text":"惊喜","weight":0.030880193432986123},{"text":"庞大","weight":0.09128741604465042},{"text":"沉重","weight":0.06633877256801611},{"text":"美好","weight":0.28244249085782297},{"text":"苦涩","weight":0.07127357646877949},{"text":"惶恐","weight":0.25459862916704706},{"text":"焦虑","weight":0.06106730525898468},{"text":"机长","weight":0.7866423604323827},{"text":"电影","weight":0.7616009253616187},{"text":"故事","weight":0.25303071135478594},{"text":"事件","weight":0.25936877879027015},{"text":"飞机","weight":0.22028502976020917},{"text":"乘客","weight":0.2167752933464558},{"text":"影片","weight":0.25068713943947696},{"text":"主旋律","weight":0.30237807557700613},{"text":"人性","weight":0.09559029369151732},{"text":"听证会","weight":0.1151624571695944},{"text":"事故","weight":0.12703745076075637},{"text":"演技","weight":0.13524478288417557},{"text":"真人","weight":0.2036276030594349},{"text":"灾难","weight":0.18093882983608475},{"text":"人物","weight":0.1738979581423206},{"text":"结尾","weight":0.17973343289564492},{"text":"灾难片","weight":0.07762148117671319},{"text":"内心","weight":0.12489939281616057},{"text":"精神","weight":0.010073462642580699},{"text":"职业","weight":0.06844186248981363},{"text":"经验","weight":0.07035465038896238},{"text":"刻画","weight":0.018327775991464686},{"text":"奇迹","weight":0.02372005023957958},{"text":"新闻","weight":0.08461921921435159},{"text":"专业","weight":0.10823280135903308},{"text":"视角","weight":0.13556138618300542},{"text":"世界","weight":0.07208383964496871},{"text":"角度","weight":0.10422010956672527},{"text":"节奏","weight":0.006408885580135662},{"text":"价值观","weight":0.03808914529730297},{"text":"观众","weight":0.06442273083373551},{"text":"情节","weight":0.06662488922449797},{"text":"正义","weight":0.06618010150013522},{"text":"剪辑","weight":0.02623766653812892},{"text":"主角","weight":0.09378173193211396},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        