
 var infor = {"content":[{"name":"name","value":"吐槽大会"},{"name":"主演","value":"张绍刚 李湘 宁静 韩乔生 "},{"name":"类型","value":"脱口秀"},{"name":"国家/地区","value":"中国大陆"},{"name":"开播日期","value":"2016"},{"name":"summary","value":"由腾讯视频、上海笑果文化传媒有限公司联合出品的喜剧脱口秀《吐槽大会》将于2017年1月8日起每周日晚在腾讯视频上线播出。“吐槽是门手艺，笑对需要勇气”，和传统喜剧节目最大的不同是，《吐槽大会》以网络独有的“吐槽文化”为切入点，每一期节目都会邀请一位话题名人，让他们接受吐槽和自嘲。光鲜亮丽的名人遭遇群嘲的场面实属罕见，也吊足观众胃口。"},{"name":"评分","value":7.2},{"name":"image","value":"https://img3.doubanio.com/view/movie_poster_cover/lpst/public/p2410210065.jpg"},{"name":"id","value":"26830647"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [163035,284183,749061,341918,315746,300597,291602,275970,459562,586942,507761,283545,230261,238030,221671,214377,402559,266070,203180,197175,188116,285364,462439,862326,508595,327532,211370,206520,309893,483442,878028,504633,313581,210387,202364,203493,426291,921690,438558,212462,203658,197644,202422,374074,869500]
            }, ]
        };

        var word_list = [{"text":"尴尬","weight":3.8020965380937235},{"text":"幽默","weight":0.6661495872290599},{"text":"不错","weight":0.3974001914513522},{"text":"无聊","weight":0.031980346409128065},{"text":"不心","weight":0.5582942439728625},{"text":"低俗","weight":0.2092984828398379},{"text":"流畅","weight":0.34796807687377446},{"text":"犀利","weight":0.5700720857500091},{"text":"生硬","weight":0.30720102667190385},{"text":"和谐","weight":0.3157886183580146},{"text":"刻薄","weight":0.2317097807003876},{"text":"厉害","weight":0.5150672527383044},{"text":"不愧","weight":0.1949737292193845},{"text":"逗乐","weight":0.24163531235096175},{"text":"微博","weight":0.5578644750315782},{"text":"不小","weight":0.01069761717609102},{"text":"微妙","weight":0.24351513804116387},{"text":"粗俗","weight":0.5119719086123997},{"text":"新颖","weight":0.42495829378610805},{"text":"有趣","weight":0.1755582236445252},{"text":"完美","weight":0.17920078234585937},{"text":"体胖","weight":0.31591205524197924},{"text":"尊重","weight":0.109006762042035},{"text":"高大","weight":0.09193342360519235},{"text":"怡情","weight":0.23094800512635055},{"text":"自健","weight":0.11796199081145751},{"text":"挺好玩","weight":0.13819934029643982},{"text":"有心","weight":0.050072519956381206},{"text":"弱爆","weight":0.15033364352926498},{"text":"美好","weight":0.21557084309146093},{"text":"意外","weight":0.17117602299537715},{"text":"尖锐","weight":0.2255729983405448},{"text":"轻松","weight":0.2567442720479445},{"text":"充满","weight":0.22990470911970454},{"text":"很棒","weight":0.20916208990497717},{"text":"节目","weight":0.4360216414382696},{"text":"尺度","weight":0.018816718841925352},{"text":"综艺","weight":0.010353816107950926},{"text":"大会","weight":0.5010854899804574},{"text":"池子","weight":0.01993052197426375},{"text":"下架","weight":0.007119771790894495},{"text":"背稿","weight":0.11775395852776457},{"text":"稿子","weight":0.2641503283758136},{"text":"蛋蛋","weight":0.09244745629322874},{"text":"笑点","weight":0.1510159122692947},{"text":"网络","weight":0.10518432920302659},{"text":"文化","weight":0.2020003239958681},{"text":"全程","weight":0.008781984212929913},{"text":"痕迹","weight":0.15509127748896626},{"text":"台词","weight":0.08546405768280821},{"text":"原版","weight":0.16378008469744262},{"text":"一星","weight":0.13261845765180036},{"text":"风格","weight":0.05644501951279349},{"text":"老师","weight":0.15518238627660472},{"text":"节目组","weight":0.011954231385740184},{"text":"社会","weight":0.14767004182886825},{"text":"演员","weight":0.10205255815778197},{"text":"黄段子","weight":0.04225268450723097},{"text":"大度","weight":0.09026650529135347},{"text":"形式","weight":0.023958446948335807},{"text":"喜剧","weight":0.042036397686951936},{"text":"评分","weight":0.020487338415221736},{"text":"大胆","weight":0.06375146209984503},{"text":"话题","weight":0.09539901473865721},{"text":"自带","weight":0.0976400052053135},{"text":"内容","weight":0.03514099544531613},{"text":"美版","weight":0.060782922469426175},{"text":"全蛋","weight":0.11861553193158321},{"text":"勇气","weight":0.05929949662621047},{"text":"观众","weight":0.0727899004499725},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        