
 var infor = {"content":[{"name":"name","value":"向往的生活"},{"name":"主演","value":"何炅 黄磊 刘宪华 "},{"name":"类型","value":"真人秀"},{"name":"国家/地区","value":"中国大陆"},{"name":"开播日期","value":"2017"},{"name":"summary","value":"大型生活服务纪实节目《向往的生活》中黄磊与何炅首度荧屏合体，他们一个最适合做美食节目的男人和一个最适合做治愈节目的男人，外加音乐才子刘宪华，三人一起守拙归田园，将为观众们带来一幅“自力更生，自给自足，反映待 客之道”的生活画面。"},{"name":"评分","value":6.6},{"name":"image","value":"https://img5.doubanio.com/view/movie_poster_cover/lpst/public/p2414007256.jpg"},{"name":"id","value":"26873657"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [377302,347705,966711,489385,195274,166963,151664,391130,350320,910089,489694,212312,204088,182220,430923,373688,997163,537610,250647,205479,191444,422972,376103,1081401,542582,230400,216080,196506,448225,412750,902883,599107,255713,219021,195616,402823,360846,881457,594164,247872,218142,193672,417851,404685,1008958]
            }, ]
        };

        var word_list = [{"text":"简单","weight":0.19453091067383052},{"text":"善良","weight":0.2601167299325395},{"text":"有趣","weight":0.686184050941208},{"text":"舒服","weight":0.5408281777496906},{"text":"尴尬","weight":0.0073533953847834494},{"text":"一星","weight":0.672150076421446},{"text":"干净","weight":0.42846526513018773},{"text":"清新","weight":0.4383238843881883},{"text":"懒懒","weight":0.6251828250674323},{"text":"不错","weight":0.1312530764578159},{"text":"幽默","weight":0.6230919147342832},{"text":"无聊","weight":0.03893357107815997},{"text":"辛苦","weight":0.390676103587219},{"text":"轻松","weight":0.4290283261742071},{"text":"挺好","weight":0.539829078195742},{"text":"平淡","weight":0.33848577240055594},{"text":"和谐","weight":0.22396758096776148},{"text":"幸福","weight":0.42067438648417926},{"text":"浮躁","weight":0.3479085789421896},{"text":"庸俗","weight":0.17319837268520524},{"text":"最气","weight":0.46635281286217967},{"text":"最恨","weight":0.4817599349878421},{"text":"真诚","weight":0.2021060755549652},{"text":"爱和","weight":0.03176133221980837},{"text":"乐趣","weight":0.07692887626175939},{"text":"很好","weight":0.41683553486790836},{"text":"年轻","weight":0.2563061127878024},{"text":"诚恳","weight":0.4053303955660844},{"text":"艰辛","weight":0.29168157436557024},{"text":"活好","weight":0.32729491799171895},{"text":"快乐","weight":0.39943644941058404},{"text":"美好","weight":0.4375542137293138},{"text":"疯狂","weight":0.17216529984312431},{"text":"纯美","weight":0.016245091174258465},{"text":"精致","weight":0.19599302102817373},{"text":"节目","weight":1.0773142685029995},{"text":"老师","weight":1.1936941531976584},{"text":"综艺","weight":1.1345960040928764},{"text":"版权","weight":0.193314766707304},{"text":"农村","weight":0.14797362119379984},{"text":"小厨","weight":0.014164469621310382},{"text":"做菜","weight":0.09823316843876986},{"text":"广告","weight":0.06727165297529326},{"text":"观众","weight":0.15377760348654945},{"text":"原创","weight":0.08591708405191548},{"text":"原版","weight":0.08716433554633644},{"text":"样子","weight":0.04771269107828087},{"text":"爸爸","weight":0.07991716811553387},{"text":"儿子","weight":0.04479234673800927},{"text":"姑娘","weight":0.06833002980854336},{"text":"评论","weight":0.05717636089581109},{"text":"房子","weight":0.09831038998673679},{"text":"评分","weight":0.10467374848708942},{"text":"人生","weight":0.021667274460076248},{"text":"学生","weight":0.0001169736128035428},{"text":"动物","weight":0.026075649123470577},{"text":"国产","weight":0.03740341884963095},{"text":"类型","weight":0.09725539521470646},{"text":"自带","weight":0.002516071212622687},{"text":"朋友","weight":0.07178686415825344},{"text":"塑料","weight":0.0368429403819146},{"text":"智商","weight":0.11414831298531267},{"text":"全程","weight":0.047967955079382424},{"text":"内容","weight":0.06552758292973783},{"text":"垃圾","weight":0.07437937080539439},{"text":"芒果","weight":0.057354394919069344},{"text":"太重","weight":0.02503815040211234},{"text":"一星","weight":0.06390086601587198},{"text":"时代","weight":0.07526854572723815},{"text":"画面","weight":0.06519095915172846},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        