
 var infor = {"content":[{"name":"name","value":"快乐大本营"},{"name":"主演","value":"何炅 吴昕 杜海涛 谢娜 "},{"name":"类型","value":"脱口秀"},{"name":"国家/地区","value":"中国大陆"},{"name":"开播日期","value":"1997"},{"name":"summary","value":"《快乐大本营》是本土制造的综艺先锋，以“清新、青春、快乐、激情、八卦、生活”的娱乐风格在中国电视娱乐版图迅速卡位，其带动的明星效应和倡导的快乐理念至今生命力不减，十几年来已融为中国青少年文化的一部分，并为湖南卫视打造成中国第一电视娱乐品牌定下基调。不仅是湖南卫视一直保持至今的品牌节目，也是中国电视界综艺娱乐节目的领头羊；同时也是中国最有影响力的娱乐节目之一甚至成为中国亿万观众娱乐生活的一部分。娱乐圈内的知名艺人几乎都曾经登上过《快乐大本营》的舞台，留下属于他们的精彩瞬间。《快乐大本营》新创意的主题性综艺节目，为普通观众或草根团体及组合打造了一个展现个性的“全民娱乐”平台和分享快乐的机会，同时也极力为电视机前的观众推介时尚、新奇的文艺表演形式，传递“快乐至上”的娱乐精神，突出了以观众为主体的“娱乐天下”的节目理念。"},{"name":"评分","value":6.6},{"name":"image","value":"https://img3.doubanio.com/view/movie_poster_cover/lpst/public/p2188597823.jpg"},{"name":"id","value":"25908008"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [73442,94819,176411,108678,90105,78967,53161,81877,116666,84733,81877,80178,80765,81266,97890,155149,101988,92618,92310,87372,84743,94252,149320,79481,60836,218,55466,63273,117978,276787,108778,82785,71587,62447,72628,129893,190194,69985,55923,52347,49044,61871,111134,212689]
            }, ]
        };

        var word_list = [{"text":"快乐","weight":0.9221950114446084},{"text":"快本","weight":0.37428884307847576},{"text":"欢乐","weight":1.1474630670072332},{"text":"无聊","weight":0.5931539945630069},{"text":"尴尬","weight":0.4484692613946414},{"text":"不错","weight":1.1352686080674121},{"text":"孤独","weight":0.6552939267300996},{"text":"幽默","weight":0.3607237231659892},{"text":"幸福","weight":0.8166755487656874},{"text":"成熟","weight":0.637191961044075},{"text":"简单","weight":0.5939037146840132},{"text":"活泼","weight":0.5278844166684814},{"text":"清醒","weight":0.24711407875543553},{"text":"稳重","weight":0.5802483562774315},{"text":"灵活","weight":0.18192681861635673},{"text":"粗爆","weight":0.38173506564587684},{"text":"寂静","weight":0.5917881805834765},{"text":"悲伤","weight":0.010386580858408177},{"text":"短暂","weight":0.2099472717039223},{"text":"低极","weight":0.1157838088837848},{"text":"温和","weight":0.13077741097110887},{"text":"虚假","weight":0.2346111142014615},{"text":"抑郁","weight":0.3881287592428332},{"text":"独爱","weight":0.249727929628328},{"text":"挺乱","weight":0.014708835727278354},{"text":"重看","weight":0.0754001627806343},{"text":"常鲜","weight":0.019052596608697233},{"text":"辉煌","weight":0.050588162548688},{"text":"有趣","weight":0.013341721233054328},{"text":"必看","weight":0.10162120406606735},{"text":"幼稚","weight":0.04750371938999462},{"text":"最多","weight":0.06727765036052936},{"text":"很假","weight":0.013697356090470052},{"text":"健康","weight":0.014166601822440462},{"text":"興趣","weight":0.12029154608670094},{"text":"节目","weight":1.9547465552762369},{"text":"综艺","weight":1.319632230271275},{"text":"游戏","weight":0.026277146447922617},{"text":"大本营","weight":0.6419528211512734},{"text":"主持人","weight":0.010771476084401394},{"text":"观众","weight":0.3061956336194247},{"text":"老师","weight":0.24176649393374092},{"text":"陪伴","weight":0.3724798610766129},{"text":"时间","weight":0.23447908291960548},{"text":"情怀","weight":0.12452150416867147},{"text":"笑点","weight":0.09174705222493959},{"text":"电视","weight":0.22667340961741125},{"text":"小学","weight":0.1984066887025816},{"text":"小时候","weight":0.20221765496504157},{"text":"机智","weight":0.1228597498026547},{"text":"人员","weight":0.18196889993366439},{"text":"大学","weight":0.13346498593660133},{"text":"弱智","weight":0.006716805677015907},{"text":"习惯","weight":0.12405311783969944},{"text":"艺人","weight":0.0061578468030783024},{"text":"唱片","weight":0.000017791254513135332},{"text":"玩游戏","weight":0.028881400599882964},{"text":"智商","weight":0.11219552065975728},{"text":"电影","weight":0.08103928512235783},{"text":"世界","weight":0.03751010197950244},{"text":"老牌","weight":0.14199774160323578},{"text":"电视机","weight":0.006235386009423854},{"text":"理由","weight":0.1586064529446239},{"text":"粉丝","weight":0.04177972578113757},{"text":"机制","weight":0.07751194964036784},{"text":"距离","weight":0.1257669186923057},{"text":"无脑","weight":0.007381323123383819},{"text":"女朋友","weight":0.05145163369878018},{"text":"队友","weight":0.07439916568770286},{"text":"受众","weight":0.07083724995365673},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        