
 var infor = {"content":[{"name":"name","value":"朗读者"},{"name":"主演","value":"董卿 濮存昕 李敬泽 蒋励 "},{"name":"类型","value":"脱口秀"},{"name":"国家/地区","value":"中国大陆"},{"name":"开播日期","value":"2017"},{"name":"summary","value":"《朗读者》是中央电视台推出的大型文化情感类节目，著名节目主持人董卿首次担当制作人，央视创造传媒有限公司、中广天择传媒股份有限公司承担制作，于中央电视台综合频道与综艺频道黄金时间联合播出。以个人成长、情感体验、背景故事与传世佳作相结合的方式，选用精美的文字，用最平实的情感读出文字背后的价值，节目旨 在实现文化感染人、鼓舞人、教育人的传导作用，展现有血有肉的真实人物情感。\n《朗读者》邀请各个领域具有影响力的嘉宾来到现场，分享自己的人生故事并倾情演绎来自朗读者文学顾问团的国家顶级文学家、出版人、专家、学者精心挑选的经典美文，最终节目将会呈现出生命之美、文学之美和情感之美。\n《朗读者》是著名节目主持人董卿20多年电视经验的一次全情绽放，她不仅担纲节目的主持工作，还首次以制作人的身份转型大型电视节目的幕后制作，呈现出不同于以往主持人的另一面。董卿表示《朗读者》中的“朗读”二字重文字，“者”字重人。我们要展现有血有肉的真实人物情感，并感动于他们让观众遇见了大千世界。"},{"name":"评分","value":8.9},{"name":"image","value":"https://img3.doubanio.com/view/movie_poster_cover/lpst/public/p2431498091.jpg"},{"name":"id","value":"26818263"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [5213,2904,1510,1479,1404,1326,2276,1323,1410,1342,1507,1448,1454,1493,1500,2086,1782,1495,1587,1759,1710,1602,1500,1577,1547,55972,97567,110321,132232,244929,210181,135026,152097,159909,179789,214181,298472,237092,139372,133535,132470,139866,184776,272951,240543]
            }, ]
        };

        var word_list = [{"text":"浮躁","weight":0.8642806300567036},{"text":"快乐","weight":0.06413634466882241},{"text":"美好","weight":0.2271907393859559},{"text":"平凡","weight":0.5723133512351882},{"text":"充满","weight":0.623274142384296},{"text":"简单","weight":0.02754175363646052},{"text":"粗糙","weight":0.042132279677426006},{"text":"平静","weight":0.5655886477901807},{"text":"真挚","weight":0.274737208324206},{"text":"真诚","weight":0.0002330440409945966},{"text":"乐趣","weight":0.05613583533362947},{"text":"不错","weight":0.4376313975302454},{"text":"高贵","weight":0.059896671001721094},{"text":"优雅","weight":0.03409943489432903},{"text":"矫情","weight":0.028338796341088438},{"text":"悲伤","weight":0.13743197696905643},{"text":"短暂","weight":0.18971149488131037},{"text":"清高","weight":0.026428087225300392},{"text":"尴尬","weight":0.2903633433641495},{"text":"太美","weight":0.2627240527982392},{"text":"意外","weight":0.1545483628497415},{"text":"很棒","weight":0.21312370970386427},{"text":"欣喜","weight":0.33212898256704565},{"text":"惋惜","weight":0.20989100066271887},{"text":"强大","weight":0.35015611499915467},{"text":"愉快","weight":0.29982160854297385},{"text":"很好","weight":0.08289464723570023},{"text":"虚假","weight":0.32549728164195274},{"text":"繁荣","weight":0.006898090467535032},{"text":"柔软","weight":0.1677555793051271},{"text":"节目","weight":1.4247992661604945},{"text":"故事","weight":0.6762581716186135},{"text":"文化","weight":0.2902557301764391},{"text":"读者","weight":0.5823456378416436},{"text":"综艺","weight":0.41174357192033373},{"text":"文字","weight":0.2757852849345884},{"text":"人生","weight":0.18310365792341637},{"text":"读书","weight":0.22681126441175845},{"text":"情感","weight":0.12271821691363433},{"text":"文学","weight":0.2059133506682935},{"text":"内容","weight":0.18071178756545553},{"text":"老师","weight":0.053588348978849766},{"text":"观众","weight":0.17031595277003725},{"text":"感情","weight":0.14096070336694447},{"text":"声音","weight":0.05130674929210078},{"text":"时间","weight":0.051317480711630926},{"text":"意义","weight":0.13647989233781113},{"text":"清流","weight":0.13157180000705196},{"text":"内涵","weight":0.08876755189729278},{"text":"社会","weight":0.06548697966762748},{"text":"文章","weight":0.08858775171659498},{"text":"形式","weight":0.01218286700476205},{"text":"心灵","weight":0.08227582928693744},{"text":"人文","weight":0.003805955688461483},{"text":"世界","weight":0.14764442526440108},{"text":"主持人","weight":0.012345091021359316},{"text":"舞台","weight":0.11611767328724044},{"text":"力量","weight":0.013718795133102936},{"text":"动人","weight":0.008239946517841937},{"text":"内心","weight":0.01152606048525327},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        