
 var infor = {"content":[{"name":"name","value":"极限挑战第二季"},{"name":"主演","value":"黄渤 孙红雷 黄磊 罗志祥 "},{"name":"类型","value":"真人秀"},{"name":"国家/地区","value":"中国大陆"},{"name":"开播日期","value":"2016"},{"name":"summary","value":"《极限挑战第二季》是上海东方卫视推出的大型励志体验真人秀节目，节目共12期，第二季节目六位固定成员是黄渤、孙红雷、黄磊、罗志祥、王迅、张艺兴。\n《极限挑战第二季》每一期节目都围绕一个社会热点或时代背景而展开，节目中“极限男人帮”体验过出租车司机、家政服务等最平凡普通的职业；常走在城市街头，与普通百姓“亲密接触”，而路人们不再仅仅只是围观，也可能为节目的进展起到关键作用。\n节目于2016年4月17日起每周日晚21:00接档《欢乐喜剧人第二季》在东方卫视首播，24点优酷土豆独播。"},{"name":"评分","value":9.1},{"name":"image","value":"https://img5.doubanio.com/view/movie_poster_cover/lpst/public/p2329745796.jpg"},{"name":"id","value":"26615572"}]}
 
        var bar_stack_option = {
            title: {
                x: 'left'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: { // 坐标轴指示器，坐标轴触发有效
                    type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
                }
            },
            legend: {
                data: ['热度变化', '百度指数', '评论数']
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '3%',
                containLabel: true
            },
            xAxis: [{
                type: 'category',
                data: ['2017-01-20','2017-01-21','2017-01-22','2017-01-23','2017-01-24','2017-01-25','2017-01-26','2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31','2017-02-01','2017-02-02','2017-02-03','2017-02-04','2017-02-05','2017-02-06','2017-02-07','2017-02-08','2017-02-09','2017-02-10','2017-02-11','2017-02-12','2017-02-13','2017-02-14','2017-02-15','2017-02-16','2017-02-17','2017-02-18','2017-02-19','2017-02-20','2017-02-21','2017-02-22','2017-02-23','2017-02-24','2017-02-25','2017-02-26','2017-02-27','2017-02-28','2017-03-01','2017-03-02','2017-03-03','2017-03-04','2017-03-05']
            }],
            yAxis: [{
                name: '热度',
                type: 'value',
            }, {
                name: '评论数',
                type: 'value',
            }, {
                name: '百度指数',
                type: 'value',
                offset: 65
            }],
            series: [{
                name: '热度变化',
                type: 'line',
                data: []
            }, {
                name: '评论数',
                type: 'line',
                yAxisIndex: 1,
                data: []
            }, {
                name: '百度指数',
                type: 'line',
                yAxisIndex: 2,
                data: [3138,3650,5511,4859,4682,5101,5160,3413,4604,4004,4412,5313,5522,6318,7156,8124,7579,7061,7673,7450,6491,7536,6197,8203,6892,4577,4555,4005,4445,5762,5328,3942,4354,4141,3494,3674,4715,4147,2980,3077,3063,2893,3009,4286,6849]
            }, ]
        };

        var word_list = [{"text":"简单","weight":0.5893502171409918},{"text":"善良","weight":0.8997686424602619},{"text":"有趣","weight":0.7875644272152693},{"text":"舒服","weight":0.7172441525733517},{"text":"尴尬","weight":0.7650400540458903},{"text":"一星","weight":0.004418058429844629},{"text":"干净","weight":0.5755581692661932},{"text":"清新","weight":0.539736321634493},{"text":"懒懒","weight":0.4159591991324949},{"text":"不错","weight":0.43039225172692874},{"text":"幽默","weight":0.31976711622454956},{"text":"无聊","weight":0.16768797167738886},{"text":"辛苦","weight":0.6747399410996672},{"text":"轻松","weight":0.24187016629305336},{"text":"挺好","weight":0.14478759054342652},{"text":"平淡","weight":0.07586865667896045},{"text":"和谐","weight":0.027119952596559752},{"text":"幸福","weight":0.11443612742113518},{"text":"浮躁","weight":0.5106819008019657},{"text":"庸俗","weight":0.10142330484785281},{"text":"最气","weight":0.3872669782357093},{"text":"最恨","weight":0.24919648701067057},{"text":"真诚","weight":0.5031658696935676},{"text":"爱和","weight":0.21932017024276243},{"text":"乐趣","weight":0.13063026235336372},{"text":"很好","weight":0.48033857738356434},{"text":"年轻","weight":0.36748848630777026},{"text":"诚恳","weight":0.0924538760620798},{"text":"艰辛","weight":0.2391687616626522},{"text":"活好","weight":0.5018125109062292},{"text":"快乐","weight":0.3106661259701802},{"text":"美好","weight":0.06601615114696083},{"text":"疯狂","weight":0.2756730415080689},{"text":"纯美","weight":0.13917493879879245},{"text":"精致","weight":0.13546600872954703},{"text":"节目","weight":1.4114455361932228},{"text":"老师","weight":0.07865966046368542},{"text":"综艺","weight":0.06458574164468793},{"text":"版权","weight":0.05871164138509209},{"text":"农村","weight":0.31983603018917867},{"text":"小厨","weight":0.20574158095806935},{"text":"做菜","weight":0.09393129084495036},{"text":"广告","weight":0.1716203541039989},{"text":"观众","weight":0.13497604235383343},{"text":"原创","weight":0.08081090431508005},{"text":"原版","weight":0.08565155400640356},{"text":"样子","weight":0.0692583749339984},{"text":"爸爸","weight":0.13837017666729803},{"text":"儿子","weight":0.044530090323351076},{"text":"姑娘","weight":0.12741356851413765},{"text":"评论","weight":0.04518398015029097},{"text":"房子","weight":0.1057372883496954},{"text":"评分","weight":0.0814549494682383},{"text":"人生","weight":0.11381156679488033},{"text":"学生","weight":0.04985998583587415},{"text":"动物","weight":0.06505093438384298},{"text":"国产","weight":0.11669168421841068},{"text":"类型","weight":0.11185226912931559},{"text":"自带","weight":0.08264384935165706},{"text":"朋友","weight":0.0019714607116925785},{"text":"塑料","weight":0.09723331657717435},{"text":"智商","weight":0.03666338730307008},{"text":"全程","weight":0.01760791258391931},{"text":"内容","weight":0.025617891263864878},{"text":"垃圾","weight":0.10650123640607817},{"text":"芒果","weight":0.057404468386115216},{"text":"太重","weight":0.038918238173047515},{"text":"一星","weight":0.07549695732662977},{"text":"时代","weight":0.05298220607571976},{"text":"画面","weight":0.016974619605880367},{"text":"","weight":null}];


        ///////////////////////////////////////////////////////////////////////

        $('.product-details').html('<h5>简介：</h5><p class="intro"></p>');
        for (var i = 0; i < infor.content.length; ++i) {
            if (infor.content[i].name === 'summary') {
                $('.intro').html(infor.content[i].value);
            } else if (infor.content[i].name === 'id') {
                continue;
            } else if (infor.content[i].name === 'image') {
                $('.product-image-large img').attr('src', infor.content[i].value);
            } else if (infor.content[i].name === 'name') {
                $('.section-breadcrumbs h1').html(infor.content[i].value);
                $('title').html('冠影 · PREMIER MOVIE - ' + infor.content[i].value);
            } else {
                if(infor.content[i].value != null)
                $('#tab2 table').append('<tr><td>' + infor.content[i].name + '</td><td>' + infor.content[i].value + '</td></tr>')
            }
        }


        var tab1 = document.getElementById('tab1');
        var bar_dom = document.getElementById('bar_dom');

        echarts.init(bar_dom).setOption(bar_stack_option, true);
        $('#key_dom').jQCloud(word_list);

        function randomData() {
            return Math.round(Math.random() * 1000);
        }
        